{
 "irVersion": "0",
 "opsetImport": [],
 "producerName": "",
 "producerVersion": "",
 "domain": "",
 "modelVersion": "0",
 "docString": "",
 "graph": {
  "node": [
   {
    "input": [
     "1"
    ],
    "output": [
     "2"
    ],
    "name": "2",
    "opType": "neg",
    "domain": "",
    "attribute": [],
    "docString": ""
   },
   {
    "input": [
     "3"
    ],
    "output": [
     "4"
    ],
    "name": "4",
    "opType": "sin",
    "domain": "",
    "attribute": [
     {
      "name": "array",
      "refAttrName": "",
      "docString": "",
      "type": "FLOATS",
      "f": 0,
      "i": "0",
      "s": "",
      "floats": [
       3.3,
       2.1,
       7.6
      ],
      "ints": [],
      "strings": [],
      "tensors": [],
      "graphs": [],
      "sparseTensors": []
     },
     {
      "name": "num",
      "refAttrName": "",
      "docString": "",
      "type": "INT",
      "f": 0,
      "i": "54",
      "s": "",
      "floats": [],
      "ints": [],
      "strings": [],
      "tensors": [],
      "graphs": [],
      "sparseTensors": []
     }
    ],
    "docString": ""
   },
   {
    "input": [
     "4"
    ],
    "output": [
     "7"
    ],
    "name": "7",
    "opType": "onion",
    "domain": "",
    "attribute": [
     {
      "name": "layer",
      "refAttrName": "",
      "docString": "",
      "type": "GRAPH",
      "f": 0,
      "i": "0",
      "s": "",
      "g": {
       "node": [
        {
         "input": [
          "4",
          "3"
         ],
         "output": [
          "7"
         ],
         "name": "7",
         "opType": "+",
         "domain": "",
         "attribute": [
          {
           "name": "array",
           "refAttrName": "",
           "docString": "",
           "type": "INTS",
           "f": 0,
           "i": "0",
           "s": "",
           "floats": [],
           "ints": [
            "4",
            "6",
            "2"
           ],
           "strings": [],
           "tensors": [],
           "graphs": [],
           "sparseTensors": []
          },
          {
           "name": "num",
           "refAttrName": "",
           "docString": "",
           "type": "FLOAT",
           "f": 4.3,
           "i": "0",
           "s": "",
           "floats": [],
           "ints": [],
           "strings": [],
           "tensors": [],
           "graphs": [],
           "sparseTensors": []
          }
         ],
         "docString": ""
        }
       ],
       "name": "",
       "initializer": [],
       "sparseInitializer": [],
       "docString": "",
       "input": [
        {
         "name": "4",
         "type": {
          "tensorType": {
           "elemType": 0,
           "shape": {
            "dim": [
             {
              "denotation": "",
              "dimValue": "3"
             },
             {
              "denotation": "",
              "dimValue": "7"
             },
             {
              "denotation": "",
              "dimValue": "1"
             },
             {
              "denotation": "",
              "dimValue": "1"
             },
             {
              "denotation": "",
              "dimValue": "1"
             },
             {
              "denotation": "",
              "dimValue": "1"
             },
             {
              "denotation": "",
              "dimValue": "1"
             },
             {
              "denotation": "",
              "dimValue": "1"
             }
            ]
           }
          },
          "denotation": ""
         },
         "docString": ""
        }
       ],
       "output": [
        {
         "name": "7",
         "type": {
          "tensorType": {
           "elemType": 0,
           "shape": {
            "dim": [
             {
              "denotation": "",
              "dimValue": "3"
             },
             {
              "denotation": "",
              "dimValue": "7"
             },
             {
              "denotation": "",
              "dimValue": "1"
             },
             {
              "denotation": "",
              "dimValue": "1"
             },
             {
              "denotation": "",
              "dimValue": "1"
             },
             {
              "denotation": "",
              "dimValue": "1"
             },
             {
              "denotation": "",
              "dimValue": "1"
             },
             {
              "denotation": "",
              "dimValue": "1"
             }
            ]
           }
          },
          "denotation": ""
         },
         "docString": ""
        }
       ],
       "valueInfo": [],
       "quantizationAnnotation": []
      },
      "floats": [],
      "ints": [],
      "strings": [],
      "tensors": [],
      "graphs": [],
      "sparseTensors": []
     },
     {
      "name": "array",
      "refAttrName": "",
      "docString": "",
      "type": "INTS",
      "f": 0,
      "i": "0",
      "s": "",
      "floats": [],
      "ints": [
       "4",
       "6",
       "2"
      ],
      "strings": [],
      "tensors": [],
      "graphs": [],
      "sparseTensors": []
     },
     {
      "name": "num",
      "refAttrName": "",
      "docString": "",
      "type": "FLOAT",
      "f": 4.3,
      "i": "0",
      "s": "",
      "floats": [],
      "ints": [],
      "strings": [],
      "tensors": [],
      "graphs": [],
      "sparseTensors": []
     },
     {
      "name": "peanut",
      "refAttrName": "",
      "docString": "",
      "type": "GRAPH",
      "f": 0,
      "i": "0",
      "s": "",
      "g": {
       "node": [
        {
         "input": [
          "4",
          "3"
         ],
         "output": [
          "7"
         ],
         "name": "7",
         "opType": "+",
         "domain": "",
         "attribute": [
          {
           "name": "array",
           "refAttrName": "",
           "docString": "",
           "type": "INTS",
           "f": 0,
           "i": "0",
           "s": "",
           "floats": [],
           "ints": [
            "4",
            "6",
            "2"
           ],
           "strings": [],
           "tensors": [],
           "graphs": [],
           "sparseTensors": []
          },
          {
           "name": "num",
           "refAttrName": "",
           "docString": "",
           "type": "FLOAT",
           "f": 4.3,
           "i": "0",
           "s": "",
           "floats": [],
           "ints": [],
           "strings": [],
           "tensors": [],
           "graphs": [],
           "sparseTensors": []
          }
         ],
         "docString": ""
        }
       ],
       "name": "",
       "initializer": [],
       "sparseInitializer": [],
       "docString": "",
       "input": [
        {
         "name": "4",
         "type": {
          "tensorType": {
           "elemType": 0,
           "shape": {
            "dim": [
             {
              "denotation": "",
              "dimValue": "3"
             },
             {
              "denotation": "",
              "dimValue": "7"
             },
             {
              "denotation": "",
              "dimValue": "1"
             },
             {
              "denotation": "",
              "dimValue": "1"
             },
             {
              "denotation": "",
              "dimValue": "1"
             },
             {
              "denotation": "",
              "dimValue": "1"
             },
             {
              "denotation": "",
              "dimValue": "1"
             },
             {
              "denotation": "",
              "dimValue": "1"
             }
            ]
           }
          },
          "denotation": ""
         },
         "docString": ""
        }
       ],
       "output": [
        {
         "name": "7",
         "type": {
          "tensorType": {
           "elemType": 0,
           "shape": {
            "dim": [
             {
              "denotation": "",
              "dimValue": "3"
             },
             {
              "denotation": "",
              "dimValue": "7"
             },
             {
              "denotation": "",
              "dimValue": "1"
             },
             {
              "denotation": "",
              "dimValue": "1"
             },
             {
              "denotation": "",
              "dimValue": "1"
             },
             {
              "denotation": "",
              "dimValue": "1"
             },
             {
              "denotation": "",
              "dimValue": "1"
             },
             {
              "denotation": "",
              "dimValue": "1"
             }
            ]
           }
          },
          "denotation": ""
         },
         "docString": ""
        }
       ],
       "valueInfo": [],
       "quantizationAnnotation": []
      },
      "floats": [],
      "ints": [],
      "strings": [],
      "tensors": [],
      "graphs": [],
      "sparseTensors": []
     }
    ],
    "docString": ""
   },
   {
    "input": [
     "2",
     "7"
    ],
    "output": [
     "6"
    ],
    "name": "6",
    "opType": "/",
    "domain": "",
    "attribute": [],
    "docString": ""
   },
   {
    "input": [
     "6",
     "predictable"
    ],
    "output": [
     "8"
    ],
    "name": "8",
    "opType": "@",
    "domain": "",
    "attribute": [],
    "docString": ""
   },
   {
    "input": [
     "0",
     "8"
    ],
    "output": [
     "root1"
    ],
    "name": "root1",
    "opType": "-",
    "domain": "",
    "attribute": [],
    "docString": ""
   },
   {
    "input": [
     "10"
    ],
    "output": [
     "12"
    ],
    "name": "12",
    "opType": "abs",
    "domain": "",
    "attribute": [
     {
      "name": "strs",
      "refAttrName": "",
      "docString": "",
      "type": "STRINGS",
      "f": 0,
      "i": "0",
      "s": "",
      "floats": [],
      "ints": [],
      "strings": [
       "d29ybGQ=",
       "Zm9vZA=="
      ],
      "tensors": [],
      "graphs": [],
      "sparseTensors": []
     },
     {
      "name": "tensors",
      "refAttrName": "",
      "docString": "",
      "type": "TENSORS",
      "f": 0,
      "i": "0",
      "s": "",
      "floats": [],
      "ints": [],
      "strings": [],
      "tensors": [
       {
        "dims": [],
        "dataType": 0,
        "floatData": [],
        "int32Data": [],
        "stringData": [],
        "int64Data": [],
        "name": "1",
        "docString": "",
        "rawData": "",
        "externalData": [],
        "dataLocation": "DEFAULT",
        "doubleData": [],
        "uint64Data": []
       },
       {
        "dims": [],
        "dataType": 0,
        "floatData": [],
        "int32Data": [],
        "stringData": [],
        "int64Data": [],
        "name": "11",
        "docString": "",
        "rawData": "",
        "externalData": [],
        "dataLocation": "DEFAULT",
        "doubleData": [],
        "uint64Data": []
       }
      ],
      "graphs": [],
      "sparseTensors": []
     }
    ],
    "docString": ""
   },
   {
    "input": [
     "13"
    ],
    "output": [
     "14"
    ],
    "name": "14",
    "opType": "exp",
    "domain": "",
    "attribute": [],
    "docString": ""
   },
   {
    "input": [
     "11"
    ],
    "output": [
     "15"
    ],
    "name": "15",
    "opType": "neg",
    "domain": "",
    "attribute": [],
    "docString": ""
   },
   {
    "input": [
     "12",
     "14",
     "15"
    ],
    "output": [
     "16"
    ],
    "name": "16",
    "opType": "*",
    "domain": "",
    "attribute": [
     {
      "name": "str",
      "refAttrName": "",
      "docString": "",
      "type": "STRING",
      "f": 0,
      "i": "0",
      "s": "aGVsbG8=",
      "floats": [],
      "ints": [],
      "strings": [],
      "tensors": [],
      "graphs": [],
      "sparseTensors": []
     }
    ],
    "docString": ""
   },
   {
    "input": [
     "10",
     "16"
    ],
    "output": [
     "root2"
    ],
    "name": "root2",
    "opType": "-",
    "domain": "",
    "attribute": [
     {
      "name": "pineapple",
      "refAttrName": "",
      "docString": "",
      "type": "TENSOR",
      "f": 0,
      "i": "0",
      "s": "",
      "t": {
       "dims": [],
       "dataType": 0,
       "floatData": [],
       "int32Data": [],
       "stringData": [],
       "int64Data": [],
       "name": "1",
       "docString": "",
       "rawData": "",
       "externalData": [],
       "dataLocation": "DEFAULT",
       "doubleData": [],
       "uint64Data": []
      },
      "floats": [],
      "ints": [],
      "strings": [],
      "tensors": [],
      "graphs": [],
      "sparseTensors": []
     }
    ],
    "docString": ""
   }
  ],
  "name": "",
  "initializer": [
   {
    "dims": [
     "3",
     "1",
     "7",
     "1",
     "1",
     "1",
     "1",
     "1"
    ],
    "dataType": 0,
    "floatData": [],
    "int32Data": [],
    "stringData": [],
    "int64Data": [],
    "name": "0",
    "docString": "",
    "rawData": "",
    "externalData": [],
    "dataLocation": "DEFAULT",
    "doubleData": [],
    "uint64Data": []
   },
   {
    "dims": [
     "3",
     "7",
     "1",
     "1",
     "1",
     "1",
     "1",
     "1"
    ],
    "dataType": 0,
    "floatData": [],
    "int32Data": [],
    "stringData": [],
    "int64Data": [],
    "name": "1",
    "docString": "",
    "rawData": "",
    "externalData": [],
    "dataLocation": "DEFAULT",
    "doubleData": [],
    "uint64Data": []
   },
   {
    "dims": [
     "3",
     "7",
     "1",
     "1",
     "1",
     "1",
     "1",
     "1"
    ],
    "dataType": 0,
    "floatData": [],
    "int32Data": [],
    "stringData": [],
    "int64Data": [],
    "name": "3",
    "docString": "",
    "rawData": "",
    "externalData": [],
    "dataLocation": "DEFAULT",
    "doubleData": [],
    "uint64Data": []
   },
   {
    "dims": [
     "3",
     "3",
     "1",
     "1",
     "1",
     "1",
     "1",
     "1"
    ],
    "dataType": 0,
    "floatData": [],
    "int32Data": [],
    "stringData": [],
    "int64Data": [],
    "name": "10",
    "docString": "",
    "rawData": "",
    "externalData": [],
    "dataLocation": "DEFAULT",
    "doubleData": [],
    "uint64Data": []
   },
   {
    "dims": [
     "3",
     "3",
     "1",
     "1",
     "1",
     "1",
     "1",
     "1"
    ],
    "dataType": 0,
    "floatData": [],
    "int32Data": [],
    "stringData": [],
    "int64Data": [],
    "name": "11",
    "docString": "",
    "rawData": "",
    "externalData": [],
    "dataLocation": "DEFAULT",
    "doubleData": [],
    "uint64Data": []
   },
   {
    "dims": [
     "3",
     "3",
     "1",
     "1",
     "1",
     "1",
     "1",
     "1"
    ],
    "dataType": 0,
    "floatData": [],
    "int32Data": [],
    "stringData": [],
    "int64Data": [],
    "name": "13",
    "docString": "",
    "rawData": "",
    "externalData": [],
    "dataLocation": "DEFAULT",
    "doubleData": [],
    "uint64Data": []
   }
  ],
  "sparseInitializer": [],
  "docString": "",
  "input": [
   {
    "name": "predictable",
    "type": {
     "tensorType": {
      "elemType": 0,
      "shape": {
       "dim": [
        {
         "denotation": "",
         "dimValue": "7"
        },
        {
         "denotation": "",
         "dimValue": "3"
        },
        {
         "denotation": "",
         "dimValue": "1"
        },
        {
         "denotation": "",
         "dimValue": "1"
        },
        {
         "denotation": "",
         "dimValue": "1"
        },
        {
         "denotation": "",
         "dimValue": "1"
        },
        {
         "denotation": "",
         "dimValue": "1"
        },
        {
         "denotation": "",
         "dimValue": "1"
        }
       ]
      }
     },
     "denotation": ""
    },
    "docString": ""
   }
  ],
  "output": [
   {
    "name": "root1",
    "type": {
     "tensorType": {
      "elemType": 0,
      "shape": {
       "dim": [
        {
         "denotation": "",
         "dimValue": "3"
        },
        {
         "denotation": "",
         "dimValue": "1"
        },
        {
         "denotation": "",
         "dimValue": "7"
        },
        {
         "denotation": "",
         "dimValue": "1"
        },
        {
         "denotation": "",
         "dimValue": "1"
        },
        {
         "denotation": "",
         "dimValue": "1"
        },
        {
         "denotation": "",
         "dimValue": "1"
        },
        {
         "denotation": "",
         "dimValue": "1"
        }
       ]
      }
     },
     "denotation": ""
    },
    "docString": ""
   },
   {
    "name": "root2",
    "type": {
     "tensorType": {
      "elemType": 0,
      "shape": {
       "dim": [
        {
         "denotation": "",
         "dimValue": "3"
        },
        {
         "denotation": "",
         "dimValue": "3"
        },
        {
         "denotation": "",
         "dimValue": "1"
        },
        {
         "denotation": "",
         "dimValue": "1"
        },
        {
         "denotation": "",
         "dimValue": "1"
        },
        {
         "denotation": "",
         "dimValue": "1"
        },
        {
         "denotation": "",
         "dimValue": "1"
        },
        {
         "denotation": "",
         "dimValue": "1"
        }
       ]
      }
     },
     "denotation": ""
    },
    "docString": ""
   }
  ],
  "valueInfo": [],
  "quantizationAnnotation": [
   {
    "tensorName": "0",
    "quantParameterTensorNames": [
     {
      "key": "TENSOR_NAME",
      "value": "src2"
     },
     {
      "key": "LEAF_USAGE",
      "value": "constant"
     }
    ]
   },
   {
    "tensorName": "1",
    "quantParameterTensorNames": [
     {
      "key": "TENSOR_NAME",
      "value": "osrc"
     },
     {
      "key": "LEAF_USAGE",
      "value": "constant"
     }
    ]
   },
   {
    "tensorName": "3",
    "quantParameterTensorNames": [
     {
      "key": "TENSOR_NAME",
      "value": "src"
     },
     {
      "key": "LEAF_USAGE",
      "value": "constant"
     }
    ]
   },
   {
    "tensorName": "predictable",
    "quantParameterTensorNames": [
     {
      "key": "TENSOR_NAME",
      "value": "osrc2"
     },
     {
      "key": "LEAF_USAGE",
      "value": "placeholder"
     }
    ]
   },
   {
    "tensorName": "10",
    "quantParameterTensorNames": [
     {
      "key": "TENSOR_NAME",
      "value": "s2src"
     },
     {
      "key": "LEAF_USAGE",
      "value": "constant"
     }
    ]
   },
   {
    "tensorName": "11",
    "quantParameterTensorNames": [
     {
      "key": "TENSOR_NAME",
      "value": "s2src3"
     },
     {
      "key": "LEAF_USAGE",
      "value": "constant"
     }
    ]
   },
   {
    "tensorName": "13",
    "quantParameterTensorNames": [
     {
      "key": "TENSOR_NAME",
      "value": "s2src2"
     },
     {
      "key": "LEAF_USAGE",
      "value": "constant"
     }
    ]
   }
  ]
 },
 "metadataProps": []
}
