{
 "irVersion": "6",
 "opsetImport": [],
 "producerName": "tenncor",
 "producerVersion": "1.0.0",
 "domain": "com.mingkaic.tenncor",
 "modelVersion": "6",
 "docString": "",
 "graph": {
  "node": [
   {
    "input": [
     "0",
     "1"
    ],
    "output": [
     "root"
    ],
    "name": "root",
    "opType": "MUL",
    "domain": "",
    "attribute": [],
    "docString": ""
   }
  ],
  "name": "",
  "initializer": [
   {
    "dims": [
     "10",
     "2",
     "1",
     "1",
     "1",
     "1",
     "1",
     "1"
    ],
    "dataType": 11,
    "floatData": [],
    "int32Data": [],
    "stringData": [],
    "int64Data": [],
    "name": "0",
    "docString": "",
    "rawData": "",
    "externalData": [],
    "dataLocation": "DEFAULT",
    "doubleData": [
     0,
     0,
     0,
     0,
     0,
     0,
     0,
     0,
     0,
     0,
     0,
     0,
     0,
     0,
     0,
     0,
     0,
     0,
     0,
     0
    ],
    "uint64Data": []
   },
   {
    "dims": [
     "10",
     "2",
     "1",
     "1",
     "1",
     "1",
     "1",
     "1"
    ],
    "dataType": 11,
    "floatData": [],
    "int32Data": [],
    "stringData": [],
    "int64Data": [],
    "name": "1",
    "docString": "",
    "rawData": "",
    "externalData": [],
    "dataLocation": "DEFAULT",
    "doubleData": [
     0,
     0,
     0,
     0,
     0,
     0,
     0,
     0,
     0,
     0,
     0,
     0,
     0,
     0,
     0,
     0,
     0,
     0,
     0,
     0
    ],
    "uint64Data": []
   }
  ],
  "sparseInitializer": [],
  "docString": "",
  "input": [],
  "output": [
   {
    "name": "root",
    "type": {
     "tensorType": {
      "elemType": 0,
      "shape": {
       "dim": [
        {
         "denotation": "",
         "dimValue": "10"
        },
        {
         "denotation": "",
         "dimValue": "2"
        },
        {
         "denotation": "",
         "dimValue": "1"
        },
        {
         "denotation": "",
         "dimValue": "1"
        },
        {
         "denotation": "",
         "dimValue": "1"
        },
        {
         "denotation": "",
         "dimValue": "1"
        },
        {
         "denotation": "",
         "dimValue": "1"
        },
        {
         "denotation": "",
         "dimValue": "1"
        }
       ]
      }
     },
     "denotation": ""
    },
    "docString": ""
   }
  ],
  "valueInfo": [],
  "quantizationAnnotation": [
   {
    "tensorName": "0",
    "quantParameterTensorNames": [
     {
      "key": "TENSOR_NAME",
      "value": "a"
     },
     {
      "key": "LEAF_USAGE",
      "value": "variable"
     }
    ]
   },
   {
    "tensorName": "1",
    "quantParameterTensorNames": [
     {
      "key": "TENSOR_NAME",
      "value": "b"
     },
     {
      "key": "LEAF_USAGE",
      "value": "variable"
     }
    ]
   }
  ]
 },
 "metadataProps": []
}
