{
 "irVersion": "6",
 "opsetImport": [],
 "producerName": "tenncor",
 "producerVersion": "1.0.0",
 "domain": "com.tenncor.eteq",
 "modelVersion": "6",
 "docString": "",
 "graph": {
  "node": [
   {
    "input": [
     "0"
    ],
    "output": [
     "1"
    ],
    "name": "1",
    "opType": "EXTEND",
    "domain": "",
    "attribute": [
     {
      "name": "dimensions",
      "refAttrName": "",
      "docString": "",
      "type": "INTS",
      "f": 0,
      "i": "0",
      "s": "",
      "floats": [],
      "ints": [
       "1",
       "1",
       "9"
      ],
      "strings": [],
      "tensors": [],
      "graphs": [],
      "sparseTensors": []
     }
    ],
    "docString": ""
   },
   {
    "input": [
     "1"
    ],
    "output": [
     "2"
    ],
    "name": "2",
    "opType": "PERMUTE",
    "domain": "",
    "attribute": [
     {
      "name": "ranks",
      "refAttrName": "",
      "docString": "",
      "type": "INTS",
      "f": 0,
      "i": "0",
      "s": "",
      "floats": [],
      "ints": [
       "2",
       "1",
       "0"
      ],
      "strings": [],
      "tensors": [],
      "graphs": [],
      "sparseTensors": []
     }
    ],
    "docString": ""
   },
   {
    "input": [
     "0",
     "5"
    ],
    "output": [
     "6"
    ],
    "name": "6",
    "opType": "MATMUL",
    "domain": "",
    "attribute": [
     {
      "name": "rank_pairs",
      "refAttrName": "",
      "docString": "",
      "type": "INTS",
      "f": 0,
      "i": "0",
      "s": "",
      "floats": [],
      "ints": [
       "0",
       "1"
      ],
      "strings": [],
      "tensors": [],
      "graphs": [],
      "sparseTensors": []
     }
    ],
    "docString": ""
   },
   {
    "input": [
     "7"
    ],
    "output": [
     "8"
    ],
    "name": "8",
    "opType": "EXTEND",
    "domain": "",
    "attribute": [
     {
      "name": "dimensions",
      "refAttrName": "",
      "docString": "",
      "type": "INTS",
      "f": 0,
      "i": "0",
      "s": "",
      "floats": [],
      "ints": [
       "1",
       "3"
      ],
      "strings": [],
      "tensors": [],
      "graphs": [],
      "sparseTensors": []
     }
    ],
    "docString": ""
   },
   {
    "input": [
     "6",
     "8"
    ],
    "output": [
     "9"
    ],
    "name": "9",
    "opType": "ADD",
    "domain": "",
    "attribute": [
     {
      "name": "commutative",
      "refAttrName": "",
      "docString": "",
      "type": "STRING",
      "f": 0,
      "i": "0",
      "s": "",
      "floats": [],
      "ints": [],
      "strings": [],
      "tensors": [],
      "graphs": [],
      "sparseTensors": []
     }
    ],
    "docString": ""
   },
   {
    "input": [
     "9"
    ],
    "output": [
     "10"
    ],
    "name": "10",
    "opType": "NEG",
    "domain": "",
    "attribute": [],
    "docString": ""
   },
   {
    "input": [
     "10"
    ],
    "output": [
     "11"
    ],
    "name": "11",
    "opType": "EXP",
    "domain": "",
    "attribute": [],
    "docString": ""
   },
   {
    "input": [
     "14"
    ],
    "output": [
     "15"
    ],
    "name": "15",
    "opType": "EXTEND",
    "domain": "",
    "attribute": [
     {
      "name": "tensor",
      "refAttrName": "",
      "docString": "",
      "type": "TENSOR",
      "f": 0,
      "i": "0",
      "s": "",
      "t": {
       "dims": [],
       "dataType": 0,
       "floatData": [],
       "int32Data": [],
       "stringData": [],
       "int64Data": [],
       "name": "11",
       "docString": "",
       "rawData": "",
       "externalData": [],
       "dataLocation": "DEFAULT",
       "doubleData": [],
       "uint64Data": []
      },
      "floats": [],
      "ints": [],
      "strings": [],
      "tensors": [],
      "graphs": [],
      "sparseTensors": []
     }
    ],
    "docString": ""
   },
   {
    "input": [
     "15",
     "11"
    ],
    "output": [
     "16"
    ],
    "name": "16",
    "opType": "ADD",
    "domain": "",
    "attribute": [
     {
      "name": "commutative",
      "refAttrName": "",
      "docString": "",
      "type": "STRING",
      "f": 0,
      "i": "0",
      "s": "",
      "floats": [],
      "ints": [],
      "strings": [],
      "tensors": [],
      "graphs": [],
      "sparseTensors": []
     }
    ],
    "docString": ""
   },
   {
    "input": [
     "13"
    ],
    "output": [
     "17"
    ],
    "name": "17",
    "opType": "EXTEND",
    "domain": "",
    "attribute": [
     {
      "name": "tensor",
      "refAttrName": "",
      "docString": "",
      "type": "TENSOR",
      "f": 0,
      "i": "0",
      "s": "",
      "t": {
       "dims": [],
       "dataType": 0,
       "floatData": [],
       "int32Data": [],
       "stringData": [],
       "int64Data": [],
       "name": "16",
       "docString": "",
       "rawData": "",
       "externalData": [],
       "dataLocation": "DEFAULT",
       "doubleData": [],
       "uint64Data": []
      },
      "floats": [],
      "ints": [],
      "strings": [],
      "tensors": [],
      "graphs": [],
      "sparseTensors": []
     }
    ],
    "docString": ""
   },
   {
    "input": [
     "17"
    ],
    "output": [
     "18"
    ],
    "name": "18",
    "opType": "NEG",
    "domain": "",
    "attribute": [],
    "docString": ""
   },
   {
    "input": [
     "18",
     "16"
    ],
    "output": [
     "19"
    ],
    "name": "19",
    "opType": "DIV",
    "domain": "",
    "attribute": [],
    "docString": ""
   },
   {
    "input": [
     "19",
     "16"
    ],
    "output": [
     "20"
    ],
    "name": "20",
    "opType": "DIV",
    "domain": "",
    "attribute": [],
    "docString": ""
   },
   {
    "input": [
     "21"
    ],
    "output": [
     "22"
    ],
    "name": "22",
    "opType": "EXTEND",
    "domain": "",
    "attribute": [
     {
      "name": "dimensions",
      "refAttrName": "",
      "docString": "",
      "type": "INTS",
      "f": 0,
      "i": "0",
      "s": "",
      "floats": [],
      "ints": [
       "1",
       "1",
       "3"
      ],
      "strings": [],
      "tensors": [],
      "graphs": [],
      "sparseTensors": []
     }
    ],
    "docString": ""
   },
   {
    "input": [
     "22"
    ],
    "output": [
     "23"
    ],
    "name": "23",
    "opType": "PERMUTE",
    "domain": "",
    "attribute": [
     {
      "name": "ranks",
      "refAttrName": "",
      "docString": "",
      "type": "INTS",
      "f": 0,
      "i": "0",
      "s": "",
      "floats": [],
      "ints": [
       "0",
       "2",
       "1"
      ],
      "strings": [],
      "tensors": [],
      "graphs": [],
      "sparseTensors": []
     }
    ],
    "docString": ""
   },
   {
    "input": [
     "17",
     "16"
    ],
    "output": [
     "26"
    ],
    "name": "26",
    "opType": "DIV",
    "domain": "",
    "attribute": [],
    "docString": ""
   },
   {
    "input": [
     "26",
     "21"
    ],
    "output": [
     "27"
    ],
    "name": "27",
    "opType": "MATMUL",
    "domain": "",
    "attribute": [
     {
      "name": "rank_pairs",
      "refAttrName": "",
      "docString": "",
      "type": "INTS",
      "f": 0,
      "i": "0",
      "s": "",
      "floats": [],
      "ints": [
       "0",
       "1"
      ],
      "strings": [],
      "tensors": [],
      "graphs": [],
      "sparseTensors": []
     }
    ],
    "docString": ""
   },
   {
    "input": [
     "28"
    ],
    "output": [
     "29"
    ],
    "name": "29",
    "opType": "EXTEND",
    "domain": "",
    "attribute": [
     {
      "name": "dimensions",
      "refAttrName": "",
      "docString": "",
      "type": "INTS",
      "f": 0,
      "i": "0",
      "s": "",
      "floats": [],
      "ints": [
       "1",
       "3"
      ],
      "strings": [],
      "tensors": [],
      "graphs": [],
      "sparseTensors": []
     }
    ],
    "docString": ""
   },
   {
    "input": [
     "27",
     "29"
    ],
    "output": [
     "30"
    ],
    "name": "30",
    "opType": "ADD",
    "domain": "",
    "attribute": [
     {
      "name": "commutative",
      "refAttrName": "",
      "docString": "",
      "type": "STRING",
      "f": 0,
      "i": "0",
      "s": "",
      "floats": [],
      "ints": [],
      "strings": [],
      "tensors": [],
      "graphs": [],
      "sparseTensors": []
     }
    ],
    "docString": ""
   },
   {
    "input": [
     "30"
    ],
    "output": [
     "31"
    ],
    "name": "31",
    "opType": "NEG",
    "domain": "",
    "attribute": [],
    "docString": ""
   },
   {
    "input": [
     "31"
    ],
    "output": [
     "32"
    ],
    "name": "32",
    "opType": "EXP",
    "domain": "",
    "attribute": [],
    "docString": ""
   },
   {
    "input": [
     "35"
    ],
    "output": [
     "36"
    ],
    "name": "36",
    "opType": "EXTEND",
    "domain": "",
    "attribute": [
     {
      "name": "tensor",
      "refAttrName": "",
      "docString": "",
      "type": "TENSOR",
      "f": 0,
      "i": "0",
      "s": "",
      "t": {
       "dims": [],
       "dataType": 0,
       "floatData": [],
       "int32Data": [],
       "stringData": [],
       "int64Data": [],
       "name": "32",
       "docString": "",
       "rawData": "",
       "externalData": [],
       "dataLocation": "DEFAULT",
       "doubleData": [],
       "uint64Data": []
      },
      "floats": [],
      "ints": [],
      "strings": [],
      "tensors": [],
      "graphs": [],
      "sparseTensors": []
     }
    ],
    "docString": ""
   },
   {
    "input": [
     "36",
     "32"
    ],
    "output": [
     "37"
    ],
    "name": "37",
    "opType": "ADD",
    "domain": "",
    "attribute": [
     {
      "name": "commutative",
      "refAttrName": "",
      "docString": "",
      "type": "STRING",
      "f": 0,
      "i": "0",
      "s": "",
      "floats": [],
      "ints": [],
      "strings": [],
      "tensors": [],
      "graphs": [],
      "sparseTensors": []
     }
    ],
    "docString": ""
   },
   {
    "input": [
     "34"
    ],
    "output": [
     "38"
    ],
    "name": "38",
    "opType": "EXTEND",
    "domain": "",
    "attribute": [
     {
      "name": "tensor",
      "refAttrName": "",
      "docString": "",
      "type": "TENSOR",
      "f": 0,
      "i": "0",
      "s": "",
      "t": {
       "dims": [],
       "dataType": 0,
       "floatData": [],
       "int32Data": [],
       "stringData": [],
       "int64Data": [],
       "name": "37",
       "docString": "",
       "rawData": "",
       "externalData": [],
       "dataLocation": "DEFAULT",
       "doubleData": [],
       "uint64Data": []
      },
      "floats": [],
      "ints": [],
      "strings": [],
      "tensors": [],
      "graphs": [],
      "sparseTensors": []
     }
    ],
    "docString": ""
   },
   {
    "input": [
     "38"
    ],
    "output": [
     "39"
    ],
    "name": "39",
    "opType": "NEG",
    "domain": "",
    "attribute": [],
    "docString": ""
   },
   {
    "input": [
     "39",
     "37"
    ],
    "output": [
     "40"
    ],
    "name": "40",
    "opType": "DIV",
    "domain": "",
    "attribute": [],
    "docString": ""
   },
   {
    "input": [
     "40",
     "37"
    ],
    "output": [
     "41"
    ],
    "name": "41",
    "opType": "DIV",
    "domain": "",
    "attribute": [],
    "docString": ""
   },
   {
    "input": [
     "38",
     "37"
    ],
    "output": [
     "45"
    ],
    "name": "45",
    "opType": "DIV",
    "domain": "",
    "attribute": [],
    "docString": ""
   },
   {
    "input": [
     "44",
     "45"
    ],
    "output": [
     "46"
    ],
    "name": "46",
    "opType": "SUB",
    "domain": "",
    "attribute": [],
    "docString": ""
   },
   {
    "input": [
     "43"
    ],
    "output": [
     "47"
    ],
    "name": "47",
    "opType": "EXTEND",
    "domain": "",
    "attribute": [
     {
      "name": "tensor",
      "refAttrName": "",
      "docString": "",
      "type": "TENSOR",
      "f": 0,
      "i": "0",
      "s": "",
      "t": {
       "dims": [],
       "dataType": 0,
       "floatData": [],
       "int32Data": [],
       "stringData": [],
       "int64Data": [],
       "name": "46",
       "docString": "",
       "rawData": "",
       "externalData": [],
       "dataLocation": "DEFAULT",
       "doubleData": [],
       "uint64Data": []
      },
      "floats": [],
      "ints": [],
      "strings": [],
      "tensors": [],
      "graphs": [],
      "sparseTensors": []
     }
    ],
    "docString": ""
   },
   {
    "input": [
     "48"
    ],
    "output": [
     "49"
    ],
    "name": "49",
    "opType": "EXTEND",
    "domain": "",
    "attribute": [
     {
      "name": "tensor",
      "refAttrName": "",
      "docString": "",
      "type": "TENSOR",
      "f": 0,
      "i": "0",
      "s": "",
      "t": {
       "dims": [],
       "dataType": 0,
       "floatData": [],
       "int32Data": [],
       "stringData": [],
       "int64Data": [],
       "name": "47",
       "docString": "",
       "rawData": "",
       "externalData": [],
       "dataLocation": "DEFAULT",
       "doubleData": [],
       "uint64Data": []
      },
      "floats": [],
      "ints": [],
      "strings": [],
      "tensors": [],
      "graphs": [],
      "sparseTensors": []
     }
    ],
    "docString": ""
   },
   {
    "input": [
     "47",
     "49"
    ],
    "output": [
     "50"
    ],
    "name": "50",
    "opType": "SUB",
    "domain": "",
    "attribute": [],
    "docString": ""
   },
   {
    "input": [
     "46",
     "50"
    ],
    "output": [
     "51"
    ],
    "name": "51",
    "opType": "POW",
    "domain": "",
    "attribute": [],
    "docString": ""
   },
   {
    "input": [
     "47",
     "51"
    ],
    "output": [
     "52"
    ],
    "name": "52",
    "opType": "MUL",
    "domain": "",
    "attribute": [
     {
      "name": "commutative",
      "refAttrName": "",
      "docString": "",
      "type": "STRING",
      "f": 0,
      "i": "0",
      "s": "",
      "floats": [],
      "ints": [],
      "strings": [],
      "tensors": [],
      "graphs": [],
      "sparseTensors": []
     }
    ],
    "docString": ""
   },
   {
    "input": [
     "52",
     "53"
    ],
    "output": [
     "54"
    ],
    "name": "54",
    "opType": "MUL",
    "domain": "",
    "attribute": [
     {
      "name": "commutative",
      "refAttrName": "",
      "docString": "",
      "type": "STRING",
      "f": 0,
      "i": "0",
      "s": "",
      "floats": [],
      "ints": [],
      "strings": [],
      "tensors": [],
      "graphs": [],
      "sparseTensors": []
     }
    ],
    "docString": ""
   },
   {
    "input": [
     "42",
     "54"
    ],
    "output": [
     "55"
    ],
    "name": "55",
    "opType": "MUL",
    "domain": "",
    "attribute": [
     {
      "name": "commutative",
      "refAttrName": "",
      "docString": "",
      "type": "STRING",
      "f": 0,
      "i": "0",
      "s": "",
      "floats": [],
      "ints": [],
      "strings": [],
      "tensors": [],
      "graphs": [],
      "sparseTensors": []
     }
    ],
    "docString": ""
   },
   {
    "input": [
     "41",
     "55"
    ],
    "output": [
     "56"
    ],
    "name": "56",
    "opType": "MUL",
    "domain": "",
    "attribute": [
     {
      "name": "commutative",
      "refAttrName": "",
      "docString": "",
      "type": "STRING",
      "f": 0,
      "i": "0",
      "s": "",
      "floats": [],
      "ints": [],
      "strings": [],
      "tensors": [],
      "graphs": [],
      "sparseTensors": []
     }
    ],
    "docString": ""
   },
   {
    "input": [
     "33",
     "56"
    ],
    "output": [
     "57"
    ],
    "name": "57",
    "opType": "MUL",
    "domain": "",
    "attribute": [
     {
      "name": "commutative",
      "refAttrName": "",
      "docString": "",
      "type": "STRING",
      "f": 0,
      "i": "0",
      "s": "",
      "floats": [],
      "ints": [],
      "strings": [],
      "tensors": [],
      "graphs": [],
      "sparseTensors": []
     }
    ],
    "docString": ""
   },
   {
    "input": [
     "32",
     "57"
    ],
    "output": [
     "58"
    ],
    "name": "58",
    "opType": "MUL",
    "domain": "",
    "attribute": [
     {
      "name": "commutative",
      "refAttrName": "",
      "docString": "",
      "type": "STRING",
      "f": 0,
      "i": "0",
      "s": "",
      "floats": [],
      "ints": [],
      "strings": [],
      "tensors": [],
      "graphs": [],
      "sparseTensors": []
     }
    ],
    "docString": ""
   },
   {
    "input": [
     "25",
     "58"
    ],
    "output": [
     "59"
    ],
    "name": "59",
    "opType": "MUL",
    "domain": "",
    "attribute": [
     {
      "name": "commutative",
      "refAttrName": "",
      "docString": "",
      "type": "STRING",
      "f": 0,
      "i": "0",
      "s": "",
      "floats": [],
      "ints": [],
      "strings": [],
      "tensors": [],
      "graphs": [],
      "sparseTensors": []
     }
    ],
    "docString": ""
   },
   {
    "input": [
     "24",
     "59"
    ],
    "output": [
     "60"
    ],
    "name": "60",
    "opType": "MUL",
    "domain": "",
    "attribute": [
     {
      "name": "commutative",
      "refAttrName": "",
      "docString": "",
      "type": "STRING",
      "f": 0,
      "i": "0",
      "s": "",
      "floats": [],
      "ints": [],
      "strings": [],
      "tensors": [],
      "graphs": [],
      "sparseTensors": []
     }
    ],
    "docString": ""
   },
   {
    "input": [
     "60"
    ],
    "output": [
     "61"
    ],
    "name": "61",
    "opType": "EXTEND",
    "domain": "",
    "attribute": [
     {
      "name": "dimensions",
      "refAttrName": "",
      "docString": "",
      "type": "INTS",
      "f": 0,
      "i": "0",
      "s": "",
      "floats": [],
      "ints": [
       "1",
       "1",
       "9"
      ],
      "strings": [],
      "tensors": [],
      "graphs": [],
      "sparseTensors": []
     }
    ],
    "docString": ""
   },
   {
    "input": [
     "23",
     "61"
    ],
    "output": [
     "62"
    ],
    "name": "62",
    "opType": "MUL",
    "domain": "",
    "attribute": [
     {
      "name": "commutative",
      "refAttrName": "",
      "docString": "",
      "type": "STRING",
      "f": 0,
      "i": "0",
      "s": "",
      "floats": [],
      "ints": [],
      "strings": [],
      "tensors": [],
      "graphs": [],
      "sparseTensors": []
     }
    ],
    "docString": ""
   },
   {
    "input": [
     "62"
    ],
    "output": [
     "63"
    ],
    "name": "63",
    "opType": "PERMUTE",
    "domain": "",
    "attribute": [
     {
      "name": "ranks",
      "refAttrName": "",
      "docString": "",
      "type": "INTS",
      "f": 0,
      "i": "0",
      "s": "",
      "floats": [],
      "ints": [
       "2",
       "1",
       "0"
      ],
      "strings": [],
      "tensors": [],
      "graphs": [],
      "sparseTensors": []
     }
    ],
    "docString": ""
   },
   {
    "input": [
     "63"
    ],
    "output": [
     "64"
    ],
    "name": "64",
    "opType": "REDUCE_SUM",
    "domain": "",
    "attribute": [
     {
      "name": "rank_set",
      "refAttrName": "",
      "docString": "",
      "type": "INTS",
      "f": 0,
      "i": "0",
      "s": "",
      "floats": [],
      "ints": [
       "2",
       "3",
       "4",
       "5",
       "6",
       "7"
      ],
      "strings": [],
      "tensors": [],
      "graphs": [],
      "sparseTensors": []
     }
    ],
    "docString": ""
   },
   {
    "input": [
     "20",
     "64"
    ],
    "output": [
     "65"
    ],
    "name": "65",
    "opType": "MUL",
    "domain": "",
    "attribute": [
     {
      "name": "commutative",
      "refAttrName": "",
      "docString": "",
      "type": "STRING",
      "f": 0,
      "i": "0",
      "s": "",
      "floats": [],
      "ints": [],
      "strings": [],
      "tensors": [],
      "graphs": [],
      "sparseTensors": []
     }
    ],
    "docString": ""
   },
   {
    "input": [
     "12",
     "65"
    ],
    "output": [
     "66"
    ],
    "name": "66",
    "opType": "MUL",
    "domain": "",
    "attribute": [
     {
      "name": "commutative",
      "refAttrName": "",
      "docString": "",
      "type": "STRING",
      "f": 0,
      "i": "0",
      "s": "",
      "floats": [],
      "ints": [],
      "strings": [],
      "tensors": [],
      "graphs": [],
      "sparseTensors": []
     }
    ],
    "docString": ""
   },
   {
    "input": [
     "11",
     "66"
    ],
    "output": [
     "67"
    ],
    "name": "67",
    "opType": "MUL",
    "domain": "",
    "attribute": [
     {
      "name": "commutative",
      "refAttrName": "",
      "docString": "",
      "type": "STRING",
      "f": 0,
      "i": "0",
      "s": "",
      "floats": [],
      "ints": [],
      "strings": [],
      "tensors": [],
      "graphs": [],
      "sparseTensors": []
     }
    ],
    "docString": ""
   },
   {
    "input": [
     "4",
     "67"
    ],
    "output": [
     "68"
    ],
    "name": "68",
    "opType": "MUL",
    "domain": "",
    "attribute": [
     {
      "name": "commutative",
      "refAttrName": "",
      "docString": "",
      "type": "STRING",
      "f": 0,
      "i": "0",
      "s": "",
      "floats": [],
      "ints": [],
      "strings": [],
      "tensors": [],
      "graphs": [],
      "sparseTensors": []
     }
    ],
    "docString": ""
   },
   {
    "input": [
     "3",
     "68"
    ],
    "output": [
     "69"
    ],
    "name": "69",
    "opType": "MUL",
    "domain": "",
    "attribute": [
     {
      "name": "commutative",
      "refAttrName": "",
      "docString": "",
      "type": "STRING",
      "f": 0,
      "i": "0",
      "s": "",
      "floats": [],
      "ints": [],
      "strings": [],
      "tensors": [],
      "graphs": [],
      "sparseTensors": []
     }
    ],
    "docString": ""
   },
   {
    "input": [
     "69"
    ],
    "output": [
     "70"
    ],
    "name": "70",
    "opType": "EXTEND",
    "domain": "",
    "attribute": [
     {
      "name": "dimensions",
      "refAttrName": "",
      "docString": "",
      "type": "INTS",
      "f": 0,
      "i": "0",
      "s": "",
      "floats": [],
      "ints": [
       "1",
       "1",
       "10"
      ],
      "strings": [],
      "tensors": [],
      "graphs": [],
      "sparseTensors": []
     }
    ],
    "docString": ""
   },
   {
    "input": [
     "2",
     "70"
    ],
    "output": [
     "71"
    ],
    "name": "71",
    "opType": "MUL",
    "domain": "",
    "attribute": [
     {
      "name": "commutative",
      "refAttrName": "",
      "docString": "",
      "type": "STRING",
      "f": 0,
      "i": "0",
      "s": "",
      "floats": [],
      "ints": [],
      "strings": [],
      "tensors": [],
      "graphs": [],
      "sparseTensors": []
     }
    ],
    "docString": ""
   },
   {
    "input": [
     "71"
    ],
    "output": [
     "72"
    ],
    "name": "72",
    "opType": "PERMUTE",
    "domain": "",
    "attribute": [
     {
      "name": "ranks",
      "refAttrName": "",
      "docString": "",
      "type": "INTS",
      "f": 0,
      "i": "0",
      "s": "",
      "floats": [],
      "ints": [
       "0",
       "2",
       "1"
      ],
      "strings": [],
      "tensors": [],
      "graphs": [],
      "sparseTensors": []
     }
    ],
    "docString": ""
   },
   {
    "input": [
     "72"
    ],
    "output": [
     "dw0"
    ],
    "name": "dw0",
    "opType": "REDUCE_SUM",
    "domain": "",
    "attribute": [
     {
      "name": "rank_set",
      "refAttrName": "",
      "docString": "",
      "type": "INTS",
      "f": 0,
      "i": "0",
      "s": "",
      "floats": [],
      "ints": [
       "2",
       "3",
       "4",
       "5",
       "6",
       "7"
      ],
      "strings": [],
      "tensors": [],
      "graphs": [],
      "sparseTensors": []
     }
    ],
    "docString": ""
   },
   {
    "input": [
     "17"
    ],
    "output": [
     "78"
    ],
    "name": "78",
    "opType": "NEG",
    "domain": "",
    "attribute": [],
    "docString": ""
   },
   {
    "input": [
     "78",
     "16"
    ],
    "output": [
     "79"
    ],
    "name": "79",
    "opType": "DIV",
    "domain": "",
    "attribute": [],
    "docString": ""
   },
   {
    "input": [
     "79",
     "16"
    ],
    "output": [
     "80"
    ],
    "name": "80",
    "opType": "DIV",
    "domain": "",
    "attribute": [],
    "docString": ""
   },
   {
    "input": [
     "21"
    ],
    "output": [
     "81"
    ],
    "name": "81",
    "opType": "EXTEND",
    "domain": "",
    "attribute": [
     {
      "name": "dimensions",
      "refAttrName": "",
      "docString": "",
      "type": "INTS",
      "f": 0,
      "i": "0",
      "s": "",
      "floats": [],
      "ints": [
       "1",
       "1",
       "3"
      ],
      "strings": [],
      "tensors": [],
      "graphs": [],
      "sparseTensors": []
     }
    ],
    "docString": ""
   },
   {
    "input": [
     "81"
    ],
    "output": [
     "82"
    ],
    "name": "82",
    "opType": "PERMUTE",
    "domain": "",
    "attribute": [
     {
      "name": "ranks",
      "refAttrName": "",
      "docString": "",
      "type": "INTS",
      "f": 0,
      "i": "0",
      "s": "",
      "floats": [],
      "ints": [
       "0",
       "2",
       "1"
      ],
      "strings": [],
      "tensors": [],
      "graphs": [],
      "sparseTensors": []
     }
    ],
    "docString": ""
   },
   {
    "input": [
     "38"
    ],
    "output": [
     "86"
    ],
    "name": "86",
    "opType": "NEG",
    "domain": "",
    "attribute": [],
    "docString": ""
   },
   {
    "input": [
     "86",
     "37"
    ],
    "output": [
     "87"
    ],
    "name": "87",
    "opType": "DIV",
    "domain": "",
    "attribute": [],
    "docString": ""
   },
   {
    "input": [
     "87",
     "37"
    ],
    "output": [
     "88"
    ],
    "name": "88",
    "opType": "DIV",
    "domain": "",
    "attribute": [],
    "docString": ""
   },
   {
    "input": [
     "90"
    ],
    "output": [
     "91"
    ],
    "name": "91",
    "opType": "EXTEND",
    "domain": "",
    "attribute": [
     {
      "name": "tensor",
      "refAttrName": "",
      "docString": "",
      "type": "TENSOR",
      "f": 0,
      "i": "0",
      "s": "",
      "t": {
       "dims": [],
       "dataType": 0,
       "floatData": [],
       "int32Data": [],
       "stringData": [],
       "int64Data": [],
       "name": "47",
       "docString": "",
       "rawData": "",
       "externalData": [],
       "dataLocation": "DEFAULT",
       "doubleData": [],
       "uint64Data": []
      },
      "floats": [],
      "ints": [],
      "strings": [],
      "tensors": [],
      "graphs": [],
      "sparseTensors": []
     }
    ],
    "docString": ""
   },
   {
    "input": [
     "47",
     "91"
    ],
    "output": [
     "92"
    ],
    "name": "92",
    "opType": "SUB",
    "domain": "",
    "attribute": [],
    "docString": ""
   },
   {
    "input": [
     "46",
     "92"
    ],
    "output": [
     "93"
    ],
    "name": "93",
    "opType": "POW",
    "domain": "",
    "attribute": [],
    "docString": ""
   },
   {
    "input": [
     "47",
     "93"
    ],
    "output": [
     "94"
    ],
    "name": "94",
    "opType": "MUL",
    "domain": "",
    "attribute": [
     {
      "name": "commutative",
      "refAttrName": "",
      "docString": "",
      "type": "STRING",
      "f": 0,
      "i": "0",
      "s": "",
      "floats": [],
      "ints": [],
      "strings": [],
      "tensors": [],
      "graphs": [],
      "sparseTensors": []
     }
    ],
    "docString": ""
   },
   {
    "input": [
     "94",
     "95"
    ],
    "output": [
     "96"
    ],
    "name": "96",
    "opType": "MUL",
    "domain": "",
    "attribute": [
     {
      "name": "commutative",
      "refAttrName": "",
      "docString": "",
      "type": "STRING",
      "f": 0,
      "i": "0",
      "s": "",
      "floats": [],
      "ints": [],
      "strings": [],
      "tensors": [],
      "graphs": [],
      "sparseTensors": []
     }
    ],
    "docString": ""
   },
   {
    "input": [
     "89",
     "96"
    ],
    "output": [
     "97"
    ],
    "name": "97",
    "opType": "MUL",
    "domain": "",
    "attribute": [
     {
      "name": "commutative",
      "refAttrName": "",
      "docString": "",
      "type": "STRING",
      "f": 0,
      "i": "0",
      "s": "",
      "floats": [],
      "ints": [],
      "strings": [],
      "tensors": [],
      "graphs": [],
      "sparseTensors": []
     }
    ],
    "docString": ""
   },
   {
    "input": [
     "88",
     "97"
    ],
    "output": [
     "98"
    ],
    "name": "98",
    "opType": "MUL",
    "domain": "",
    "attribute": [
     {
      "name": "commutative",
      "refAttrName": "",
      "docString": "",
      "type": "STRING",
      "f": 0,
      "i": "0",
      "s": "",
      "floats": [],
      "ints": [],
      "strings": [],
      "tensors": [],
      "graphs": [],
      "sparseTensors": []
     }
    ],
    "docString": ""
   },
   {
    "input": [
     "85",
     "98"
    ],
    "output": [
     "99"
    ],
    "name": "99",
    "opType": "MUL",
    "domain": "",
    "attribute": [
     {
      "name": "commutative",
      "refAttrName": "",
      "docString": "",
      "type": "STRING",
      "f": 0,
      "i": "0",
      "s": "",
      "floats": [],
      "ints": [],
      "strings": [],
      "tensors": [],
      "graphs": [],
      "sparseTensors": []
     }
    ],
    "docString": ""
   },
   {
    "input": [
     "32",
     "99"
    ],
    "output": [
     "100"
    ],
    "name": "100",
    "opType": "MUL",
    "domain": "",
    "attribute": [
     {
      "name": "commutative",
      "refAttrName": "",
      "docString": "",
      "type": "STRING",
      "f": 0,
      "i": "0",
      "s": "",
      "floats": [],
      "ints": [],
      "strings": [],
      "tensors": [],
      "graphs": [],
      "sparseTensors": []
     }
    ],
    "docString": ""
   },
   {
    "input": [
     "84",
     "100"
    ],
    "output": [
     "101"
    ],
    "name": "101",
    "opType": "MUL",
    "domain": "",
    "attribute": [
     {
      "name": "commutative",
      "refAttrName": "",
      "docString": "",
      "type": "STRING",
      "f": 0,
      "i": "0",
      "s": "",
      "floats": [],
      "ints": [],
      "strings": [],
      "tensors": [],
      "graphs": [],
      "sparseTensors": []
     }
    ],
    "docString": ""
   },
   {
    "input": [
     "83",
     "101"
    ],
    "output": [
     "102"
    ],
    "name": "102",
    "opType": "MUL",
    "domain": "",
    "attribute": [
     {
      "name": "commutative",
      "refAttrName": "",
      "docString": "",
      "type": "STRING",
      "f": 0,
      "i": "0",
      "s": "",
      "floats": [],
      "ints": [],
      "strings": [],
      "tensors": [],
      "graphs": [],
      "sparseTensors": []
     }
    ],
    "docString": ""
   },
   {
    "input": [
     "102"
    ],
    "output": [
     "103"
    ],
    "name": "103",
    "opType": "EXTEND",
    "domain": "",
    "attribute": [
     {
      "name": "dimensions",
      "refAttrName": "",
      "docString": "",
      "type": "INTS",
      "f": 0,
      "i": "0",
      "s": "",
      "floats": [],
      "ints": [
       "1",
       "1",
       "9"
      ],
      "strings": [],
      "tensors": [],
      "graphs": [],
      "sparseTensors": []
     }
    ],
    "docString": ""
   },
   {
    "input": [
     "82",
     "103"
    ],
    "output": [
     "104"
    ],
    "name": "104",
    "opType": "MUL",
    "domain": "",
    "attribute": [
     {
      "name": "commutative",
      "refAttrName": "",
      "docString": "",
      "type": "STRING",
      "f": 0,
      "i": "0",
      "s": "",
      "floats": [],
      "ints": [],
      "strings": [],
      "tensors": [],
      "graphs": [],
      "sparseTensors": []
     }
    ],
    "docString": ""
   },
   {
    "input": [
     "104"
    ],
    "output": [
     "105"
    ],
    "name": "105",
    "opType": "PERMUTE",
    "domain": "",
    "attribute": [
     {
      "name": "ranks",
      "refAttrName": "",
      "docString": "",
      "type": "INTS",
      "f": 0,
      "i": "0",
      "s": "",
      "floats": [],
      "ints": [
       "2",
       "1",
       "0"
      ],
      "strings": [],
      "tensors": [],
      "graphs": [],
      "sparseTensors": []
     }
    ],
    "docString": ""
   },
   {
    "input": [
     "105"
    ],
    "output": [
     "106"
    ],
    "name": "106",
    "opType": "REDUCE_SUM",
    "domain": "",
    "attribute": [
     {
      "name": "rank_set",
      "refAttrName": "",
      "docString": "",
      "type": "INTS",
      "f": 0,
      "i": "0",
      "s": "",
      "floats": [],
      "ints": [
       "2",
       "3",
       "4",
       "5",
       "6",
       "7"
      ],
      "strings": [],
      "tensors": [],
      "graphs": [],
      "sparseTensors": []
     }
    ],
    "docString": ""
   },
   {
    "input": [
     "80",
     "106"
    ],
    "output": [
     "107"
    ],
    "name": "107",
    "opType": "MUL",
    "domain": "",
    "attribute": [
     {
      "name": "commutative",
      "refAttrName": "",
      "docString": "",
      "type": "STRING",
      "f": 0,
      "i": "0",
      "s": "",
      "floats": [],
      "ints": [],
      "strings": [],
      "tensors": [],
      "graphs": [],
      "sparseTensors": []
     }
    ],
    "docString": ""
   },
   {
    "input": [
     "77",
     "107"
    ],
    "output": [
     "108"
    ],
    "name": "108",
    "opType": "MUL",
    "domain": "",
    "attribute": [
     {
      "name": "commutative",
      "refAttrName": "",
      "docString": "",
      "type": "STRING",
      "f": 0,
      "i": "0",
      "s": "",
      "floats": [],
      "ints": [],
      "strings": [],
      "tensors": [],
      "graphs": [],
      "sparseTensors": []
     }
    ],
    "docString": ""
   },
   {
    "input": [
     "11",
     "108"
    ],
    "output": [
     "109"
    ],
    "name": "109",
    "opType": "MUL",
    "domain": "",
    "attribute": [
     {
      "name": "commutative",
      "refAttrName": "",
      "docString": "",
      "type": "STRING",
      "f": 0,
      "i": "0",
      "s": "",
      "floats": [],
      "ints": [],
      "strings": [],
      "tensors": [],
      "graphs": [],
      "sparseTensors": []
     }
    ],
    "docString": ""
   },
   {
    "input": [
     "76",
     "109"
    ],
    "output": [
     "110"
    ],
    "name": "110",
    "opType": "MUL",
    "domain": "",
    "attribute": [
     {
      "name": "commutative",
      "refAttrName": "",
      "docString": "",
      "type": "STRING",
      "f": 0,
      "i": "0",
      "s": "",
      "floats": [],
      "ints": [],
      "strings": [],
      "tensors": [],
      "graphs": [],
      "sparseTensors": []
     }
    ],
    "docString": ""
   },
   {
    "input": [
     "75",
     "110"
    ],
    "output": [
     "111"
    ],
    "name": "111",
    "opType": "MUL",
    "domain": "",
    "attribute": [
     {
      "name": "commutative",
      "refAttrName": "",
      "docString": "",
      "type": "STRING",
      "f": 0,
      "i": "0",
      "s": "",
      "floats": [],
      "ints": [],
      "strings": [],
      "tensors": [],
      "graphs": [],
      "sparseTensors": []
     }
    ],
    "docString": ""
   },
   {
    "input": [
     "111"
    ],
    "output": [
     "112"
    ],
    "name": "112",
    "opType": "REDUCE_SUM",
    "domain": "",
    "attribute": [
     {
      "name": "rank_set",
      "refAttrName": "",
      "docString": "",
      "type": "INTS",
      "f": 0,
      "i": "0",
      "s": "",
      "floats": [],
      "ints": [
       "1"
      ],
      "strings": [],
      "tensors": [],
      "graphs": [],
      "sparseTensors": []
     }
    ],
    "docString": ""
   },
   {
    "input": [
     "74",
     "112"
    ],
    "output": [
     "db0"
    ],
    "name": "db0",
    "opType": "MUL",
    "domain": "",
    "attribute": [
     {
      "name": "commutative",
      "refAttrName": "",
      "docString": "",
      "type": "STRING",
      "f": 0,
      "i": "0",
      "s": "",
      "floats": [],
      "ints": [],
      "strings": [],
      "tensors": [],
      "graphs": [],
      "sparseTensors": []
     }
    ],
    "docString": ""
   },
   {
    "input": [
     "26"
    ],
    "output": [
     "114"
    ],
    "name": "114",
    "opType": "EXTEND",
    "domain": "",
    "attribute": [
     {
      "name": "dimensions",
      "refAttrName": "",
      "docString": "",
      "type": "INTS",
      "f": 0,
      "i": "0",
      "s": "",
      "floats": [],
      "ints": [
       "1",
       "1",
       "5"
      ],
      "strings": [],
      "tensors": [],
      "graphs": [],
      "sparseTensors": []
     }
    ],
    "docString": ""
   },
   {
    "input": [
     "114"
    ],
    "output": [
     "115"
    ],
    "name": "115",
    "opType": "PERMUTE",
    "domain": "",
    "attribute": [
     {
      "name": "ranks",
      "refAttrName": "",
      "docString": "",
      "type": "INTS",
      "f": 0,
      "i": "0",
      "s": "",
      "floats": [],
      "ints": [
       "2",
       "1",
       "0"
      ],
      "strings": [],
      "tensors": [],
      "graphs": [],
      "sparseTensors": []
     }
    ],
    "docString": ""
   },
   {
    "input": [
     "38"
    ],
    "output": [
     "119"
    ],
    "name": "119",
    "opType": "NEG",
    "domain": "",
    "attribute": [],
    "docString": ""
   },
   {
    "input": [
     "119",
     "37"
    ],
    "output": [
     "120"
    ],
    "name": "120",
    "opType": "DIV",
    "domain": "",
    "attribute": [],
    "docString": ""
   },
   {
    "input": [
     "120",
     "37"
    ],
    "output": [
     "121"
    ],
    "name": "121",
    "opType": "DIV",
    "domain": "",
    "attribute": [],
    "docString": ""
   },
   {
    "input": [
     "123"
    ],
    "output": [
     "124"
    ],
    "name": "124",
    "opType": "EXTEND",
    "domain": "",
    "attribute": [
     {
      "name": "tensor",
      "refAttrName": "",
      "docString": "",
      "type": "TENSOR",
      "f": 0,
      "i": "0",
      "s": "",
      "t": {
       "dims": [],
       "dataType": 0,
       "floatData": [],
       "int32Data": [],
       "stringData": [],
       "int64Data": [],
       "name": "47",
       "docString": "",
       "rawData": "",
       "externalData": [],
       "dataLocation": "DEFAULT",
       "doubleData": [],
       "uint64Data": []
      },
      "floats": [],
      "ints": [],
      "strings": [],
      "tensors": [],
      "graphs": [],
      "sparseTensors": []
     }
    ],
    "docString": ""
   },
   {
    "input": [
     "47",
     "124"
    ],
    "output": [
     "125"
    ],
    "name": "125",
    "opType": "SUB",
    "domain": "",
    "attribute": [],
    "docString": ""
   },
   {
    "input": [
     "46",
     "125"
    ],
    "output": [
     "126"
    ],
    "name": "126",
    "opType": "POW",
    "domain": "",
    "attribute": [],
    "docString": ""
   },
   {
    "input": [
     "47",
     "126"
    ],
    "output": [
     "127"
    ],
    "name": "127",
    "opType": "MUL",
    "domain": "",
    "attribute": [
     {
      "name": "commutative",
      "refAttrName": "",
      "docString": "",
      "type": "STRING",
      "f": 0,
      "i": "0",
      "s": "",
      "floats": [],
      "ints": [],
      "strings": [],
      "tensors": [],
      "graphs": [],
      "sparseTensors": []
     }
    ],
    "docString": ""
   },
   {
    "input": [
     "127",
     "128"
    ],
    "output": [
     "129"
    ],
    "name": "129",
    "opType": "MUL",
    "domain": "",
    "attribute": [
     {
      "name": "commutative",
      "refAttrName": "",
      "docString": "",
      "type": "STRING",
      "f": 0,
      "i": "0",
      "s": "",
      "floats": [],
      "ints": [],
      "strings": [],
      "tensors": [],
      "graphs": [],
      "sparseTensors": []
     }
    ],
    "docString": ""
   },
   {
    "input": [
     "122",
     "129"
    ],
    "output": [
     "130"
    ],
    "name": "130",
    "opType": "MUL",
    "domain": "",
    "attribute": [
     {
      "name": "commutative",
      "refAttrName": "",
      "docString": "",
      "type": "STRING",
      "f": 0,
      "i": "0",
      "s": "",
      "floats": [],
      "ints": [],
      "strings": [],
      "tensors": [],
      "graphs": [],
      "sparseTensors": []
     }
    ],
    "docString": ""
   },
   {
    "input": [
     "121",
     "130"
    ],
    "output": [
     "131"
    ],
    "name": "131",
    "opType": "MUL",
    "domain": "",
    "attribute": [
     {
      "name": "commutative",
      "refAttrName": "",
      "docString": "",
      "type": "STRING",
      "f": 0,
      "i": "0",
      "s": "",
      "floats": [],
      "ints": [],
      "strings": [],
      "tensors": [],
      "graphs": [],
      "sparseTensors": []
     }
    ],
    "docString": ""
   },
   {
    "input": [
     "118",
     "131"
    ],
    "output": [
     "132"
    ],
    "name": "132",
    "opType": "MUL",
    "domain": "",
    "attribute": [
     {
      "name": "commutative",
      "refAttrName": "",
      "docString": "",
      "type": "STRING",
      "f": 0,
      "i": "0",
      "s": "",
      "floats": [],
      "ints": [],
      "strings": [],
      "tensors": [],
      "graphs": [],
      "sparseTensors": []
     }
    ],
    "docString": ""
   },
   {
    "input": [
     "32",
     "132"
    ],
    "output": [
     "133"
    ],
    "name": "133",
    "opType": "MUL",
    "domain": "",
    "attribute": [
     {
      "name": "commutative",
      "refAttrName": "",
      "docString": "",
      "type": "STRING",
      "f": 0,
      "i": "0",
      "s": "",
      "floats": [],
      "ints": [],
      "strings": [],
      "tensors": [],
      "graphs": [],
      "sparseTensors": []
     }
    ],
    "docString": ""
   },
   {
    "input": [
     "117",
     "133"
    ],
    "output": [
     "134"
    ],
    "name": "134",
    "opType": "MUL",
    "domain": "",
    "attribute": [
     {
      "name": "commutative",
      "refAttrName": "",
      "docString": "",
      "type": "STRING",
      "f": 0,
      "i": "0",
      "s": "",
      "floats": [],
      "ints": [],
      "strings": [],
      "tensors": [],
      "graphs": [],
      "sparseTensors": []
     }
    ],
    "docString": ""
   },
   {
    "input": [
     "116",
     "134"
    ],
    "output": [
     "135"
    ],
    "name": "135",
    "opType": "MUL",
    "domain": "",
    "attribute": [
     {
      "name": "commutative",
      "refAttrName": "",
      "docString": "",
      "type": "STRING",
      "f": 0,
      "i": "0",
      "s": "",
      "floats": [],
      "ints": [],
      "strings": [],
      "tensors": [],
      "graphs": [],
      "sparseTensors": []
     }
    ],
    "docString": ""
   },
   {
    "input": [
     "135"
    ],
    "output": [
     "136"
    ],
    "name": "136",
    "opType": "EXTEND",
    "domain": "",
    "attribute": [
     {
      "name": "dimensions",
      "refAttrName": "",
      "docString": "",
      "type": "INTS",
      "f": 0,
      "i": "0",
      "s": "",
      "floats": [],
      "ints": [
       "1",
       "1",
       "9"
      ],
      "strings": [],
      "tensors": [],
      "graphs": [],
      "sparseTensors": []
     }
    ],
    "docString": ""
   },
   {
    "input": [
     "115",
     "136"
    ],
    "output": [
     "137"
    ],
    "name": "137",
    "opType": "MUL",
    "domain": "",
    "attribute": [
     {
      "name": "commutative",
      "refAttrName": "",
      "docString": "",
      "type": "STRING",
      "f": 0,
      "i": "0",
      "s": "",
      "floats": [],
      "ints": [],
      "strings": [],
      "tensors": [],
      "graphs": [],
      "sparseTensors": []
     }
    ],
    "docString": ""
   },
   {
    "input": [
     "137"
    ],
    "output": [
     "138"
    ],
    "name": "138",
    "opType": "PERMUTE",
    "domain": "",
    "attribute": [
     {
      "name": "ranks",
      "refAttrName": "",
      "docString": "",
      "type": "INTS",
      "f": 0,
      "i": "0",
      "s": "",
      "floats": [],
      "ints": [
       "0",
       "2",
       "1"
      ],
      "strings": [],
      "tensors": [],
      "graphs": [],
      "sparseTensors": []
     }
    ],
    "docString": ""
   },
   {
    "input": [
     "138"
    ],
    "output": [
     "dw1"
    ],
    "name": "dw1",
    "opType": "REDUCE_SUM",
    "domain": "",
    "attribute": [
     {
      "name": "rank_set",
      "refAttrName": "",
      "docString": "",
      "type": "INTS",
      "f": 0,
      "i": "0",
      "s": "",
      "floats": [],
      "ints": [
       "2",
       "3",
       "4",
       "5",
       "6",
       "7"
      ],
      "strings": [],
      "tensors": [],
      "graphs": [],
      "sparseTensors": []
     }
    ],
    "docString": ""
   },
   {
    "input": [
     "38"
    ],
    "output": [
     "144"
    ],
    "name": "144",
    "opType": "NEG",
    "domain": "",
    "attribute": [],
    "docString": ""
   },
   {
    "input": [
     "144",
     "37"
    ],
    "output": [
     "145"
    ],
    "name": "145",
    "opType": "DIV",
    "domain": "",
    "attribute": [],
    "docString": ""
   },
   {
    "input": [
     "145",
     "37"
    ],
    "output": [
     "146"
    ],
    "name": "146",
    "opType": "DIV",
    "domain": "",
    "attribute": [],
    "docString": ""
   },
   {
    "input": [
     "148"
    ],
    "output": [
     "149"
    ],
    "name": "149",
    "opType": "EXTEND",
    "domain": "",
    "attribute": [
     {
      "name": "tensor",
      "refAttrName": "",
      "docString": "",
      "type": "TENSOR",
      "f": 0,
      "i": "0",
      "s": "",
      "t": {
       "dims": [],
       "dataType": 0,
       "floatData": [],
       "int32Data": [],
       "stringData": [],
       "int64Data": [],
       "name": "47",
       "docString": "",
       "rawData": "",
       "externalData": [],
       "dataLocation": "DEFAULT",
       "doubleData": [],
       "uint64Data": []
      },
      "floats": [],
      "ints": [],
      "strings": [],
      "tensors": [],
      "graphs": [],
      "sparseTensors": []
     }
    ],
    "docString": ""
   },
   {
    "input": [
     "47",
     "149"
    ],
    "output": [
     "150"
    ],
    "name": "150",
    "opType": "SUB",
    "domain": "",
    "attribute": [],
    "docString": ""
   },
   {
    "input": [
     "46",
     "150"
    ],
    "output": [
     "151"
    ],
    "name": "151",
    "opType": "POW",
    "domain": "",
    "attribute": [],
    "docString": ""
   },
   {
    "input": [
     "47",
     "151"
    ],
    "output": [
     "152"
    ],
    "name": "152",
    "opType": "MUL",
    "domain": "",
    "attribute": [
     {
      "name": "commutative",
      "refAttrName": "",
      "docString": "",
      "type": "STRING",
      "f": 0,
      "i": "0",
      "s": "",
      "floats": [],
      "ints": [],
      "strings": [],
      "tensors": [],
      "graphs": [],
      "sparseTensors": []
     }
    ],
    "docString": ""
   },
   {
    "input": [
     "152",
     "153"
    ],
    "output": [
     "154"
    ],
    "name": "154",
    "opType": "MUL",
    "domain": "",
    "attribute": [
     {
      "name": "commutative",
      "refAttrName": "",
      "docString": "",
      "type": "STRING",
      "f": 0,
      "i": "0",
      "s": "",
      "floats": [],
      "ints": [],
      "strings": [],
      "tensors": [],
      "graphs": [],
      "sparseTensors": []
     }
    ],
    "docString": ""
   },
   {
    "input": [
     "147",
     "154"
    ],
    "output": [
     "155"
    ],
    "name": "155",
    "opType": "MUL",
    "domain": "",
    "attribute": [
     {
      "name": "commutative",
      "refAttrName": "",
      "docString": "",
      "type": "STRING",
      "f": 0,
      "i": "0",
      "s": "",
      "floats": [],
      "ints": [],
      "strings": [],
      "tensors": [],
      "graphs": [],
      "sparseTensors": []
     }
    ],
    "docString": ""
   },
   {
    "input": [
     "146",
     "155"
    ],
    "output": [
     "156"
    ],
    "name": "156",
    "opType": "MUL",
    "domain": "",
    "attribute": [
     {
      "name": "commutative",
      "refAttrName": "",
      "docString": "",
      "type": "STRING",
      "f": 0,
      "i": "0",
      "s": "",
      "floats": [],
      "ints": [],
      "strings": [],
      "tensors": [],
      "graphs": [],
      "sparseTensors": []
     }
    ],
    "docString": ""
   },
   {
    "input": [
     "143",
     "156"
    ],
    "output": [
     "157"
    ],
    "name": "157",
    "opType": "MUL",
    "domain": "",
    "attribute": [
     {
      "name": "commutative",
      "refAttrName": "",
      "docString": "",
      "type": "STRING",
      "f": 0,
      "i": "0",
      "s": "",
      "floats": [],
      "ints": [],
      "strings": [],
      "tensors": [],
      "graphs": [],
      "sparseTensors": []
     }
    ],
    "docString": ""
   },
   {
    "input": [
     "32",
     "157"
    ],
    "output": [
     "158"
    ],
    "name": "158",
    "opType": "MUL",
    "domain": "",
    "attribute": [
     {
      "name": "commutative",
      "refAttrName": "",
      "docString": "",
      "type": "STRING",
      "f": 0,
      "i": "0",
      "s": "",
      "floats": [],
      "ints": [],
      "strings": [],
      "tensors": [],
      "graphs": [],
      "sparseTensors": []
     }
    ],
    "docString": ""
   },
   {
    "input": [
     "142",
     "158"
    ],
    "output": [
     "159"
    ],
    "name": "159",
    "opType": "MUL",
    "domain": "",
    "attribute": [
     {
      "name": "commutative",
      "refAttrName": "",
      "docString": "",
      "type": "STRING",
      "f": 0,
      "i": "0",
      "s": "",
      "floats": [],
      "ints": [],
      "strings": [],
      "tensors": [],
      "graphs": [],
