{
 "irVersion": "6",
 "opsetImport": [],
 "producerName": "tenncor",
 "producerVersion": "1.0.0",
 "domain": "com.mingkaic.tenncor",
 "modelVersion": "6",
 "docString": "",
 "graph": {
  "node": [
   {
    "input": [
     "1",
     "2"
    ],
    "output": [
     "3"
    ],
    "name": "3",
    "opType": "MATMUL",
    "domain": "",
    "attribute": [
     {
      "name": "rank_pairs",
      "refAttrName": "",
      "docString": "",
      "type": "INTS",
      "f": 0,
      "i": "0",
      "s": "",
      "floats": [],
      "ints": [
       "0",
       "1"
      ],
      "strings": [],
      "tensors": [],
      "graphs": [],
      "sparseTensors": []
     }
    ],
    "docString": ""
   },
   {
    "input": [
     "4"
    ],
    "output": [
     "5"
    ],
    "name": "5",
    "opType": "EXTEND",
    "domain": "",
    "attribute": [
     {
      "name": "dimensions",
      "refAttrName": "",
      "docString": "",
      "type": "INTS",
      "f": 0,
      "i": "0",
      "s": "",
      "floats": [],
      "ints": [
       "1",
       "3"
      ],
      "strings": [],
      "tensors": [],
      "graphs": [],
      "sparseTensors": []
     }
    ],
    "docString": ""
   },
   {
    "input": [
     "3",
     "5"
    ],
    "output": [
     "6"
    ],
    "name": "6",
    "opType": "ADD",
    "domain": "",
    "attribute": [],
    "docString": ""
   },
   {
    "input": [
     "6"
    ],
    "output": [
     "7"
    ],
    "name": "7",
    "opType": "NEG",
    "domain": "",
    "attribute": [],
    "docString": ""
   },
   {
    "input": [
     "7"
    ],
    "output": [
     "8"
    ],
    "name": "8",
    "opType": "EXP",
    "domain": "",
    "attribute": [],
    "docString": ""
   },
   {
    "input": [
     "10"
    ],
    "output": [
     "11"
    ],
    "name": "11",
    "opType": "EXTEND",
    "domain": "",
    "attribute": [
     {
      "name": "tensor",
      "refAttrName": "",
      "docString": "",
      "type": "TENSOR",
      "f": 0,
      "i": "0",
      "s": "",
      "t": {
       "dims": [],
       "dataType": 0,
       "floatData": [],
       "int32Data": [],
       "stringData": [],
       "int64Data": [],
       "name": "8",
       "docString": "",
       "rawData": "",
       "externalData": [],
       "dataLocation": "DEFAULT",
       "doubleData": [],
       "uint64Data": []
      },
      "floats": [],
      "ints": [],
      "strings": [],
      "tensors": [],
      "graphs": [],
      "sparseTensors": []
     }
    ],
    "docString": ""
   },
   {
    "input": [
     "11",
     "8"
    ],
    "output": [
     "12"
    ],
    "name": "12",
    "opType": "ADD",
    "domain": "",
    "attribute": [],
    "docString": ""
   },
   {
    "input": [
     "9"
    ],
    "output": [
     "13"
    ],
    "name": "13",
    "opType": "EXTEND",
    "domain": "",
    "attribute": [
     {
      "name": "tensor",
      "refAttrName": "",
      "docString": "",
      "type": "TENSOR",
      "f": 0,
      "i": "0",
      "s": "",
      "t": {
       "dims": [],
       "dataType": 0,
       "floatData": [],
       "int32Data": [],
       "stringData": [],
       "int64Data": [],
       "name": "12",
       "docString": "",
       "rawData": "",
       "externalData": [],
       "dataLocation": "DEFAULT",
       "doubleData": [],
       "uint64Data": []
      },
      "floats": [],
      "ints": [],
      "strings": [],
      "tensors": [],
      "graphs": [],
      "sparseTensors": []
     }
    ],
    "docString": ""
   },
   {
    "input": [
     "13",
     "12"
    ],
    "output": [
     "14"
    ],
    "name": "14",
    "opType": "DIV",
    "domain": "",
    "attribute": [],
    "docString": ""
   },
   {
    "input": [
     "14",
     "15"
    ],
    "output": [
     "16"
    ],
    "name": "16",
    "opType": "MATMUL",
    "domain": "",
    "attribute": [
     {
      "name": "rank_pairs",
      "refAttrName": "",
      "docString": "",
      "type": "INTS",
      "f": 0,
      "i": "0",
      "s": "",
      "floats": [],
      "ints": [
       "0",
       "1"
      ],
      "strings": [],
      "tensors": [],
      "graphs": [],
      "sparseTensors": []
     }
    ],
    "docString": ""
   },
   {
    "input": [
     "17"
    ],
    "output": [
     "18"
    ],
    "name": "18",
    "opType": "EXTEND",
    "domain": "",
    "attribute": [
     {
      "name": "dimensions",
      "refAttrName": "",
      "docString": "",
      "type": "INTS",
      "f": 0,
      "i": "0",
      "s": "",
      "floats": [],
      "ints": [
       "1",
       "3"
      ],
      "strings": [],
      "tensors": [],
      "graphs": [],
      "sparseTensors": []
     }
    ],
    "docString": ""
   },
   {
    "input": [
     "16",
     "18"
    ],
    "output": [
     "19"
    ],
    "name": "19",
    "opType": "ADD",
    "domain": "",
    "attribute": [],
    "docString": ""
   },
   {
    "input": [
     "19"
    ],
    "output": [
     "20"
    ],
    "name": "20",
    "opType": "NEG",
    "domain": "",
    "attribute": [],
    "docString": ""
   },
   {
    "input": [
     "20"
    ],
    "output": [
     "21"
    ],
    "name": "21",
    "opType": "EXP",
    "domain": "",
    "attribute": [],
    "docString": ""
   },
   {
    "input": [
     "25"
    ],
    "output": [
     "26"
    ],
    "name": "26",
    "opType": "EXTEND",
    "domain": "",
    "attribute": [
     {
      "name": "tensor",
      "refAttrName": "",
      "docString": "",
      "type": "TENSOR",
      "f": 0,
      "i": "0",
      "s": "",
      "t": {
       "dims": [],
       "dataType": 0,
       "floatData": [],
       "int32Data": [],
       "stringData": [],
       "int64Data": [],
       "name": "21",
       "docString": "",
       "rawData": "",
       "externalData": [],
       "dataLocation": "DEFAULT",
       "doubleData": [],
       "uint64Data": []
      },
      "floats": [],
      "ints": [],
      "strings": [],
      "tensors": [],
      "graphs": [],
      "sparseTensors": []
     }
    ],
    "docString": ""
   },
   {
    "input": [
     "26",
     "21"
    ],
    "output": [
     "27"
    ],
    "name": "27",
    "opType": "ADD",
    "domain": "",
    "attribute": [],
    "docString": ""
   },
   {
    "input": [
     "24"
    ],
    "output": [
     "28"
    ],
    "name": "28",
    "opType": "EXTEND",
    "domain": "",
    "attribute": [
     {
      "name": "tensor",
      "refAttrName": "",
      "docString": "",
      "type": "TENSOR",
      "f": 0,
      "i": "0",
      "s": "",
      "t": {
       "dims": [],
       "dataType": 0,
       "floatData": [],
       "int32Data": [],
       "stringData": [],
       "int64Data": [],
       "name": "27",
       "docString": "",
       "rawData": "",
       "externalData": [],
       "dataLocation": "DEFAULT",
       "doubleData": [],
       "uint64Data": []
      },
      "floats": [],
      "ints": [],
      "strings": [],
      "tensors": [],
      "graphs": [],
      "sparseTensors": []
     }
    ],
    "docString": ""
   },
   {
    "input": [
     "28",
     "27"
    ],
    "output": [
     "29"
    ],
    "name": "29",
    "opType": "DIV",
    "domain": "",
    "attribute": [],
    "docString": ""
   },
   {
    "input": [
     "23",
     "29"
    ],
    "output": [
     "30"
    ],
    "name": "30",
    "opType": "SUB",
    "domain": "",
    "attribute": [],
    "docString": ""
   },
   {
    "input": [
     "22"
    ],
    "output": [
     "31"
    ],
    "name": "31",
    "opType": "EXTEND",
    "domain": "",
    "attribute": [
     {
      "name": "tensor",
      "refAttrName": "",
      "docString": "",
      "type": "TENSOR",
      "f": 0,
      "i": "0",
      "s": "",
      "t": {
       "dims": [],
       "dataType": 0,
       "floatData": [],
       "int32Data": [],
       "stringData": [],
       "int64Data": [],
       "name": "30",
       "docString": "",
       "rawData": "",
       "externalData": [],
       "dataLocation": "DEFAULT",
       "doubleData": [],
       "uint64Data": []
      },
      "floats": [],
      "ints": [],
      "strings": [],
      "tensors": [],
      "graphs": [],
      "sparseTensors": []
     }
    ],
    "docString": ""
   },
   {
    "input": [
     "32"
    ],
    "output": [
     "33"
    ],
    "name": "33",
    "opType": "EXTEND",
    "domain": "",
    "attribute": [
     {
      "name": "tensor",
      "refAttrName": "",
      "docString": "",
      "type": "TENSOR",
      "f": 0,
      "i": "0",
      "s": "",
      "t": {
       "dims": [],
       "dataType": 0,
       "floatData": [],
       "int32Data": [],
       "stringData": [],
       "int64Data": [],
       "name": "31",
       "docString": "",
       "rawData": "",
       "externalData": [],
       "dataLocation": "DEFAULT",
       "doubleData": [],
       "uint64Data": []
      },
      "floats": [],
      "ints": [],
      "strings": [],
      "tensors": [],
      "graphs": [],
      "sparseTensors": []
     }
    ],
    "docString": ""
   },
   {
    "input": [
     "31",
     "33"
    ],
    "output": [
     "34"
    ],
    "name": "34",
    "opType": "SUB",
    "domain": "",
    "attribute": [],
    "docString": ""
   },
   {
    "input": [
     "30",
     "34"
    ],
    "output": [
     "35"
    ],
    "name": "35",
    "opType": "POW",
    "domain": "",
    "attribute": [],
    "docString": ""
   },
   {
    "input": [
     "31",
     "35"
    ],
    "output": [
     "36"
    ],
    "name": "36",
    "opType": "MUL",
    "domain": "",
    "attribute": [],
    "docString": ""
   },
   {
    "input": [
     "37"
    ],
    "output": [
     "38"
    ],
    "name": "38",
    "opType": "CAST",
    "domain": "",
    "attribute": [
     {
      "name": "dtype",
      "refAttrName": "",
      "docString": "",
      "type": "STRING",
      "f": 0,
      "i": "0",
      "s": "RE9VQkxF",
      "floats": [],
      "ints": [],
      "strings": [],
      "tensors": [],
      "graphs": [],
      "sparseTensors": []
     }
    ],
    "docString": ""
   },
   {
    "input": [
     "36",
     "38"
    ],
    "output": [
     "39"
    ],
    "name": "39",
    "opType": "MUL",
    "domain": "",
    "attribute": [],
    "docString": ""
   },
   {
    "input": [
     "39"
    ],
    "output": [
     "40"
    ],
    "name": "40",
    "opType": "NEG",
    "domain": "",
    "attribute": [],
    "docString": ""
   },
   {
    "input": [
     "40"
    ],
    "output": [
     "41"
    ],
    "name": "41",
    "opType": "NEG",
    "domain": "",
    "attribute": [],
    "docString": ""
   },
   {
    "input": [
     "41",
     "28"
    ],
    "output": [
     "42"
    ],
    "name": "42",
    "opType": "MUL",
    "domain": "",
    "attribute": [],
    "docString": ""
   },
   {
    "input": [
     "42",
     "27"
    ],
    "output": [
     "43"
    ],
    "name": "43",
    "opType": "DIV",
    "domain": "",
    "attribute": [],
    "docString": ""
   },
   {
    "input": [
     "43",
     "27"
    ],
    "output": [
     "44"
    ],
    "name": "44",
    "opType": "DIV",
    "domain": "",
    "attribute": [],
    "docString": ""
   },
   {
    "input": [
     "21",
     "44"
    ],
    "output": [
     "45"
    ],
    "name": "45",
    "opType": "MUL",
    "domain": "",
    "attribute": [],
    "docString": ""
   },
   {
    "input": [
     "45"
    ],
    "output": [
     "46"
    ],
    "name": "46",
    "opType": "NEG",
    "domain": "",
    "attribute": [],
    "docString": ""
   },
   {
    "input": [
     "46",
     "15"
    ],
    "output": [
     "47"
    ],
    "name": "47",
    "opType": "MATMUL",
    "domain": "",
    "attribute": [
     {
      "name": "rank_pairs",
      "refAttrName": "",
      "docString": "",
      "type": "INTS",
      "f": 0,
      "i": "0",
      "s": "",
      "floats": [],
      "ints": [
       "0",
       "0"
      ],
      "strings": [],
      "tensors": [],
      "graphs": [],
      "sparseTensors": []
     }
    ],
    "docString": ""
   },
   {
    "input": [
     "47"
    ],
    "output": [
     "48"
    ],
    "name": "48",
    "opType": "NEG",
    "domain": "",
    "attribute": [],
    "docString": ""
   },
   {
    "input": [
     "48",
     "13"
    ],
    "output": [
     "49"
    ],
    "name": "49",
    "opType": "MUL",
    "domain": "",
    "attribute": [],
    "docString": ""
   },
   {
    "input": [
     "49",
     "12"
    ],
    "output": [
     "50"
    ],
    "name": "50",
    "opType": "DIV",
    "domain": "",
    "attribute": [],
    "docString": ""
   },
   {
    "input": [
     "50",
     "12"
    ],
    "output": [
     "51"
    ],
    "name": "51",
    "opType": "DIV",
    "domain": "",
    "attribute": [],
    "docString": ""
   },
   {
    "input": [
     "8",
     "51"
    ],
    "output": [
     "52"
    ],
    "name": "52",
    "opType": "MUL",
    "domain": "",
    "attribute": [],
    "docString": ""
   },
   {
    "input": [
     "52"
    ],
    "output": [
     "53"
    ],
    "name": "53",
    "opType": "NEG",
    "domain": "",
    "attribute": [],
    "docString": ""
   },
   {
    "input": [
     "53",
     "1"
    ],
    "output": [
     "54"
    ],
    "name": "54",
    "opType": "MATMUL",
    "domain": "",
    "attribute": [
     {
      "name": "rank_pairs",
      "refAttrName": "",
      "docString": "",
      "type": "INTS",
      "f": 0,
      "i": "0",
      "s": "",
      "floats": [],
      "ints": [
       "1",
       "1"
      ],
      "strings": [],
      "tensors": [],
      "graphs": [],
      "sparseTensors": []
     }
    ],
    "docString": ""
   },
   {
    "input": [
     "54"
    ],
    "output": [
     "1032"
    ],
    "name": "1032",
    "opType": "PERMUTE",
    "domain": "",
    "attribute": [
     {
      "name": "ranks",
      "refAttrName": "",
      "docString": "",
      "type": "INTS",
      "f": 0,
      "i": "0",
      "s": "",
      "floats": [],
      "ints": [
       "1",
       "0",
       "2",
       "3",
       "4",
       "5",
       "6",
       "7"
      ],
      "strings": [],
      "tensors": [],
      "graphs": [],
      "sparseTensors": []
     }
    ],
    "docString": ""
   },
   {
    "input": [
     "55"
    ],
    "output": [
     "56"
    ],
    "name": "56",
    "opType": "EXTEND",
    "domain": "",
    "attribute": [
     {
      "name": "tensor",
      "refAttrName": "",
      "docString": "",
      "type": "TENSOR",
      "f": 0,
      "i": "0",
      "s": "",
      "t": {
       "dims": [],
       "dataType": 0,
       "floatData": [],
       "int32Data": [],
       "stringData": [],
       "int64Data": [],
       "name": "31",
       "docString": "",
       "rawData": "",
       "externalData": [],
       "dataLocation": "DEFAULT",
       "doubleData": [],
       "uint64Data": []
      },
      "floats": [],
      "ints": [],
      "strings": [],
      "tensors": [],
      "graphs": [],
      "sparseTensors": []
     }
    ],
    "docString": ""
   },
   {
    "input": [
     "31",
     "56"
    ],
    "output": [
     "57"
    ],
    "name": "57",
    "opType": "SUB",
    "domain": "",
    "attribute": [],
    "docString": ""
   },
   {
    "input": [
     "30",
     "57"
    ],
    "output": [
     "58"
    ],
    "name": "58",
    "opType": "POW",
    "domain": "",
    "attribute": [],
    "docString": ""
   },
   {
    "input": [
     "31",
     "58"
    ],
    "output": [
     "59"
    ],
    "name": "59",
    "opType": "MUL",
    "domain": "",
    "attribute": [],
    "docString": ""
   },
   {
    "input": [
     "60"
    ],
    "output": [
     "61"
    ],
    "name": "61",
    "opType": "CAST",
    "domain": "",
    "attribute": [
     {
      "name": "dtype",
      "refAttrName": "",
      "docString": "",
      "type": "STRING",
      "f": 0,
      "i": "0",
      "s": "RE9VQkxF",
      "floats": [],
      "ints": [],
      "strings": [],
      "tensors": [],
      "graphs": [],
      "sparseTensors": []
     }
    ],
    "docString": ""
   },
   {
    "input": [
     "59",
     "61"
    ],
    "output": [
     "62"
    ],
    "name": "62",
    "opType": "MUL",
    "domain": "",
    "attribute": [],
    "docString": ""
   },
   {
    "input": [
     "62"
    ],
    "output": [
     "63"
    ],
    "name": "63",
    "opType": "NEG",
    "domain": "",
    "attribute": [],
    "docString": ""
   },
   {
    "input": [
     "63"
    ],
    "output": [
     "64"
    ],
    "name": "64",
    "opType": "NEG",
    "domain": "",
    "attribute": [],
    "docString": ""
   },
   {
    "input": [
     "64",
     "28"
    ],
    "output": [
     "65"
    ],
    "name": "65",
    "opType": "MUL",
    "domain": "",
    "attribute": [],
    "docString": ""
   },
   {
    "input": [
     "65",
     "27"
    ],
    "output": [
     "66"
    ],
    "name": "66",
    "opType": "DIV",
    "domain": "",
    "attribute": [],
    "docString": ""
   },
   {
    "input": [
     "66",
     "27"
    ],
    "output": [
     "67"
    ],
    "name": "67",
    "opType": "DIV",
    "domain": "",
    "attribute": [],
    "docString": ""
   },
   {
    "input": [
     "21",
     "67"
    ],
    "output": [
     "68"
    ],
    "name": "68",
    "opType": "MUL",
    "domain": "",
    "attribute": [],
    "docString": ""
   },
   {
    "input": [
     "68"
    ],
    "output": [
     "69"
    ],
    "name": "69",
    "opType": "NEG",
    "domain": "",
    "attribute": [],
    "docString": ""
   },
   {
    "input": [
     "69",
     "15"
    ],
    "output": [
     "70"
    ],
    "name": "70",
    "opType": "MATMUL",
    "domain": "",
    "attribute": [
     {
      "name": "rank_pairs",
      "refAttrName": "",
      "docString": "",
      "type": "INTS",
      "f": 0,
      "i": "0",
      "s": "",
      "floats": [],
      "ints": [
       "0",
       "0"
      ],
      "strings": [],
      "tensors": [],
      "graphs": [],
      "sparseTensors": []
     }
    ],
    "docString": ""
   },
   {
    "input": [
     "70"
    ],
    "output": [
     "71"
    ],
    "name": "71",
    "opType": "NEG",
    "domain": "",
    "attribute": [],
    "docString": ""
   },
   {
    "input": [
     "71",
     "13"
    ],
    "output": [
     "72"
    ],
    "name": "72",
    "opType": "MUL",
    "domain": "",
    "attribute": [],
    "docString": ""
   },
   {
    "input": [
     "72",
     "12"
    ],
    "output": [
     "73"
    ],
    "name": "73",
    "opType": "DIV",
    "domain": "",
    "attribute": [],
    "docString": ""
   },
   {
    "input": [
     "73",
     "12"
    ],
    "output": [
     "74"
    ],
    "name": "74",
    "opType": "DIV",
    "domain": "",
    "attribute": [],
    "docString": ""
   },
   {
    "input": [
     "8",
     "74"
    ],
    "output": [
     "75"
    ],
    "name": "75",
    "opType": "MUL",
    "domain": "",
    "attribute": [],
    "docString": ""
   },
   {
    "input": [
     "75"
    ],
    "output": [
     "76"
    ],
    "name": "76",
    "opType": "NEG",
    "domain": "",
    "attribute": [],
    "docString": ""
   },
   {
    "input": [
     "76"
    ],
    "output": [
     "1033"
    ],
    "name": "1033",
    "opType": "REDUCE_SUM",
    "domain": "",
    "attribute": [
     {
      "name": "rank_set",
      "refAttrName": "",
      "docString": "",
      "type": "INTS",
      "f": 0,
      "i": "0",
      "s": "",
      "floats": [],
      "ints": [
       "1"
      ],
      "strings": [],
      "tensors": [],
      "graphs": [],
      "sparseTensors": []
     }
    ],
    "docString": ""
   },
   {
    "input": [
     "77"
    ],
    "output": [
     "78"
    ],
    "name": "78",
    "opType": "EXTEND",
    "domain": "",
    "attribute": [
     {
      "name": "tensor",
      "refAttrName": "",
      "docString": "",
      "type": "TENSOR",
      "f": 0,
      "i": "0",
      "s": "",
      "t": {
       "dims": [],
       "dataType": 0,
       "floatData": [],
       "int32Data": [],
       "stringData": [],
       "int64Data": [],
       "name": "31",
       "docString": "",
       "rawData": "",
       "externalData": [],
       "dataLocation": "DEFAULT",
       "doubleData": [],
       "uint64Data": []
      },
      "floats": [],
      "ints": [],
      "strings": [],
      "tensors": [],
      "graphs": [],
      "sparseTensors": []
     }
    ],
    "docString": ""
   },
   {
    "input": [
     "31",
     "78"
    ],
    "output": [
     "79"
    ],
    "name": "79",
    "opType": "SUB",
    "domain": "",
    "attribute": [],
    "docString": ""
   },
   {
    "input": [
     "30",
     "79"
    ],
    "output": [
     "80"
    ],
    "name": "80",
    "opType": "POW",
    "domain": "",
    "attribute": [],
    "docString": ""
   },
   {
    "input": [
     "31",
     "80"
    ],
    "output": [
     "81"
    ],
    "name": "81",
    "opType": "MUL",
    "domain": "",
    "attribute": [],
    "docString": ""
   },
   {
    "input": [
     "82"
    ],
    "output": [
     "83"
    ],
    "name": "83",
    "opType": "CAST",
    "domain": "",
    "attribute": [
     {
      "name": "dtype",
      "refAttrName": "",
      "docString": "",
      "type": "STRING",
      "f": 0,
      "i": "0",
      "s": "RE9VQkxF",
      "floats": [],
      "ints": [],
      "strings": [],
      "tensors": [],
      "graphs": [],
      "sparseTensors": []
     }
    ],
    "docString": ""
   },
   {
    "input": [
     "81",
     "83"
    ],
    "output": [
     "84"
    ],
    "name": "84",
    "opType": "MUL",
    "domain": "",
    "attribute": [],
    "docString": ""
   },
   {
    "input": [
     "84"
    ],
    "output": [
     "85"
    ],
    "name": "85",
    "opType": "NEG",
    "domain": "",
    "attribute": [],
    "docString": ""
   },
   {
    "input": [
     "85"
    ],
    "output": [
     "86"
    ],
    "name": "86",
    "opType": "NEG",
    "domain": "",
    "attribute": [],
    "docString": ""
   },
   {
    "input": [
     "86",
     "28"
    ],
    "output": [
     "87"
    ],
    "name": "87",
    "opType": "MUL",
    "domain": "",
    "attribute": [],
    "docString": ""
   },
   {
    "input": [
     "87",
     "27"
    ],
    "output": [
     "88"
    ],
    "name": "88",
    "opType": "DIV",
    "domain": "",
    "attribute": [],
    "docString": ""
   },
   {
    "input": [
     "88",
     "27"
    ],
    "output": [
     "89"
    ],
    "name": "89",
    "opType": "DIV",
    "domain": "",
    "attribute": [],
    "docString": ""
   },
   {
    "input": [
     "21",
     "89"
    ],
    "output": [
     "90"
    ],
    "name": "90",
    "opType": "MUL",
    "domain": "",
    "attribute": [],
    "docString": ""
   },
   {
    "input": [
     "90"
    ],
    "output": [
     "91"
    ],
    "name": "91",
    "opType": "NEG",
    "domain": "",
    "attribute": [],
    "docString": ""
   },
   {
    "input": [
     "91",
     "14"
    ],
    "output": [
     "92"
    ],
    "name": "92",
    "opType": "MATMUL",
    "domain": "",
    "attribute": [
     {
      "name": "rank_pairs",
      "refAttrName": "",
      "docString": "",
      "type": "INTS",
      "f": 0,
      "i": "0",
      "s": "",
      "floats": [],
      "ints": [
       "1",
       "1"
      ],
      "strings": [],
      "tensors": [],
      "graphs": [],
      "sparseTensors": []
     }
    ],
    "docString": ""
   },
   {
    "input": [
     "92"
    ],
    "output": [
     "1034"
    ],
    "name": "1034",
    "opType": "PERMUTE",
    "domain": "",
    "attribute": [
     {
      "name": "ranks",
      "refAttrName": "",
      "docString": "",
      "type": "INTS",
      "f": 0,
      "i": "0",
      "s": "",
      "floats": [],
      "ints": [
       "1",
       "0",
       "2",
       "3",
       "4",
       "5",
       "6",
       "7"
      ],
      "strings": [],
      "tensors": [],
      "graphs": [],
      "sparseTensors": []
     }
    ],
    "docString": ""
   },
   {
    "input": [
     "93"
    ],
    "output": [
     "94"
    ],
    "name": "94",
    "opType": "EXTEND",
    "domain": "",
    "attribute": [
     {
      "name": "tensor",
      "refAttrName": "",
      "docString": "",
      "type": "TENSOR",
      "f": 0,
      "i": "0",
      "s": "",
      "t": {
       "dims": [],
       "dataType": 0,
       "floatData": [],
       "int32Data": [],
       "stringData": [],
       "int64Data": [],
       "name": "31",
       "docString": "",
       "rawData": "",
       "externalData": [],
       "dataLocation": "DEFAULT",
       "doubleData": [],
       "uint64Data": []
      },
      "floats": [],
      "ints": [],
      "strings": [],
      "tensors": [],
      "graphs": [],
      "sparseTensors": []
     }
    ],
    "docString": ""
   },
   {
    "input": [
     "31",
     "94"
    ],
    "output": [
     "95"
    ],
    "name": "95",
    "opType": "SUB",
    "domain": "",
    "attribute": [],
    "docString": ""
   },
   {
    "input": [
     "30",
     "95"
    ],
    "output": [
     "96"
    ],
    "name": "96",
    "opType": "POW",
    "domain": "",
    "attribute": [],
    "docString": ""
   },
   {
    "input": [
     "31",
     "96"
    ],
    "output": [
     "97"
    ],
    "name": "97",
    "opType": "MUL",
    "domain": "",
    "attribute": [],
    "docString": ""
   },
   {
    "input": [
     "98"
    ],
    "output": [
     "99"
    ],
    "name": "99",
    "opType": "CAST",
    "domain": "",
    "attribute": [
     {
      "name": "dtype",
      "refAttrName": "",
      "docString": "",
      "type": "STRING",
      "f": 0,
      "i": "0",
      "s": "RE9VQkxF",
      "floats": [],
      "ints": [],
      "strings": [],
      "tensors": [],
      "graphs": [],
      "sparseTensors": []
     }
    ],
    "docString": ""
   },
   {
    "input": [
     "97",
     "99"
    ],
    "output": [
     "100"
    ],
    "name": "100",
    "opType": "MUL",
    "domain": "",
    "attribute": [],
    "docString": ""
   },
   {
    "input": [
     "100"
    ],
    "output": [
     "101"
    ],
    "name": "101",
    "opType": "NEG",
    "domain": "",
    "attribute": [],
    "docString": ""
   },
   {
    "input": [
     "101"
    ],
    "output": [
     "102"
    ],
    "name": "102",
    "opType": "NEG",
    "domain": "",
    "attribute": [],
    "docString": ""
   },
   {
    "input": [
     "102",
     "28"
    ],
    "output": [
     "103"
    ],
    "name": "103",
    "opType": "MUL",
    "domain": "",
    "attribute": [],
    "docString": ""
   },
   {
    "input": [
     "103",
     "27"
    ],
    "output": [
     "104"
    ],
    "name": "104",
    "opType": "DIV",
    "domain": "",
    "attribute": [],
    "docString": ""
   },
   {
    "input": [
     "104",
     "27"
    ],
    "output": [
     "105"
    ],
    "name": "105",
    "opType": "DIV",
    "domain": "",
    "attribute": [],
    "docString": ""
   },
   {
    "input": [
     "21",
     "105"
    ],
    "output": [
     "106"
    ],
    "name": "106",
    "opType": "MUL",
    "domain": "",
    "attribute": [],
    "docString": ""
   },
   {
    "input": [
     "106"
    ],
    "output": [
     "107"
    ],
    "name": "107",
    "opType": "NEG",
    "domain": "",
    "attribute": [],
    "docString": ""
   },
   {
    "input": [
     "107"
    ],
    "output": [
     "1035"
    ],
    "name": "1035",
    "opType": "REDUCE_SUM",
    "domain": "",
    "attribute": [
     {
      "name": "rank_set",
      "refAttrName": "",
      "docString": "",
      "type": "INTS",
      "f": 0,
      "i": "0",
      "s": "",
      "floats": [],
      "ints": [
       "1"
      ],
      "strings": [],
      "tensors": [],
      "graphs": [],
      "sparseTensors": []
     }
    ],
    "docString": ""
   }
  ],
  "name": "",
  "initializer": [
   {
    "dims": [
     "10",
     "3",
     "1",
     "1",
     "1",
     "1",
     "1",
     "1"
    ],
    "dataType": 11,
    "floatData": [],
    "int32Data": [],
    "stringData": [],
    "int64Data": [],
    "name": "1",
    "docString": "",
    "rawData": "",
    "externalData": [],
    "dataLocation": "DEFAULT",
    "doubleData": [
     0,
     0,
     0,
     0,
     0,
     0,
     0,
     0,
     0,
     0,
     0,
     0,
     0,
     0,
     0,
     0,
     0,
     0,
     0,
     0,
     0,
     0,
     0,
     0,
     0,
     0,
     0,
     0,
     0,
     0
    ],
    "uint64Data": []
   },
   {
    "dims": [
     "9",
     "10",
     "1",
     "1",
     "1",
     "1",
     "1",
     "1"
    ],
    "dataType": 11,
    "floatData": [],
    "int32Data": [],
    "stringData": [],
    "int64Data": [],
    "name": "2",
    "docString": "",
    "rawData": "",
    "externalData": [],
    "dataLocation": "DEFAULT",
    "doubleData": [
     0,
     0,
     0,
     0,
     0,
     0,
     0,
     0,
     0,
     0,
     0,
     0,
     0,
     0,
     0,
     0,
     0,
     0,
     0,
     0,
     0,
     0,
     0,
     0,
     0,
     0,
     0,
     0,
     0,
     0,
     0,
     0,
     0,
     0,
     0,
     0,
     0,
     0,
     0,
     0,
     0,
     0,
     0,
     0,
     0,
     0,
     0,
     0,
     0,
     0,
     0,
     0,
     0,
     0,
     0,
     0,
     0,
     0,
     0,
     0,
     0,
     0,
     0,
     0,
     0,
     0,
     0,
     0,
     0,
     0,
     0,
     0,
     0,
     0,
     0,
     0,
     0,
     0,
     0,
     0,
     0,
     0,
     0,
     0,
     0,
     0,
     0,
     0,
     0,
     0
    ],
    "uint64Data": []
   },
   {
    "dims": [
     "9",
     "1",
     "1",
     "1",
     "1",
     "1",
     "1",
     "1"
    ],
    "dataType": 11,
    "floatData": [],
    "int32Data": [],
    "stringData": [],
    "int64Data": [],
    "name": "4",
    "docString": "",
    "rawData": "",
    "externalData": [],
    "dataLocation": "DEFAULT",
    "doubleData": [
     0,
     0,
     0,
     0,
     0,
     0,
     0,
     0,
     0
    ],
    "uint64Data": []
   },
   {
    "dims": [
     "1",
     "1",
     "1",
     "1",
     "1",
     "1",
     "1",
     "1"
    ],
    "dataType": 11,
    "floatData": [],
    "int32Data": [],
    "stringData": [],
    "int64Data": [],
    "name": "9",
    "docString": "",
    "rawData": "",
    "externalData": [],
    "dataLocation": "DEFAULT",
    "doubleData": [
     1
    ],
    "uint64Data": []
   },
   {
    "dims": [
     "1",
     "1",
     "1",
     "1",
     "1",
     "1",
     "1",
     "1"
    ],
    "dataType": 11,
    "floatData": [],
    "int32Data": [],
    "stringData": [],
    "int64Data": [],
    "name": "10",
    "docString": "",
    "rawData": "",
    "externalData": [],
    "dataLocation": "DEFAULT",
    "doubleData": [
     1
    ],
    "uint64Data": []
   },
   {
    "dims": [
     "5",
     "9",
     "1",
     "1",
     "1",
     "1",
     "1",
     "1"
    ],
    "dataType": 11,
    "floatData": [],
    "int32Data": [],
    "stringData": [],
    "int64Data": [],
    "name": "15",
    "docString": "",
    "rawData": "",
    "externalData": [],
    "dataLocation": "DEFAULT",
    "doubleData": [
     0,
     0,
     0,
     0,
     0,
     0,
     0,
     0,
     0,
     0,
     0,
     0,
     0,
     0,
     0,
     0,
     0,
     0,
     0,
     0,
     0,
     0,
     0,
     0,
     0,
     0,
     0,
     0,
     0,
     0,
     0,
     0,
     0,
     0,
     0,
     0,
     0,
     0,
     0,
     0,
     0,
     0,
     0,
     0,
     0
    ],
    "uint64Data": []
   },
   {
    "dims": [
     "5",
     "1",
     "1",
     "1",
     "1",
     "1",
     "1",
     "1"
    ],
    "dataType": 11,
    "floatData": [],
    "int32Data": [],
    "stringData": [],
    "int64Data": [],
    "name": "17",
    "docString": "",
    "rawData": "",
    "externalData": [],
    "dataLocation": "DEFAULT",
    "doubleData": [
     0,
     0,
     0,
     0,
     0
    ],
    "uint64Data": []
   },
   {
    "dims": [
     "1",
     "1",
     "1",
     "1",
     "1",
     "1",
     "1",
     "1"
    ],
    "dataType": 11,
    "floatData": [],
    "int32Data": [],
    "stringData": [],
    "int64Data": [],
    "name": "22",
    "docString": "",
    "rawData": "",
    "externalData": [],
    "dataLocation": "DEFAULT",
    "doubleData": [
     2
    ],
    "uint64Data": []
   },
   {
    "dims": [
     "5",
     "3",
     "1",
     "1",
     "1",
     "1",
     "1",
     "1"
    ],
    "dataType": 11,
    "floatData": [],
    "int32Data": [],
    "stringData": [],
    "int64Data": [],
    "name": "23",
    "docString": "",
    "rawData": "",
    "externalData": [],
    "dataLocation": "DEFAULT",
    "doubleData": [
     0,
     0,
     0,
     0,
     0,
     0,
     0,
     0,
     0,
     0,
     0,
     0,
     0,
     0,
     0
    ],
    "uint64Data": []
   },
   {
    "dims": [
     "1",
     "1",
     "1",
     "1",
     "1",
     "1",
     "1",
     "1"
    ],
    "dataType": 11,
    "floatData": [],
    "int32Data": [],
    "stringData": [],
    "int64Data": [],
    "name": "24",
    "docString": "",
    "rawData": "",
    "externalData": [],
    "dataLocation": "DEFAULT",
    "doubleData": [
     1
    ],
    "uint64Data": []
   },
   {
    "dims": [
     "1",
     "1",
     "1",
     "1",
     "1",
     "1",
     "1",
     "1"
    ],
    "dataType": 11,
    "floatData": [],
    "int32Data": [],
    "stringData": [],
    "int64Data": [],
    "name": "25",
    "docString": "",
    "rawData": "",
    "externalData": [],
    "dataLocation": "DEFAULT",
    "doubleData": [
     1
    ],
    "uint64Data": []
   },
   {
    "dims": [
     "1",
     "1",
     "1",
     "1",
     "1",
     "1",
     "1",
     "1"
    ],
    "dataType": 11,
    "floatData": [],
    "int32Data": [],
    "stringData": [],
    "int64Data": [],
    "name": "32",
    "docString": "",
    "rawData": "",
    "externalData": [],
    "dataLocation": "DEFAULT",
    "doubleData": [
     1
    ],
    "uint64Data": []
   },
   {
    "dims": [
     "5",
     "3",
     "1",
     "1",
     "1",
     "1",
     "1",
     "1"
    ],
    "dataType": 1,
    "floatData": [
     1,
     1,
     1,
     1,
     1,
     1,
     1,
     1,
     1,
     1,
     1,
     1,
     1,
     1,
     1
    ],
    "int32Data": [],
    "stringData": [],
    "int64Data": [],
    "name": "37",
    "docString": "",
    "rawData": "",
    "externalData": [],
    "dataLocation": "DEFAULT",
    "doubleData": [],
    "uint64Data": []
   },
   {
    "dims": [
     "1",
     "1",
     "1",
     "1",
     "1",
     "1",
     "1",
     "1"
    ],
    "dataType": 11,
    "floatData": [],
    "int32Data": [],
    "stringData": [],
    "int64Data": [],
    "name": "55",
    "docString": "",
    "rawData": "",
    "externalData": [],
    "dataLocation": "DEFAULT",
    "doubleData": [
     1
    ],
    "uint64Data": []
   },
   {
    "dims": [
     "5",
     "3",
     "1",
     "1",
     "1",
     "1",
     "1",
     "1"
    ],
    "dataType": 1,
    "floatData": [
     1,
     1,
     1,
     1,
     1,
     1,
     1,
     1,
     1,
     1,
     1,
     1,
     1,
     1,
     1
    ],
    "int32Data": [],
    "stringData": [],
    "int64Data": [],
    "name": "60",
    "docString": "",
    "rawData": "",
    "externalData": [],
    "dataLocation": "DEFAULT",
    "doubleData": [],
    "uint64Data": []
   },
   {
    "dims": [
     "1",
     "1",
     "1",
     "1",
     "1",
     "1",
     "1",
     "1"
    ],
    "dataType": 11,
    "floatData": [],
    "int32Data": [],
    "stringData": [],
    "int64Data": [],
    "name": "77",
    "docString": "",
    "rawData": "",
    "externalData": [],
    "dataLocation": "DEFAULT",
    "doubleData": [
     1
    ],
    "uint64Data": []
   },
   {
    "dims": [
     "5",
     "3",
     "1",
     "1",
     "1",
     "1",
     "1",
     "1"
    ],
    "dataType": 1,
    "floatData": [
     1,
     1,
     1,
     1,
     1,
     1,
     1,
     1,
     1,
     1,
     1,
     1,
     1,
     1,
     1
    ],
    "int32Data": [],
    "stringData": [],
    "int64Data": [],
    "name": "82",
    "docString": "",
    "rawData": "",
    "externalData": [],
    "dataLocation": "DEFAULT",
    "doubleData": [],
    "uint64Data": []
   },
   {
    "dims": [
     "1",
     "1",
     "1",
     "1",
     "1",
     "1",
     "1",
     "1"
    ],
    "dataType": 11,
    "floatData": [],
    "int32Data": [],
    "stringData": [],
    "int64Data": [],
    "name": "93",
    "docString": "",
    "rawData": "",
    "externalData": [],
    "dataLocation": "DEFAULT",
    "doubleData": [
     1
    ],
    "uint64Data": []
   },
   {
    "dims": [
     "5",
     "3",
     "1",
     "1",
     "1",
     "1",
     "1",
     "1"
    ],
    "dataType": 1,
    "floatData": [
     1,
     1,
     1,
     1,
     1,
     1,
     1,
     1,
     1,
     1,
     1,
     1,
     1,
     1,
     1
    ],
    "int32Data": [],
    "stringData": [],
    "int64Data": [],
    "name": "98",
    "docString": "",
    "rawData": "",
    "externalData": [],
    "dataLocation": "DEFAULT",
    "doubleData": [],
    "uint64Data": []
   }
  ],
  "sparseInitializer": [],
  "docString": "",
  "input": [],
  "output": [
   {
    "name": "1032",
    "type": {
     "tensorType": {
      "elemType": 0,
      "shape": {
       "dim": [
        {
         "denotation": "",
         "dimValue": "9"
        },
        {
         "denotation": "",
         "dimValue": "10"
        },
        {
         "denotation": "",
         "dimValue": "1"
        },
        {
         "denotation": "",
         "dimValue": "1"
        },
        {
         "denotation": "",
         "dimValue": "1"
        },
        {
         "denotation": "",
         "dimValue": "1"
        },
        {
         "denotation": "",
         "dimValue": "1"
        },
        {
         "denotation": "",
         "dimValue": "1"
        }
       ]
      }
     },
     "denotation": ""
    },
    "docString": ""
   },
   {
    "name": "1033",
    "type": {
     "tensorType": {
      "elemType": 0,
      "shape": {
       "dim": [
        {
         "denotation": "",
         "dimValue": "9"
        },
        {
         "denotation": "",
         "dimValue": "1"
        },
        {
         "denotation": "",
         "dimValue": "1"
        },
        {
         "denotation": "",
         "dimValue": "1"
        },
        {
         "denotation": "",
         "dimValue": "1"
        },
        {
         "denotation": "",
         "dimValue": "1"
        },
        {
         "denotation": "",
         "dimValue": "1"
        },
        {
         "denotation": "",
         "dimValue": "1"
        }
       ]
      }
     },
     "denotation": ""
    },
    "docString": ""
   },
   {
    "name": "1034",
    "type": {
     "tensorType": {
      "elemType": 0,
      "shape": {
       "dim": [
        {
         "denotation": "",
         "dimValue": "5"
        },
        {
         "denotation": "",
         "dimValue": "9"
        },
        {
         "denotation": "",
         "dimValue": "1"
        },
        {
         "denotation": "",
         "dimValue": "1"
        },
        {
         "denotation": "",
         "dimValue": "1"
        },
        {
         "denotation": "",
         "dimValue": "1"
        },
        {
         "denotation": "",
         "dimValue": "1"
        },
        {
         "denotation": "",
         "dimValue": "1"
        }
       ]
      }
     },
     "denotation": ""
    },
    "docString": ""
   },
   {
    "name": "1035",
    "type": {
     "tensorType": {
      "elemType": 0,
      "shape": {
       "dim": [
        {
         "denotation": "",
         "dimValue": "5"
        },
        {
         "denotation": "",
         "dimValue": "1"
        },
        {
         "denotation": "",
         "dimValue": "1"
        },
        {
         "denotation": "",
         "dimValue": "1"
        },
        {
         "denotation": "",
         "dimValue": "1"
        },
        {
         "denotation": "",
         "dimValue": "1"
        },
        {
         "denotation": "",
         "dimValue": "1"
        },
        {
         "denotation": "",
         "dimValue": "1"
        }
       ]
      }
     },
     "denotation": ""
    },
    "docString": ""
   }
  ],
  "valueInfo": [],
  "quantizationAnnotation": [
   {
    "tensorName": "1",
    "quantParameterTensorNames": [
     {
      "key": "TENSOR_NAME",
      "value": "in"
     },
     {
      "key": "LEAF_USAGE",
      "value": "variable"
     }
    ]
   },
   {
    "tensorName": "2",
    "quantParameterTensorNames": [
     {
      "key": "TENSOR_NAME",
      "value": "weight0"
     },
     {
      "key": "LEAF_USAGE",
      "value": "variable"
     }
    ]
   },
   {
    "tensorName": "4",
    "quantParameterTensorNames": [
     {
      "key": "TENSOR_NAME",
      "value": "bias0"
     },
     {
      "key": "LEAF_USAGE",
      "value": "variable"
     }
    ]
   },
   {
    "tensorName": "9",
    "quantParameterTensorNames": [
     {
      "key": "TENSOR_NAME",
      "value": "1"
     },
     {
      "key": "LEAF_USAGE",
      "value": "constant"
     }
    ]
   },
   {
    "tensorName": "10",
    "quantParameterTensorNames": [
     {
      "key": "TENSOR_NAME",
      "value": "1"
     },
     {
      "key": "LEAF_USAGE",
      "value": "constant"
     }
    ]
   },
   {
    "tensorName": "15",
    "quantParameterTensorNames": [
     {
      "key": "TENSOR_NAME",
      "value": "weight1"
     },
     {
      "key": "LEAF_USAGE",
      "value": "variable"
     }
    ]
   },
   {
    "tensorName": "17",
    "quantParameterTensorNames": [
     {
      "key": "TENSOR_NAME",
      "value": "bias1"
     },
     {
      "key": "LEAF_USAGE",
      "value": "variable"
     }
    ]
   },
   {
    "tensorName": "22",
    "quantParameterTensorNames": [
     {
      "key": "TENSOR_NAME",
      "value": "2"
     },
     {
      "key": "LEAF_USAGE",
      "value": "constant"
     }
    ]
   },
   {
    "tensorName": "23",
    "quantParameterTensorNames": [
     {
      "key": "TENSOR_NAME",
      "value": "out"
     },
     {
      "key": "LEAF_USAGE",
      "value": "variable"
     }
    ]
   },
   {
    "tensorName": "24",
    "quantParameterTensorNames": [
     {
      "key": "TENSOR_NAME",
      "value": "1"
     },
     {
      "key": "LEAF_USAGE",
      "value": "constant"
     }
    ]
   },
   {
    "tensorName": "25",
    "quantParameterTensorNames": [
     {
      "key": "TENSOR_NAME",
      "value": "1"
     },
     {
      "key": "LEAF_USAGE",
      "value": "constant"
     }
    ]
   },
   {
    "tensorName": "32",
    "quantParameterTensorNames": [
     {
      "key": "TENSOR_NAME",
      "value": "1"
     },
     {
      "key": "LEAF_USAGE",
      "value": "constant"
     }
    ]
   },
   {
    "tensorName": "37",
    "quantParameterTensorNames": [
     {
      "key": "TENSOR_NAME",
      "value": "1"
     },
     {
      "key": "LEAF_USAGE",
      "value": "constant"
     }
    ]
   },
   {
    "tensorName": "55",
    "quantParameterTensorNames": [
     {
      "key": "TENSOR_NAME",
      "value": "1"
     },
     {
      "key": "LEAF_USAGE",
      "value": "constant"
     }
    ]
   },
   {
    "tensorName": "60",
    "quantParameterTensorNames": [
     {
      "key": "TENSOR_NAME",
      "value": "1"
     },
     {
      "key": "LEAF_USAGE",
      "value": "constant"
     }
    ]
   },
   {
    "tensorName": "77",
    "quantParameterTensorNames": [
     {
      "key": "TENSOR_NAME",
      "value": "1"
     },
     {
      "key": "LEAF_USAGE",
      "value": "constant"
     }
    ]
   },
   {
    "tensorName": "82",
    "quantParameterTensorNames": [
     {
      "key": "TENSOR_NAME",
      "value": "1"
     },
     {
      "key": "LEAF_USAGE",
      "value": "constant"
     }
    ]
   },
   {
    "tensorName": "93",
    "quantParameterTensorNames": [
     {
      "key": "TENSOR_NAME",
      "value": "1"
     },
     {
      "key": "LEAF_USAGE",
      "value": "constant"
     }
    ]
   },
   {
    "tensorName": "98",
    "quantParameterTensorNames": [
     {
      "key": "TENSOR_NAME",
      "value": "1"
     },
     {
      "key": "LEAF_USAGE",
      "value": "constant"
     }
    ]
   }
  ]
 },
 "metadataProps": []
}
