{
 "irVersion": "0",
 "opsetImport": [],
 "producerName": "",
 "producerVersion": "",
 "domain": "",
 "modelVersion": "0",
 "docString": "",
 "metadataProps": [
  {
   "key": "0",
   "value": "\n\nLEAF_USAGE\u0012\bconstant"
  },
  {
   "key": "1",
   "value": "\n\nLEAF_USAGE\u0012\bconstant"
  },
  {
   "key": "3",
   "value": "\n\nLEAF_USAGE\u0012\bconstant"
  },
  {
   "key": "7",
   "value": "\n\nLEAF_USAGE\u0012\bconstant"
  },
  {
   "key": "10",
   "value": "\n\nLEAF_USAGE\u0012\bconstant"
  },
  {
   "key": "12",
   "value": "\n\nLEAF_USAGE\u0012\bconstant"
  },
  {
   "key": "14",
   "value": "\n\nLEAF_USAGE\u0012\bconstant"
  }
 ]
}
