{
 "irVersion": "0",
 "opsetImport": [],
 "producerName": "",
 "producerVersion": "",
 "domain": "",
 "modelVersion": "0",
 "docString": "",
 "graph": {
  "node": [
   {
    "input": [
     "2"
    ],
    "output": [
     "3"
    ],
    "name": "3",
    "opType": "NEG",
    "domain": "",
    "attribute": [],
    "docString": ""
   },
   {
    "input": [
     "4"
    ],
    "output": [
     "5"
    ],
    "name": "5",
    "opType": "SIN",
    "domain": "",
    "attribute": [],
    "docString": ""
   },
   {
    "input": [
     "5",
     "4"
    ],
    "output": [
     "6"
    ],
    "name": "6",
    "opType": "ADD",
    "domain": "",
    "attribute": [],
    "docString": ""
   },
   {
    "input": [
     "6"
    ],
    "output": [
     "7"
    ],
    "name": "7",
    "opType": "CAST",
    "domain": "",
    "attribute": [
     {
      "name": "dtype",
      "refAttrName": "",
      "docString": "",
      "type": "STRING",
      "f": 0,
      "i": "0",
      "s": "RkxPQVQ=",
      "floats": [],
      "ints": [],
      "strings": [],
      "tensors": [],
      "graphs": [],
      "sparseTensors": []
     }
    ],
    "docString": ""
   },
   {
    "input": [
     "3",
     "7"
    ],
    "output": [
     "8"
    ],
    "name": "8",
    "opType": "DIV",
    "domain": "",
    "attribute": [],
    "docString": ""
   },
   {
    "input": [
     "8"
    ],
    "output": [
     "9"
    ],
    "name": "9",
    "opType": "CAST",
    "domain": "",
    "attribute": [
     {
      "name": "dtype",
      "refAttrName": "",
      "docString": "",
      "type": "STRING",
      "f": 0,
      "i": "0",
      "s": "RE9VQkxF",
      "floats": [],
      "ints": [],
      "strings": [],
      "tensors": [],
      "graphs": [],
      "sparseTensors": []
     }
    ],
    "docString": ""
   },
   {
    "input": [
     "9",
     "10"
    ],
    "output": [
     "11"
    ],
    "name": "11",
    "opType": "POW",
    "domain": "",
    "attribute": [],
    "docString": ""
   },
   {
    "input": [
     "1",
     "11"
    ],
    "output": [
     "root1"
    ],
    "name": "root1",
    "opType": "SUB",
    "domain": "",
    "attribute": [],
    "docString": ""
   },
   {
    "input": [
     "12"
    ],
    "output": [
     "13"
    ],
    "name": "13",
    "opType": "CAST",
    "domain": "",
    "attribute": [
     {
      "name": "dtype",
      "refAttrName": "",
      "docString": "",
      "type": "STRING",
      "f": 0,
      "i": "0",
      "s": "RE9VQkxF",
      "floats": [],
      "ints": [],
      "strings": [],
      "tensors": [],
      "graphs": [],
      "sparseTensors": []
     }
    ],
    "docString": ""
   },
   {
    "input": [
     "12"
    ],
    "output": [
     "14"
    ],
    "name": "14",
    "opType": "ABS",
    "domain": "",
    "attribute": [],
    "docString": ""
   },
   {
    "input": [
     "14"
    ],
    "output": [
     "15"
    ],
    "name": "15",
    "opType": "CAST",
    "domain": "",
    "attribute": [
     {
      "name": "dtype",
      "refAttrName": "",
      "docString": "",
      "type": "STRING",
      "f": 0,
      "i": "0",
      "s": "RE9VQkxF",
      "floats": [],
      "ints": [],
      "strings": [],
      "tensors": [],
      "graphs": [],
      "sparseTensors": []
     }
    ],
    "docString": ""
   },
   {
    "input": [
     "16"
    ],
    "output": [
     "17"
    ],
    "name": "17",
    "opType": "EXP",
    "domain": "",
    "attribute": [],
    "docString": ""
   },
   {
    "input": [
     "17"
    ],
    "output": [
     "18"
    ],
    "name": "18",
    "opType": "CAST",
    "domain": "",
    "attribute": [
     {
      "name": "dtype",
      "refAttrName": "",
      "docString": "",
      "type": "STRING",
      "f": 0,
      "i": "0",
      "s": "RE9VQkxF",
      "floats": [],
      "ints": [],
      "strings": [],
      "tensors": [],
      "graphs": [],
      "sparseTensors": []
     }
    ],
    "docString": ""
   },
   {
    "input": [
     "19"
    ],
    "output": [
     "20"
    ],
    "name": "20",
    "opType": "NEG",
    "domain": "",
    "attribute": [],
    "docString": ""
   },
   {
    "input": [
     "15",
     "18",
     "20"
    ],
    "output": [
     "21"
    ],
    "name": "21",
    "opType": "MUL",
    "domain": "",
    "attribute": [],
    "docString": ""
   },
   {
    "input": [
     "13",
     "21"
    ],
    "output": [
     "root2"
    ],
    "name": "root2",
    "opType": "SUB",
    "domain": "",
    "attribute": [],
    "docString": ""
   }
  ],
  "name": "",
  "initializer": [
   {
    "dims": [
     "3",
     "7",
     "1",
     "1",
     "1",
     "1",
     "1",
     "1"
    ],
    "dataType": 11,
    "floatData": [],
    "int32Data": [],
    "stringData": [],
    "int64Data": [],
    "name": "1",
    "docString": "",
    "rawData": "",
    "externalData": [],
    "dataLocation": "DEFAULT",
    "doubleData": [
     23,
     23,
     23,
     23,
     23,
     23,
     23,
     23,
     23,
     23,
     23,
     23,
     23,
     23,
     23,
     23,
     23,
     23,
     23,
     23,
     23
    ],
    "uint64Data": []
   },
   {
    "dims": [
     "3",
     "7",
     "1",
     "1",
     "1",
     "1",
     "1",
     "1"
    ],
    "dataType": 1,
    "floatData": [
     0,
     0,
     0,
     0,
     0,
     0,
     0,
     0,
     0,
     0,
     0,
     0,
     0,
     0,
     0,
     0,
     0,
     0,
     0,
     0,
     0
    ],
    "int32Data": [],
    "stringData": [],
    "int64Data": [],
    "name": "2",
    "docString": "",
    "rawData": "",
    "externalData": [],
    "dataLocation": "DEFAULT",
    "doubleData": [],
    "uint64Data": []
   },
   {
    "dims": [
     "3",
     "7",
     "1",
     "1",
     "1",
     "1",
     "1",
     "1"
    ],
    "dataType": 6,
    "floatData": [],
    "int32Data": [
     0,
     0,
     0,
     0,
     0,
     0,
     0,
     0,
     0,
     0,
     0,
     0,
     0,
     0,
     0,
     0,
     0,
     0,
     0,
     0,
     0
    ],
    "stringData": [],
    "int64Data": [],
    "name": "4",
    "docString": "",
    "rawData": "",
    "externalData": [],
    "dataLocation": "DEFAULT",
    "doubleData": [],
    "uint64Data": []
   },
   {
    "dims": [
     "3",
     "7",
     "1",
     "1",
     "1",
     "1",
     "1",
     "1"
    ],
    "dataType": 11,
    "floatData": [],
    "int32Data": [],
    "stringData": [],
    "int64Data": [],
    "name": "10",
    "docString": "",
    "rawData": "",
    "externalData": [],
    "dataLocation": "DEFAULT",
    "doubleData": [
     0,
     0,
     0,
     0,
     0,
     0,
     0,
     0,
     0,
     0,
     0,
     0,
     0,
     0,
     0,
     0,
     0,
     0,
     0,
     0,
     0
    ],
    "uint64Data": []
   },
   {
    "dims": [
     "3",
     "7",
     "1",
     "1",
     "1",
     "1",
     "1",
     "1"
    ],
    "dataType": 6,
    "floatData": [],
    "int32Data": [
     0,
     0,
     0,
     0,
     0,
     0,
     0,
     0,
     0,
     0,
     0,
     0,
     0,
     0,
     0,
     0,
     0,
     0,
     0,
     0,
     0
    ],
    "stringData": [],
    "int64Data": [],
    "name": "16",
    "docString": "",
    "rawData": "",
    "externalData": [],
    "dataLocation": "DEFAULT",
    "doubleData": [],
    "uint64Data": []
   },
   {
    "dims": [
     "3",
     "7",
     "1",
     "1",
     "1",
     "1",
     "1",
     "1"
    ],
    "dataType": 11,
    "floatData": [],
    "int32Data": [],
    "stringData": [],
    "int64Data": [],
    "name": "19",
    "docString": "",
    "rawData": "",
    "externalData": [],
    "dataLocation": "DEFAULT",
    "doubleData": [
     0,
     0,
     0,
     0,
     0,
     0,
     0,
     0,
     0,
     0,
     0,
     0,
     0,
     0,
     0,
     0,
     0,
     0,
     0,
     0,
     0
    ],
    "uint64Data": []
   }
  ],
  "sparseInitializer": [],
  "docString": "",
  "input": [
   {
    "name": "12",
    "type": {
     "tensorType": {
      "elemType": 1,
      "shape": {
       "dim": [
        {
         "denotation": "",
         "dimValue": "3"
        },
        {
         "denotation": "",
         "dimValue": "7"
        },
        {
         "denotation": "",
         "dimValue": "1"
        },
        {
         "denotation": "",
         "dimValue": "1"
        },
        {
         "denotation": "",
         "dimValue": "1"
        },
        {
         "denotation": "",
         "dimValue": "1"
        },
        {
         "denotation": "",
         "dimValue": "1"
        },
        {
         "denotation": "",
         "dimValue": "1"
        }
       ]
      }
     },
     "denotation": ""
    },
    "docString": ""
   }
  ],
  "output": [
   {
    "name": "root1",
    "type": {
     "tensorType": {
      "elemType": 0,
      "shape": {
       "dim": [
        {
         "denotation": "",
         "dimValue": "3"
        },
        {
         "denotation": "",
         "dimValue": "7"
        },
        {
         "denotation": "",
         "dimValue": "1"
        },
        {
         "denotation": "",
         "dimValue": "1"
        },
        {
         "denotation": "",
         "dimValue": "1"
        },
        {
         "denotation": "",
         "dimValue": "1"
        },
        {
         "denotation": "",
         "dimValue": "1"
        },
        {
         "denotation": "",
         "dimValue": "1"
        }
       ]
      }
     },
     "denotation": ""
    },
    "docString": ""
   },
   {
    "name": "root2",
    "type": {
     "tensorType": {
      "elemType": 0,
      "shape": {
       "dim": [
        {
         "denotation": "",
         "dimValue": "3"
        },
        {
         "denotation": "",
         "dimValue": "7"
        },
        {
         "denotation": "",
         "dimValue": "1"
        },
        {
         "denotation": "",
         "dimValue": "1"
        },
        {
         "denotation": "",
         "dimValue": "1"
        },
        {
         "denotation": "",
         "dimValue": "1"
        },
        {
         "denotation": "",
         "dimValue": "1"
        },
        {
         "denotation": "",
         "dimValue": "1"
        }
       ]
      }
     },
     "denotation": ""
    },
    "docString": ""
   }
  ],
  "valueInfo": [],
  "quantizationAnnotation": [
   {
    "tensorName": "1",
    "quantParameterTensorNames": [
     {
      "key": "TENSOR_NAME",
      "value": "23"
     },
     {
      "key": "LEAF_USAGE",
      "value": "constant"
     }
    ]
   },
   {
    "tensorName": "2",
    "quantParameterTensorNames": [
     {
      "key": "TENSOR_NAME",
      "value": "osrc"
     },
     {
      "key": "LEAF_USAGE",
      "value": "variable"
     }
    ]
   },
   {
    "tensorName": "4",
    "quantParameterTensorNames": [
     {
      "key": "TENSOR_NAME",
      "value": "src"
     },
     {
      "key": "LEAF_USAGE",
      "value": "variable"
     }
    ]
   },
   {
    "tensorName": "10",
    "quantParameterTensorNames": [
     {
      "key": "TENSOR_NAME",
      "value": "osrc2"
     },
     {
      "key": "LEAF_USAGE",
      "value": "variable"
     }
    ]
   },
   {
    "tensorName": "12",
    "quantParameterTensorNames": [
     {
      "key": "TENSOR_NAME",
      "value": "s2src"
     },
     {
      "key": "LEAF_USAGE",
      "value": "placeholder"
     }
    ]
   },
   {
    "tensorName": "16",
    "quantParameterTensorNames": [
     {
      "key": "TENSOR_NAME",
      "value": "s2src2"
     },
     {
      "key": "LEAF_USAGE",
      "value": "variable"
     }
    ]
   },
   {
    "tensorName": "19",
    "quantParameterTensorNames": [
     {
      "key": "TENSOR_NAME",
      "value": "s2src3"
     },
     {
      "key": "LEAF_USAGE",
      "value": "variable"
     }
    ]
   }
  ]
 },
 "metadataProps": []
}
