{
 "irVersion": "6",
 "opsetImport": [],
 "producerName": "tenncor",
 "producerVersion": "1.0.0",
 "domain": "com.tenncor.eteq",
 "modelVersion": "6",
 "docString": "",
 "graph": {
  "node": [
   {
    "input": [
     "_i0"
    ],
    "output": [
     "5"
    ],
    "name": "5",
    "opType": "_DENSE_LAYER",
    "domain": "",
    "attribute": [
     {
      "name": "layer",
      "refAttrName": "",
      "docString": "",
      "type": "GRAPH",
      "f": 0,
      "i": "0",
      "s": "",
      "g": {
       "node": [
        {
         "input": [
          "_i0",
          "1"
         ],
         "output": [
          "2"
         ],
         "name": "2",
         "opType": "MATMUL",
         "domain": "",
         "attribute": [
          {
           "name": "rank_pairs",
           "refAttrName": "",
           "docString": "",
           "type": "INTS",
           "f": 0,
           "i": "0",
           "s": "",
           "floats": [],
           "ints": [
            "0",
            "1"
           ],
           "strings": [],
           "tensors": [],
           "graphs": [],
           "sparseTensors": []
          }
         ],
         "docString": ""
        },
        {
         "input": [
          "3"
         ],
         "output": [
          "4"
         ],
         "name": "4",
         "opType": "EXTEND",
         "domain": "",
         "attribute": [
          {
           "name": "tensor",
           "refAttrName": "",
           "docString": "",
           "type": "TENSOR",
           "f": 0,
           "i": "0",
           "s": "",
           "t": {
            "dims": [],
            "dataType": 0,
            "floatData": [],
            "int32Data": [],
            "stringData": [],
            "int64Data": [],
            "name": "2",
            "docString": "",
            "rawData": "",
            "externalData": [],
            "dataLocation": "DEFAULT",
            "doubleData": [],
            "uint64Data": []
           },
           "floats": [],
           "ints": [],
           "strings": [],
           "tensors": [],
           "graphs": [],
           "sparseTensors": []
          }
         ],
         "docString": ""
        },
        {
         "input": [
          "2",
          "4"
         ],
         "output": [
          "5"
         ],
         "name": "5",
         "opType": "ADD",
         "domain": "",
         "attribute": [],
         "docString": ""
        }
       ],
       "name": "",
       "initializer": [
        {
         "dims": [
          "9",
          "10",
          "1",
          "1",
          "1",
          "1",
          "1",
          "1"
         ],
         "dataType": 1,
         "floatData": [
          -1.41993022,
          -1.0585438,
          0.39842236,
          -0.316709757,
          0.0776763931,
          -0.622546911,
          0.189230233,
          -0.539263964,
          0.802708685,
          -0.367004246,
          -1.3772862,
          0.545728,
          -0.408836633,
          -0.492482424,
          -0.332031786,
          0.35140878,
          0.108453132,
          1.12682426,
          -0.846289814,
          -0.27035442,
          -0.142297328,
          -0.840404809,
          -0.464457601,
          -0.276431,
          0.708882928,
          0.1406333,
          -0.470873564,
          -0.822648287,
          -0.94072938,
          0.111270919,
          -0.60772717,
          -1.17060351,
          -1.24869514,
          -0.108136497,
          -1.20205116,
          0.842897415,
          -0.320778519,
          -0.3368164,
          0.432274818,
          -1.04849529,
          0.0058722049,
          0.0612894222,
          0.336477965,
          0.343364775,
          0.81237334,
          -0.675990403,
          -1.08127666,
          0.293841571,
          -1.02552199,
          -0.108701684,
          -0.587865233,
          -0.00675820559,
          -0.236407116,
          0.76015836,
          -0.406950414,
          -1.0058589,
          0.131763637,
          -0.640689135,
          0.165206984,
          0.489285707,
          0.526438177,
          -0.342654645,
          1.50300372,
          -1.0757333,
          -0.802087486,
          -1.3125577,
          -1.37114692,
          -1.0556345,
          -0.626831651,
          -0.78796792,
          -0.403273642,
          0.121435411,
          -0.708739102,
          -0.531315267,
          -1.30172658,
          -1.37650752,
          -0.24249357,
          -0.219943121,
          -0.745374143,
          -0.620106518,
          0.89599812,
          -0.413952947,
          -1.02144873,
          0.388721198,
          -0.497712284,
          -0.782598078,
          -0.132907808,
          0.230068952,
          -0.930534601,
          0.234007314
         ],
         "int32Data": [],
         "stringData": [],
         "int64Data": [],
         "name": "1",
         "docString": "",
         "rawData": "",
         "externalData": [],
         "dataLocation": "DEFAULT",
         "doubleData": [],
         "uint64Data": []
        },
        {
         "dims": [
          "9",
          "1",
          "1",
          "1",
          "1",
          "1",
          "1",
          "1"
         ],
         "dataType": 1,
         "floatData": [
          -0.193207502,
          -0.081285812,
          0.952336133,
          0.108479552,
          -0.430524617,
          0.380012929,
          0.813767195,
          0.0681769624,
          1.5218662
         ],
         "int32Data": [],
         "stringData": [],
         "int64Data": [],
         "name": "3",
         "docString": "",
         "rawData": "",
         "externalData": [],
         "dataLocation": "DEFAULT",
         "doubleData": [],
         "uint64Data": []
        }
       ],
       "sparseInitializer": [],
       "docString": "",
       "input": [
        {
         "name": "_i0",
         "type": {
          "tensorType": {
           "elemType": 1,
           "shape": {
            "dim": [
             {
              "denotation": "",
              "dimValue": "10"
             },
             {
              "denotation": "",
              "dimValue": "1"
             },
             {
              "denotation": "",
              "dimValue": "1"
             },
             {
              "denotation": "",
              "dimValue": "1"
             },
             {
              "denotation": "",
              "dimValue": "1"
             },
             {
              "denotation": "",
              "dimValue": "1"
             },
             {
              "denotation": "",
              "dimValue": "1"
             },
             {
              "denotation": "",
              "dimValue": "1"
             }
            ]
           }
          },
          "denotation": ""
         },
         "docString": ""
        }
       ],
       "output": [
        {
         "name": "5",
         "type": {
          "tensorType": {
           "elemType": 0,
           "shape": {
            "dim": [
             {
              "denotation": "",
              "dimValue": "9"
             },
             {
              "denotation": "",
              "dimValue": "1"
             },
             {
              "denotation": "",
              "dimValue": "1"
             },
             {
              "denotation": "",
              "dimValue": "1"
             },
             {
              "denotation": "",
              "dimValue": "1"
             },
             {
              "denotation": "",
              "dimValue": "1"
             },
             {
              "denotation": "",
              "dimValue": "1"
             },
             {
              "denotation": "",
              "dimValue": "1"
             }
            ]
           }
          },
          "denotation": ""
         },
         "docString": ""
        }
       ],
       "valueInfo": [],
       "quantizationAnnotation": [
        {
         "tensorName": "1",
         "quantParameterTensorNames": [
          {
           "key": "TENSOR_NAME",
           "value": "weight"
          },
          {
           "key": "LEAF_USAGE",
           "value": "variable"
          }
         ]
        },
        {
         "tensorName": "3",
         "quantParameterTensorNames": [
          {
           "key": "TENSOR_NAME",
           "value": "bias"
          },
          {
           "key": "LEAF_USAGE",
           "value": "variable"
          }
         ]
        }
       ]
      },
      "floats": [],
      "ints": [],
      "strings": [],
      "tensors": [],
      "graphs": [],
      "sparseTensors": []
     }
    ],
    "docString": ""
   },
   {
    "input": [
     "5"
    ],
    "output": [
     "6"
    ],
    "name": "6",
    "opType": "SIGMOID",
    "domain": "",
    "attribute": [],
    "docString": ""
   },
   {
    "input": [
     "6"
    ],
    "output": [
     "11"
    ],
    "name": "11",
    "opType": "_DENSE_LAYER",
    "domain": "",
    "attribute": [
     {
      "name": "layer",
      "refAttrName": "",
      "docString": "",
      "type": "GRAPH",
      "f": 0,
      "i": "0",
      "s": "",
      "g": {
       "node": [
        {
         "input": [
          "6",
          "7"
         ],
         "output": [
          "8"
         ],
         "name": "8",
         "opType": "MATMUL",
         "domain": "",
         "attribute": [
          {
           "name": "rank_pairs",
           "refAttrName": "",
           "docString": "",
           "type": "INTS",
           "f": 0,
           "i": "0",
           "s": "",
           "floats": [],
           "ints": [
            "0",
            "1"
           ],
           "strings": [],
           "tensors": [],
           "graphs": [],
           "sparseTensors": []
          }
         ],
         "docString": ""
        },
        {
         "input": [
          "9"
         ],
         "output": [
          "10"
         ],
         "name": "10",
         "opType": "EXTEND",
         "domain": "",
         "attribute": [
          {
           "name": "tensor",
           "refAttrName": "",
           "docString": "",
           "type": "TENSOR",
           "f": 0,
           "i": "0",
           "s": "",
           "t": {
            "dims": [],
            "dataType": 0,
            "floatData": [],
            "int32Data": [],
            "stringData": [],
            "int64Data": [],
            "name": "8",
            "docString": "",
            "rawData": "",
            "externalData": [],
            "dataLocation": "DEFAULT",
            "doubleData": [],
            "uint64Data": []
           },
           "floats": [],
           "ints": [],
           "strings": [],
           "tensors": [],
           "graphs": [],
           "sparseTensors": []
          }
         ],
         "docString": ""
        },
        {
         "input": [
          "8",
          "10"
         ],
         "output": [
          "11"
         ],
         "name": "11",
         "opType": "ADD",
         "domain": "",
         "attribute": [],
         "docString": ""
        }
       ],
       "name": "",
       "initializer": [
        {
         "dims": [
          "9",
          "9",
          "1",
          "1",
          "1",
          "1",
          "1",
          "1"
         ],
         "dataType": 1,
         "floatData": [
          2.75389314,
          2.19937897,
          2.49696207,
          1.00386465,
          -0.512244344,
          -2.41846704,
          -0.437521309,
          0.183002353,
          2.03772473,
          5.0953207,
          2.27406359,
          2.54541802,
          0.484375596,
          -0.0609647706,
          -2.21958637,
          -0.240115613,
          0.333850503,
          2.71270657,
          5.81152296,
          3.43490267,
          2.1765902,
          0.0734830424,
          0.959207594,
          -2.72315645,
          0.458830178,
          0.765978396,
          2.18746543,
          4.88967323,
          3.0705874,
          2.14922953,
          0.886764765,
          -0.794768453,
          -2.45054913,
          -0.401915401,
          -0.0972633213,
          2.44460177,
          5.37278223,
          2.79761767,
          2.37296247,
          -0.372892052,
          -0.0622980297,
          -2.59543371,
          -0.117788523,
          0.212848425,
          2.10119104,
          3.72017789,
          2.21190643,
          2.24455929,
          -0.271590352,
          -0.916904211,
          -2.92628169,
          -0.951978803,
          0.105254218,
          2.11589766,
          3.20707798,
          2.71025872,
          3.08536673,
          0.592927694,
          -0.0183514506,
          -1.87923539,
          -0.680128694,
          -0.516068757,
          2.62856054,
          2.71480107,
          2.66345096,
          1.73824024,
          -0.31052202,
          -2.01233029,
          -2.3278,
          -1.16477311,
          0.174606025,
          1.99298882,
          5.42835665,
          2.91492,
          1.49627709,
          -0.390935808,
          0.516940057,
          -2.79144692,
          -1.04976141,
          -0.436790615,
          2.54669476
         ],
         "int32Data": [],
         "stringData": [],
         "int64Data": [],
         "name": "7",
         "docString": "",
         "rawData": "",
         "externalData": [],
         "dataLocation": "DEFAULT",
         "doubleData": [],
         "uint64Data": []
        },
        {
         "dims": [
          "9",
          "1",
          "1",
          "1",
          "1",
          "1",
          "1",
          "1"
         ],
         "dataType": 1,
         "floatData": [
          5.6286273,
          2.72943282,
          2.00279093,
          0.158744112,
          0.0901121497,
          -2.69668484,
          -0.179233074,
          -0.0345109031,
          2.12081575
         ],
         "int32Data": [],
         "stringData": [],
         "int64Data": [],
         "name": "9",
         "docString": "",
         "rawData": "",
         "externalData": [],
         "dataLocation": "DEFAULT",
         "doubleData": [],
         "uint64Data": []
        }
       ],
       "sparseInitializer": [],
       "docString": "",
       "input": [
        {
         "name": "6",
         "type": {
          "tensorType": {
           "elemType": 1,
           "shape": {
            "dim": [
             {
              "denotation": "",
              "dimValue": "9"
             },
             {
              "denotation": "",
              "dimValue": "1"
             },
             {
              "denotation": "",
              "dimValue": "1"
             },
             {
              "denotation": "",
              "dimValue": "1"
             },
             {
              "denotation": "",
              "dimValue": "1"
             },
             {
              "denotation": "",
              "dimValue": "1"
             },
             {
              "denotation": "",
              "dimValue": "1"
             },
             {
              "denotation": "",
              "dimValue": "1"
             }
            ]
           }
          },
          "denotation": ""
         },
         "docString": ""
        }
       ],
       "output": [
        {
         "name": "11",
         "type": {
          "tensorType": {
           "elemType": 0,
           "shape": {
            "dim": [
             {
              "denotation": "",
              "dimValue": "9"
             },
             {
              "denotation": "",
              "dimValue": "1"
             },
             {
              "denotation": "",
              "dimValue": "1"
             },
             {
              "denotation": "",
              "dimValue": "1"
             },
             {
              "denotation": "",
              "dimValue": "1"
             },
             {
              "denotation": "",
              "dimValue": "1"
             },
             {
              "denotation": "",
              "dimValue": "1"
             },
             {
              "denotation": "",
              "dimValue": "1"
             }
            ]
           }
          },
          "denotation": ""
         },
         "docString": ""
        }
       ],
       "valueInfo": [],
       "quantizationAnnotation": [
        {
         "tensorName": "7",
         "quantParameterTensorNames": [
          {
           "key": "TENSOR_NAME",
           "value": "weight"
          },
          {
           "key": "LEAF_USAGE",
           "value": "variable"
          }
         ]
        },
        {
         "tensorName": "9",
         "quantParameterTensorNames": [
          {
           "key": "TENSOR_NAME",
           "value": "bias"
          },
          {
           "key": "LEAF_USAGE",
           "value": "variable"
          }
         ]
        }
       ]
      },
      "floats": [],
      "ints": [],
      "strings": [],
      "tensors": [],
      "graphs": [],
      "sparseTensors": []
     }
    ],
    "docString": ""
   },
   {
    "input": [
     "11"
    ],
    "output": [
     "_r0"
    ],
    "name": "_r0",
    "opType": "SIGMOID",
    "domain": "",
    "attribute": [],
    "docString": ""
   }
  ],
  "name": "",
  "initializer": [
   {
    "dims": [
     "10",
     "1",
     "1",
     "1",
     "1",
     "1",
     "1",
     "1"
    ],
    "dataType": 1,
    "floatData": [
     0,
     0,
     0,
     0,
     0,
     0,
     0,
     0,
     0,
     0
    ],
    "int32Data": [],
    "stringData": [],
    "int64Data": [],
    "name": "_i0",
    "docString": "",
    "rawData": "",
    "externalData": [],
    "dataLocation": "DEFAULT",
    "doubleData": [],
    "uint64Data": []
   }
  ],
  "sparseInitializer": [],
  "docString": "",
  "input": [],
  "output": [
   {
    "name": "_r0",
    "type": {
     "tensorType": {
      "elemType": 0,
      "shape": {
       "dim": [
        {
         "denotation": "",
         "dimValue": "9"
        },
        {
         "denotation": "",
         "dimValue": "1"
        },
        {
         "denotation": "",
         "dimValue": "1"
        },
        {
         "denotation": "",
         "dimValue": "1"
        },
        {
         "denotation": "",
         "dimValue": "1"
        },
        {
         "denotation": "",
         "dimValue": "1"
        },
        {
         "denotation": "",
         "dimValue": "1"
        },
        {
         "denotation": "",
         "dimValue": "1"
        }
       ]
      }
     },
     "denotation": ""
    },
    "docString": ""
   }
  ],
  "valueInfo": [],
  "quantizationAnnotation": [
   {
    "tensorName": "_i0",
    "quantParameterTensorNames": [
     {
      "key": "TENSOR_NAME",
      "value": "input"
     },
     {
      "key": "LEAF_USAGE",
      "value": "variable"
     }
    ]
   }
  ]
 },
 "metadataProps": []
}
