{
 "irVersion": "6",
 "opsetImport": [],
 "producerName": "tenncor",
 "producerVersion": "1.0.0",
 "domain": "com.tenncor.eteq",
 "modelVersion": "6",
 "docString": "",
 "graph": {
  "node": [
   {
    "input": [
     "0"
    ],
    "output": [
     "100"
    ],
    "name": "100",
    "opType": "_GRU_LAYER",
    "domain": "",
    "attribute": [
     {
      "name": "layer",
      "refAttrName": "",
      "docString": "",
      "type": "GRAPH",
      "f": 0,
      "i": "0",
      "s": "",
      "g": {
       "node": [
        {
         "input": [
          "0"
         ],
         "output": [
          "2"
         ],
         "name": "2",
         "opType": "SLICE",
         "domain": "",
         "attribute": [
          {
           "name": "dimension_pairs",
           "refAttrName": "",
           "docString": "",
           "type": "INTS",
           "f": 0,
           "i": "0",
           "s": "",
           "floats": [],
           "ints": [
            "0",
            "65535",
            "0",
            "1",
            "0",
            "65535",
            "0",
            "65535",
            "0",
            "65535",
            "0",
            "65535",
            "0",
            "65535",
            "0",
            "65535"
           ],
           "strings": [],
           "tensors": [],
           "graphs": [],
           "sparseTensors": []
          }
         ],
         "docString": ""
        },
        {
         "input": [
          "2",
          "3"
         ],
         "output": [
          "4"
         ],
         "name": "4",
         "opType": "CONCAT",
         "domain": "",
         "attribute": [
          {
           "name": "rank",
           "refAttrName": "",
           "docString": "",
           "type": "INT",
           "f": 0,
           "i": "0",
           "s": "",
           "floats": [],
           "ints": [],
           "strings": [],
           "tensors": [],
           "graphs": [],
           "sparseTensors": []
          }
         ],
         "docString": ""
        },
        {
         "input": [
          "4"
         ],
         "output": [
          "12"
         ],
         "name": "12",
         "opType": "_DENSE_LAYER",
         "domain": "",
         "attribute": [
          {
           "name": "layer",
           "refAttrName": "",
           "docString": "",
           "type": "GRAPH",
           "f": 0,
           "i": "0",
           "s": "",
           "g": {
            "node": [
             {
              "input": [
               "0"
              ],
              "output": [
               "5"
              ],
              "name": "5",
              "opType": "SLICE",
              "domain": "",
              "attribute": [
               {
                "name": "dimension_pairs",
                "refAttrName": "",
                "docString": "",
                "type": "INTS",
                "f": 0,
                "i": "0",
                "s": "",
                "floats": [],
                "ints": [
                 "0",
                 "65535",
                 "0",
                 "1",
                 "0",
                 "65535",
                 "0",
                 "65535",
                 "0",
                 "65535",
                 "0",
                 "65535",
                 "0",
                 "65535",
                 "0",
                 "65535"
                ],
                "strings": [],
                "tensors": [],
                "graphs": [],
                "sparseTensors": []
               }
              ],
              "docString": ""
             },
             {
              "input": [
               "5",
               "3"
              ],
              "output": [
               "6"
              ],
              "name": "6",
              "opType": "CONCAT",
              "domain": "",
              "attribute": [
               {
                "name": "rank",
                "refAttrName": "",
                "docString": "",
                "type": "INT",
                "f": 0,
                "i": "0",
                "s": "",
                "floats": [],
                "ints": [],
                "strings": [],
                "tensors": [],
                "graphs": [],
                "sparseTensors": []
               }
              ],
              "docString": ""
             },
             {
              "input": [
               "6",
               "7"
              ],
              "output": [
               "8"
              ],
              "name": "8",
              "opType": "MATMUL",
              "domain": "",
              "attribute": [
               {
                "name": "rank_pairs",
                "refAttrName": "",
                "docString": "",
                "type": "INTS",
                "f": 0,
                "i": "0",
                "s": "",
                "floats": [],
                "ints": [
                 "0",
                 "1"
                ],
                "strings": [],
                "tensors": [],
                "graphs": [],
                "sparseTensors": []
               }
              ],
              "docString": ""
             },
             {
              "input": [
               "9"
              ],
              "output": [
               "10"
              ],
              "name": "10",
              "opType": "EXTEND",
              "domain": "",
              "attribute": [
               {
                "name": "tensor",
                "refAttrName": "",
                "docString": "",
                "type": "TENSOR",
                "f": 0,
                "i": "0",
                "s": "",
                "t": {
                 "dims": [],
                 "dataType": 0,
                 "floatData": [],
                 "int32Data": [],
                 "stringData": [],
                 "int64Data": [],
                 "name": "8",
                 "docString": "",
                 "rawData": "",
                 "externalData": [],
                 "dataLocation": "DEFAULT",
                 "doubleData": [],
                 "uint64Data": []
                },
                "floats": [],
                "ints": [],
                "strings": [],
                "tensors": [],
                "graphs": [],
                "sparseTensors": []
               }
              ],
              "docString": ""
             },
             {
              "input": [
               "8",
               "10"
              ],
              "output": [
               "11"
              ],
              "name": "11",
              "opType": "ADD",
              "domain": "",
              "attribute": [],
              "docString": ""
             },
             {
              "input": [
               "11"
              ],
              "output": [
               "12"
              ],
              "name": "12",
              "opType": "IDENTITY",
              "domain": "",
              "attribute": [],
              "docString": ""
             }
            ],
            "name": "",
            "initializer": [
             {
              "dims": [
               "100",
               "150",
               "1",
               "1",
               "1",
               "1",
               "1",
               "1"
              ],
              "dataType": 1,
              "floatData": [
               -0.126638472,
               -0.129044473,
               0.0315728597,
               0.122922897,
               0.145114943,
               -0.0956112817,
               0.00599255227,
               -0.0320520215,
               -0.073175855,
               0.0758422613,
               -0.125764236,
               0.0189800058,
               0.0258503705,
               0.0961115,
               0.0285357181,
               0.0032790394,
               0.116572231,
               0.153260022,
               0.0699384362,
               0.144324273,
               -0.0629644319,
               -0.0233559757,
               0.122827128,
               0.0472940803,
               0.124965221,
               0.143285379,
               -0.103663795,
               0.110873111,
               0.126033053,
               -0.0642976314,
               0.134885356,
               -0.0266278,
               -0.059706755,
               0.00500881393,
               -0.0325628407,
               0.0891941562,
               0.0577568822,
               0.0136504658,
               0.0289025158,
               -0.126237556,
               0.0337914713,
               -0.0211306158,
               0.0310466979,
               0.106798053,
               -0.00217875605,
               0.0851458758,
               -0.132945731,
               -0.0954473838,
               -0.0853250474,
               0.0873986706,
               -0.128957719,
               -0.0984391,
               0.0359829701,
               0.0221020132,
               0.0741382465,
               -0.0574755706,
               -0.0194662977,
               -0.0270695575,
               0.127881154,
               0.152646959,
               0.0239589773,
               -0.104449876,
               0.0627561659,
               -0.0512170978,
               -0.0136703718,
               -0.130496383,
               -0.114435934,
               -0.100176156,
               -0.0180909093,
               -0.143306613,
               0.00119084609,
               -0.0101607591,
               0.0262195729,
               0.0558249131,
               -0.12567687,
               -0.134332985,
               0.10269779,
               -0.0340853184,
               -0.0958488584,
               -0.102520227,
               0.142352268,
               0.152350977,
               -0.120152459,
               0.115424946,
               0.0367579907,
               0.0542527847,
               0.0353115276,
               0.0273079611,
               -0.10828419,
               -0.0752921104,
               0.0945575461,
               0.0294886511,
               0.124631263,
               -0.0717072859,
               -0.0928024873,
               -0.070816122,
               -0.0322966315,
               -0.125154629,
               0.0462489389,
               0.0408891514,
               -0.190363452,
               -0.10861364,
               -0.127271786,
               0.141270816,
               0.0128138717,
               -0.141055182,
               0.0161007084,
               0.0729020089,
               -0.00452607451,
               -0.0102829281,
               -0.151321888,
               -0.0856368169,
               -0.0916025043,
               0.0221879501,
               -0.119179085,
               0.0322038308,
               -0.102385387,
               0.0595093705,
               -0.0799224526,
               0.0493989624,
               -0.14220041,
               -0.101569235,
               -0.0426314659,
               0.0785730705,
               -0.0318425149,
               0.101225704,
               0.0199250672,
               0.0771170929,
               0.0583100021,
               -0.0570985042,
               0.101204082,
               0.0101075601,
               0.0866253749,
               -0.10909421,
               0.0263359752,
               0.0905136317,
               0.139936298,
               0.127523556,
               0.0881179497,
               0.0907910839,
               0.0222931951,
               -0.151830167,
               -0.107144944,
               0.00123730267,
               0.0810480416,
               -0.062308915,
               0.032452926,
               0.0186643098,
               0.10813982,
               0.0021154033,
               0.127079457,
               -0.0579483509,
               0.0908225402,
               0.147091553,
               -0.135245115,
               0.14351818,
               -0.0862344652,
               -0.0157512426,
               0.037478745,
               -0.0605573319,
               0.129401267,
               -0.137913302,
               -0.0796844289,
               0.0935174599,
               -0.0196952038,
               0.150706813,
               0.0349518955,
               -0.138013318,
               0.105485953,
               -0.0805946141,
               0.0158884209,
               -0.122496247,
               0.140684709,
               0.0118492031,
               -0.0992663354,
               0.00681112194,
               0.102884248,
               -0.0522787683,
               -0.0186126549,
               -0.0556352027,
               0.0648580119,
               0.148082361,
               -0.0918991342,
               0.0732041597,
               -0.0438813679,
               0.142212018,
               -0.144297719,
               -0.139266893,
               0.118736468,
               0.0225039516,
               0.152330816,
               -0.135269195,
               -0.132179365,
               0.0955693573,
               -0.116963625,
               0.148563117,
               -0.0603686534,
               -0.084892042,
               0.098943226,
               -0.02919502,
               0.125247672,
               0.0364957601,
               0.150079235,
               0.0809305906,
               -0.0964224339,
               0.129529968,
               0.0531463958,
               -0.143871188,
               0.00572277838,
               0.102961719,
               0.0743639469,
               0.12539579,
               0.075721696,
               -0.100124963,
               -0.0557528138,
               0.0202603564,
               -0.10106355,
               -0.0535538122,
               0.0512160547,
               -0.0329218097,
               -0.0771102384,
               -0.0116110705,
               -0.0350918882,
               -0.098286584,
               0.014632334,
               -0.0747777075,
               0.0833558738,
               0.0340208635,
               0.098786138,
               -0.0944315,
               -0.0207089316,
               -0.111434899,
               -0.0513805635,
               0.0529266149,
               0.126465857,
               0.0928326398,
               -0.0623267032,
               -0.106403694,
               -0.0777239427,
               -0.00901821256,
               -0.0619258322,
               -0.0756291151,
               -0.0744861364,
               0.153027698,
               -0.0622485429,
               0.0622545443,
               0.126962781,
               0.107645676,
               -0.00589172263,
               -0.13255915,
               -0.122579806,
               -0.0951029435,
               0.0636905059,
               -0.155018672,
               -0.0783399493,
               -0.0186285768,
               -0.00335594732,
               -0.0339131467,
               -0.148205116,
               -0.112732857,
               -0.0619201884,
               -0.0780389905,
               0.04423365,
               -0.0120524736,
               0.106459871,
               0.0622795857,
               0.137450933,
               -0.0900545716,
               -0.099569723,
               -0.0984085575,
               0.141439453,
               -0.0327855945,
               0.0742275715,
               -0.108734772,
               0.0931232199,
               0.0667390749,
               -0.0892503411,
               -0.00822723471,
               0.140874282,
               -0.0414265469,
               0.0263207387,
               -0.154716909,
               0.142952293,
               0.14713721,
               0.0481737517,
               -0.0788236111,
               -0.0292934962,
               0.0482738316,
               0.0729426891,
               0.136879265,
               -0.0230200067,
               0.0305946954,
               0.132211164,
               0.12431141,
               -0.117774785,
               -0.0517587028,
               -0.0443019532,
               -0.0607017651,
               -0.00744524272,
               0.0543244705,
               -0.065830037,
               -0.0162618514,
               0.0155187724,
               -0.0271920227,
               -0.0307599884,
               0.0371130407,
               -0.0886834338,
               0.0746265575,
               -0.147639766,
               -0.139988065,
               -0.0361477472,
               0.0547581688,
               0.143029511,
               -0.149073258,
               -0.0209724661,
               0.0103581185,
               -0.0655695274,
               0.136648789,
               0.0269400161,
               -0.0374855734,
               0.0260460339,
               -0.00264540873,
               -0.05651078,
               0.0540376566,
               -0.101828441,
               0.0881770402,
               0.0150702186,
               0.122789331,
               0.126841441,
               0.0698626935,
               0.0761454701,
               -0.0554410368,
               0.098873876,
               -0.109385923,
               0.0728429258,
               -0.0822346434,
               -0.140233517,
               -0.0897062272,
               0.0735562071,
               -0.088801153,
               0.0184297077,
               0.0235699154,
               -0.103087,
               0.0789627135,
               -0.0991771,
               0.0904197,
               -0.0234825723,
               -0.113566682,
               -0.0942435563,
               -0.0370375551,
               0.136523589,
               -0.0392455533,
               0.0343246087,
               -0.063346304,
               0.0271898396,
               0.045308888,
               -0.126342043,
               0.100098677,
               -0.00681775715,
               0.0875977129,
               0.13636601,
               0.00721587241,
               -0.0324771963,
               -0.0901097357,
               -0.0409869365,
               0.0425657369,
               -0.120829687,
               0.0437495857,
               0.0194457248,
               0.0741486773,
               0.0534973629,
               0.0557757057,
               -0.0329984464,
               -0.0286565665,
               0.0710011572,
               -0.152948812,
               -0.145864338,
               -0.0736059397,
               -0.117451347,
               0.113924958,
               -0.0431664586,
               0.0454454608,
               -0.085119307,
               0.038940832,
               -0.0410399362,
               0.0393408947,
               -0.0587101,
               0.027276177,
               0.14346081,
               0.145803735,
               -0.0974443,
               0.0363809839,
               -0.140653014,
               -0.0113480957,
               -0.0479029454,
               0.0377367623,
               -0.126190722,
               -0.105624601,
               -0.108619884,
               -0.111269616,
               -0.0272111166,
               0.112719633,
               0.129844651,
               -0.123732224,
               0.0683011785,
               -0.0138018122,
               -0.0212180838,
               -0.0541061573,
               -0.101896979,
               0.00467782328,
               0.0430535041,
               -0.113319889,
               -0.0225884821,
               -0.133268103,
               0.0871643573,
               -0.145909294,
               0.0261064637,
               0.149010211,
               0.113133393,
               0.141337201,
               -0.0433718339,
               -0.154544681,
               -0.0557934754,
               -0.0370733216,
               0.140020877,
               -0.0289153922,
               -0.0272240154,
               -0.0931998491,
               -0.142714515,
               -0.0451510139,
               0.101771556,
               0.0727045834,
               -0.0693138689,
               0.0389116034,
               0.106621161,
               -0.0445413589,
               0.00618670601,
               -0.118852772,
               -0.108438976,
               0.049410522,
               -0.109518148,
               0.109268688,
               -0.0721370503,
               -0.102140255,
               -0.136737421,
               -0.0986325741,
               0.115155563,
               0.0414646938,
               -0.0132967429,
               -0.00572633883,
               0.0573356077,
               -0.0208382513,
               -0.120592982,
               0.0771485269,
               -0.0774958208,
               -0.146094218,
               0.0632056743,
               -0.129395425,
               -0.0286257584,
               0.0336260311,
               0.0643203259,
               0.0466135517,
               0.154223427,
               0.109696105,
               -0.0704351738,
               -0.0686595514,
               -0.12117707,
               0.0473677292,
               -0.095481,
               -0.132785037,
               -0.0982156619,
               -0.110835806,
               -0.0773462206,
               -0.115086593,
               -0.115399621,
               0.138169885,
               0.0727520958,
               0.135437757,
               -0.114561848,
               0.130221814,
               -0.0133744851,
               -0.119438902,
               0.0954064,
               0.0721777529,
               0.0248251781,
               0.0748429671,
               0.0790695846,
               -0.000460367,
               -0.0839272365,
               0.0585315339,
               -0.0748155564,
               0.0718124881,
               -0.0519804135,
               0.125530615,
               0.132552937,
               0.118907094,
               -0.151051611,
               0.094573237,
               0.11108838,
               0.113538042,
               -0.02784173,
               -0.0253597721,
               0.12832287,
               -0.00444106385,
               0.135616019,
               0.0846399814,
               0.109660603,
               -0.0882657766,
               0.123791352,
               -0.149840131,
               -0.0560810231,
               0.123607323,
               0.0859683231,
               0.0289728101,
               0.0328061879,
               -0.128686979,
               0.0584061593,
               -0.104190454,
               -0.0154223079,
               -0.0659454912,
               -0.0708111599,
               0.150686353,
               0.0564060062,
               0.131933,
               -0.00450741453,
               0.105410174,
               0.0370111726,
               0.102408133,
               0.0331912041,
               -0.0988012105,
               0.0692159683,
               0.0486717075,
               -0.0593823902,
               -0.0857895762,
               0.0662872,
               -0.0347048454,
               0.0745562539,
               0.0617650598,
               -0.0708813369,
               -0.138580501,
               -0.0446045175,
               0.111429177,
               -0.0430612527,
               0.0536423437,
               -0.0288816504,
               0.0537313037,
               -0.14751865,
               -0.151573166,
               0.0150161497,
               -0.140313044,
               -0.0576164238,
               0.0510861762,
               -0.0203268323,
               0.13397193,
               -0.0821560547,
               -0.0599197671,
               0.0363009,
               0.14013432,
               0.089802064,
               -0.121089853,
               -0.147857651,
               0.133894011,
               -0.0339722894,
               -0.0388971381,
               0.0410218537,
               -0.10787601,
               0.0836276188,
               -0.0787004456,
               0.0540367216,
               -0.0329428837,
               -0.144304559,
               -0.106506199,
               -0.00676804222,
               -0.0341414921,
               -0.104447797,
               0.147266716,
               0.0679648444,
               0.101181962,
               0.104739308,
               -0.0550944172,
               -0.134323195,
               -0.0972279906,
               -0.0496321358,
               -0.00833433121,
               0.0268745162,
               0.107469812,
               -0.0645423084,
               -0.0483736731,
               -0.118540034,
               0.0518356301,
               -0.0360349156,
               -0.0196207371,
               -0.0782388672,
               -0.0343716852,
               0.144299418,
               0.0814920962,
               -0.0425023809,
               0.0911174,
               0.0384146571,
               0.136281759,
               -0.162731409,
               0.00481611537,
               0.0519177,
               0.144929901,
               -0.0982214,
               -0.0944244862,
               0.127628833,
               -0.0531216264,
               -0.0464516431,
               0.0129738469,
               0.0818358958,
               0.124107152,
               -0.0603155792,
               -0.0922683552,
               0.0236469321,
               -0.00683229882,
               0.0633887276,
               0.0939139,
               -0.035185311,
               0.10018608,
               -0.147506192,
               -0.0657333136,
               0.109570265,
               0.13826327,
               -0.067275025,
               -0.111911356,
               -0.0649596527,
               0.0672779456,
               -0.0604496486,
               0.0824312717,
               0.147943944,
               -0.0870217532,
               -0.103884637,
               -0.104584165,
               -0.0396798588,
               -0.120853938,
               -0.0862376094,
               0.120577194,
               -0.147562519,
               0.0468331389,
               -0.0308845751,
               0.130217433,
               0.0909374133,
               0.133124813,
               -0.0534137562,
               -0.00400863169,
               0.0222573448,
               0.0213800911,
               -0.011355537,
               -0.109006472,
               -0.0528612509,
               0.074238494,
               -0.0567253493,
               0.119423814,
               -0.0545065515,
               -0.0358549245,
               0.109774031,
               -0.142783985,
               0.0167315975,
               -0.0766517,
               0.126118317,
               0.102244437,
               0.051791586,
               0.0821878314,
               0.148982763,
               -0.00850398466,
               -0.0459461026,
               0.131759137,
               0.134766549,
               -0.0295429174,
               0.125605479,
               0.12140695,
               -0.00883166865,
               0.0351046734,
               -0.139523521,
               -0.0621637739,
               -0.139135048,
               -0.0271172542,
               -0.140127495,
               0.0669893,
               0.0591524,
               0.0335590169,
               0.116954483,
               -0.00568139926,
               -0.152203858,
               -0.0603746735,
               0.0867002681,
               -0.104774848,
               0.122214697,
               -0.0124970451,
               0.151132226,
               -0.0678744316,
               0.117233798,
               0.112256512,
               -0.0829501823,
               -0.0184566,
               0.0438103601,
               0.0706534833,
               -0.1092484,
               0.101491921,
               -0.00853474531,
               -0.147651955,
               -0.112104625,
               -0.0889786258,
               -0.098298274,
               0.0236011539,
               0.11885538,
               -0.104755819,
               0.0256754458,
               -0.0289119091,
               -0.0178845506,
               -0.0815125555,
               -0.080128327,
               -0.00449911598,
               -0.0561320968,
               0.0423105322,
               0.130556464,
               0.0665730536,
               -0.135829046,
               0.00896410178,
               -0.144363269,
               -0.127111271,
               -0.123827972,
               0.0416772477,
               0.0390562788,
               0.0486688837,
               0.0616144873,
               -0.130672425,
               0.0268639475,
               -0.108571455,
               0.0221016202,
               0.0363987833,
               -0.0648357,
               0.0112484572,
               -0.139827594,
               -0.0829169452,
               -0.0234809909,
               -0.0220905505,
               -0.0714020133,
               -0.0646933,
               0.0599358939,
               0.13381426,
               0.0349255763,
               0.0384233221,
               -0.129768059,
               0.00974797364,
               -0.116492674,
               0.0627691,
               0.114203632,
               -0.00109375839,
               0.101354793,
               0.130990505,
               -0.10691262,
               0.0703926533,
               -0.00723877968,
               0.143289566,
               -0.108102567,
               0.102968924,
               0.122999199,
               -0.118129522,
               0.0954549685,
               0.0156698525,
               0.0255396497,
               0.0489074551,
               0.0398849249,
               0.126187354,
               -0.0870326236,
               0.0836042836,
               0.0289432947,
               0.14866206,
               0.0893668681,
               0.000175679728,
               -0.11001768,
               -0.0168370027,
               0.0980903432,
               0.116999149,
               0.0644475296,
               -0.142988399,
               -0.00706472062,
               -0.13573581,
               -0.00870017707,
               0.01843917,
               0.107846,
               -0.0926402,
               -0.000309465831,
               0.0161268916,
               -0.0701049268,
               0.0485892855,
               0.0600007698,
               -0.0937553719,
               0.0904763117,
               -0.0607024245,
               0.14537406,
               0.00414878922,
               -0.137596413,
               0.067533426,
               0.00427355,
               -0.0372687839,
               -0.000294315309,
               0.0353298336,
               0.0416760631,
               -0.0671853647,
               -0.122893259,
               0.0796131,
               0.0153308986,
               0.00458039902,
               -0.0880469754,
               0.0239796601,
               -0.0455701873,
               0.14642176,
               0.102751464,
               0.144038752,
               0.120035551,
               0.0699645579,
               -0.0772014856,
               -0.146340266,
               -0.0996272787,
               0.0807070509,
               -0.0512177087,
               0.0635061339,
               -0.0492124632,
               -0.00666918233,
               -0.14417395,
               -0.0720327497,
               -0.046685949,
               -0.0728258342,
               0.111814439,
               0.0396993719,
               -0.0523835048,
               0.134321392,
               0.0213030577,
               0.0125997737,
               -0.0486542918,
               0.0437410697,
               0.107553087,
               -0.0347892568,
               0.0558462515,
               -0.0904024839,
               -0.0550339967,
               0.138533771,
               0.0152381295,
               0.128491044,
               -0.134445369,
               -0.0492551923,
               0.0155244125,
               -0.0681125447,
               0.0586382337,
               -0.142645016,
               0.153299078,
               0.0471977517,
               0.071169354,
               0.0603928752,
               -0.0128200501,
               0.140225515,
               0.0372305922,
               0.0561408103,
               -0.0224440806,
               0.11389783,
               -0.0155529976,
               0.108158402,
               0.0900105685,
               0.0831260458,
               0.157079369,
               -0.137153745,
               0.0735637099,
               -0.121541455,
               0.0738576129,
               -0.026490951,
               0.0934381336,
               0.0149328969,
               -0.133237168,
               0.108739801,
               0.0847847685,
               -0.139490977,
               0.114920989,
               0.144729272,
               -0.155364692,
               0.0900920108,
               0.0267328564,
               0.0124317044,
               0.0318610966,
               -0.0580037348,
               0.040052,
               -0.0376624204,
               0.0512592718,
               0.119946972,
               -0.140842527,
               0.145922646,
               -0.096438922,
               0.0726181343,
               -0.0248756837,
               -0.15352717,
               0.0689293668,
               -0.0146912625,
               -0.148830295,
               0.13590619,
               0.0589716844,
               -0.0298646204,
               0.0775669962,
               -0.0478224307,
               -0.0355479233,
               -0.0802539289,
               -0.132890522,
               0.0826088414,
               0.0801856518,
               0.0678526685,
               -0.0826788396,
               0.00407926086,
               -0.137755588,
               0.14650549,
               0.00446457,
               0.113246255,
               -0.130282015,
               -0.0796832219,
               0.046828866,
               0.0778928846,
               -0.15343447,
               -0.146058872,
               -0.109233811,
               0.143575519,
               -0.152991727,
               0.045767393,
               -0.0117270555,
               0.0267641414,
               -0.104985073,
               -0.0682583749,
               0.0861009657,
               -0.0172481649,
               0.0987119153,
               0.112485185,
               0.143551737,
               0.0829453617,
               0.0727690384,
               -0.070312418,
               0.0996124819,
               -0.137452215,
               -0.0473204665,
               -0.087999396,
               -0.149611667,
               0.0639869347,
               0.000100547637,
               -0.0646483079,
               -0.0936039537,
               -0.0132984845,
               0.02249863,
               -0.114390269,
               -0.0537000559,
               0.107918739,
               -0.0632353872,
               -0.0769603178,
               -0.0629477575,
               -0.0654489622,
               0.0434218496,
               -0.108660765,
               0.0924551263,
               -0.150507405,
               0.0901717469,
               0.0706295744,
               0.0140916239,
               -0.0381109975,
               -0.0894239619,
               -0.121412799,
               0.0222023595,
               0.0301841516,
               -0.015377108,
               0.0125057986,
               0.014877744,
               0.0529758371,
               0.0693606809,
               -0.01047647,
               0.0880794153,
               -0.0468077548,
               -0.0647029504,
               0.0414651595,
               0.0171663985,
               0.0855813399,
               0.150906786,
               -0.0703702196,
               -0.135168254,
               0.116763942,
               -0.150415137,
               0.0875130817,
               -0.00265675061,
               0.0123560354,
               0.133599177,
               0.139738485,
               -0.131465644,
               -0.00934753567,
               0.15130496,
               0.0373519287,
               0.142798468,
               0.118962303,
               0.0448504612,
               -0.0081293,
               -0.141147897,
               -0.136069968,
               0.0673609227,
               -0.0984963775,
               0.0818958059,
               -0.0933555,
               -0.134505853,
               0.143890306,
               0.0562479049,
               0.0799578428,
               -0.129965603,
               0.0958680809,
               0.0323604569,
               -0.0699391589,
               0.0725824833,
               0.0790246651,
               -0.144987822,
               0.055547,
               0.0855532438,
               -0.122717269,
               -0.139336556,
               -0.043383237,
               0.0108832242,
               -0.133487254,
               -0.0683470219,
               0.143945843,
               0.038520176,
               0.000493088271,
               -0.131912455,
               0.0608834401,
               0.018146446,
               -0.0806351155,
               0.0738113895,
               -0.0243249647,
               0.0939978361,
               -0.101060435,
               0.0638770461,
               0.0614549071,
               -0.13486217,
               -0.100688465,
               -0.0982160196,
               -0.128740847,
               -0.00772211375,
               0.113541491,
               0.101411685,
               -0.102440774,
               0.0551591329,
               -0.110513546,
               0.0712791681,
               0.0278681107,
               0.120521761,
               0.10025958,
               -0.0172858536,
               -0.0460699238,
               -0.104425885,
               0.0398104638,
               -0.0832788721,
               0.100425519,
               -0.109504335,
               -0.00370020396,
               -0.103582188,
               -0.102930173,
               -0.0765292868,
               -0.128354371,
               0.0183417816,
               -0.101887882,
               -0.113659531,
               -0.107398666,
               -0.118795872,
               0.105480567,
               -0.0883068293,
               -0.0714475662,
               -0.0802444369,
               -0.0163784437,
               0.0442826897,
               0.0606737137,
               -0.0252698585,
               0.0969304293,
               -0.136216238,
               -0.110041589,
               0.150103599,
               -0.0783209279,
               0.0246394277,
               -0.128836825,
               0.0933804587,
               0.139520451,
               0.151002631,
               -0.0965998322,
               -0.0178149808,
               -0.00557174254,
               -0.130653962,
               -0.0660063848,
               -0.0663800761,
               0.0501705334,
               -0.0498696454,
               0.121250868,
               0.146480277,
               -0.0471304096,
               0.140801862,
               -0.0472537391,
               0.117258817,
               -0.153115571,
               0.0897175446,
               -0.0804366544,
               0.0124031967,
               0.125078544,
               -0.0680588186,
               -0.0898367,
               0.0720408559,
               -0.129764453,
               0.035270229,
               -0.151468903,
               0.11385648,
               0.098541595,
               0.133802533,
               0.0661945045,
               -0.0295643,
               0.0398812704,
               0.0878747553,
               0.029994,
               0.0113597894,
               -0.00767131057,
               -0.138607576,
               0.00820358563,
               0.136338785,
               -0.0367371514,
               0.028659761,
               -0.131928533,
               -0.109771281,
               -0.0590756945,
               -0.101766899,
               0.132090583,
               0.00194856361,
               -0.0569620244,
               0.115537554,
               0.0748168677,
               -0.0950051546,
               0.0410165377,
               -0.0823382586,
               -0.150193572,
               0.134472221,
               -0.0994275138,
               -0.108222924,
               -0.0812714249,
               0.0438823141,
               0.118076779,
               -0.0964817256,
               -0.0335719,
               -0.140475273,
               0.102810048,
               -0.142414704,
               0.150715232,
               -0.0967655182,
               -0.152819112,
               0.0564837158,
               -0.0502972975,
               0.0748668611,
               -0.0365407765,
               -0.0508494303,
               0.0443142839,
               -0.103903748,
               -0.119443811,
               0.0553630255,
               -0.094717,
               0.154986441,
               -0.0528818741,
               -0.0392586328,
               0.0808404088,
               0.0630055815,
               0.0808835626,
               -0.0577112064,
               0.0410154276,
               0.0155214388,
               0.154771537,
               0.117083319,
               0.102385379,
               0.115493238,
               -0.0211255178,
               0.0131165385,
               -0.142208815,
               -0.130579218,
               0.0211943854,
               0.154597715,
               -0.135956585,
               -0.144102275,
               0.150613815,
               0.146335542,
               -0.0172008835,
               -0.153091773,
               -0.0255791843,
               -0.123080082,
               -0.126668632,
               -0.0588209964,
               0.032257013,
               0.117404297,
               0.00751789613,
               -0.137289926,
               0.00308329845,
               0.00330197113,
               -0.134671107,
               -0.0952540413,
               -0.0092940256,
               0.132338166,
               -0.0920923799,
               0.00286700553,
               -0.120173,
               0.0484788,
               0.112585887,
               -0.138488,
               -0.00782750454,
               -0.115210384,
               0.134694204,
               -0.0636585802,
               -0.129334554,
               0.115239948,
               -0.058460921,
               -0.0532026701,
               0.0602292642,
               -0.0105435029,
               0.066776149,
               0.104295038,
               -0.0258188918,
               0.100797877,
               0.0136601785,
               0.0365885384,
               0.00782787055,
               0.131856665,
               0.00864449423,
               0.0929250196,
               0.0924244151,
               -0.0631121099,
               -0.152224645,
               0.0372361317,
               -0.146227732,
               0.0617205873,
               -0.0804666653,
               0.110693753,
               0.130127668,
               0.00563875632,
               -0.0262427349,
               0.0898537189,
               -0.0356365629,
               -0.145264879,
               0.00868319813,
               0.132085949,
               0.0769302621,
               -0.108077675,
               0.117868401,
               0.00433752825,
               0.144198969,
               -0.0514103919,
               0.0287757013,
               -2.12410159e-05,
               -0.0716403052,
               -0.0773896873,
               0.0311448034,
               -0.109661482,
               0.0849696398,
               0.120841153,
               -0.0891387537,
               -0.0685708076,
               -0.0113951452,
               0.00296466961,
               0.00741876429,
               0.139667377,
               0.143494457,
               -0.113758191,
               -0.102461599,
               0.128634602,
               -0.154656366,
               0.031332586,
               -0.0939788744,
               -0.113460295,
               0.0288958102,
               -0.0553486757,
               0.0600878224,
               -0.0118152155,
               0.0934517533,
               0.138639435,
               0.071720548,
               0.137945697,
               0.0547214411,
               -0.00553313456,
               -0.0018952078,
               0.141373485,
               0.0171398893,
               0.0642431378,
               -0.0623451509,
               -0.146853209,
               0.103066958,
               -0.149520278,
               0.0822483,
               -0.10047666,
               -0.0765912607,
               -0.080990769,
               0.118801542,
               -0.0127171632,
               -0.0942054465,
               -0.0948429555,
               0.147148594,
               0.0557198524,
               -0.118002184,
               -0.0681592524,
               -0.00338291866,
               0.0481932536,
               -0.0941763222,
               -0.0269055981,
               0.0780802518,
               0.147811353,
               0.101638317,
               0.0566128679,
               -0.0888381526,
               0.121926583,
               0.00353982183,
               0.0839493945,
               0.0750991628,
               -0.143490717,
               -0.0522602759,
               -0.0246425401,
               -0.0196155403,
               0.0269603506,
               0.0481728651,
               0.0996003598,
               0.123415157,
               -0.132039726,
               -0.0322141536,
               0.0450225845,
               -0.00738094095,
               -0.135560989,
               0.100596897,
               -0.0859586895,
               -0.143172175,
               -0.0235515907,
               -0.143164665,
               -0.0829123855,
               -0.0948198289,
               -0.130795896,
               0.0925071463,
               0.11926192,
               -0.153269485,
               0.153898627,
               0.062410187,
               0.0440019965,
               -0.0154270194,
               0.114472285,
               0.153851941,
               0.0436821394,
               -0.122704558,
               -0.0294562969,
               0.0304469541,
               -0.112935826,
               -0.0806990191,
               0.000694127521,
               -0.0445844717,
               -0.0266321879,
               0.0219206605,
               0.104451418,
               0.0159812216,
               -0.0143270018,
               -0.00538829761,
               -0.0525117628,
               -0.123719387,
               0.138495237,
               -0.121125326,
               -0.0438952893,
               -0.0469824187,
               0.0847624466,
               0.0996958688,
               0.0863272697,
               0.11975503,
               -0.0820833668,
               0.0653550625,
               -0.0217003711,
               -0.0975402147,
               0.0599126555,
               0.108117484,
               0.0277743246,
               -0.0809471533,
               0.119304828,
               0.121706836,
               -0.146657154,
               0.0833448768,
               0.00317253056,
               0.140038878,
               -0.0606590025,
               0.00509926956,
               -0.100876249,
               -0.0230661,
               -0.152271062,
               -0.0729379058,
               0.0956821069,
               -0.0460377671,
               0.00137896219,
               -0.0145625696,
               0.0286361147,
               -0.102725938,
               0.113427587,
               -0.123348705,
               0.0126848528,
               -0.032723,
               -0.119346082,
               -0.0616133474,
               0.0832629427,
               0.126485094,
               0.0906605,
               -0.145369351,
               0.157873884,
               -0.102738991,
               0.151692852,
               -0.0551357493,
               -0.120645873,
               -0.128385305,
               -0.0426718295,
               -0.103410818,
               0.0437447019,
               0.132427603,
               0.0126545867,
               -0.0410832353,
               0.0695356652,
               -0.0630688444,
               -0.031908568,
               0.0169729497,
               0.0554278046,
               0.0170292277,
               -0.039964851,
               -0.1022892,
               -0.0227866396,
               0.0537589937,
               -0.0684161633,
               -0.134429842,
               0.0975462124,
               0.00174014061,
               -0.150466591,
               0.145825282,
               -0.0268047694,
               0.0984505564,
               -0.013906288,
               -0.0195844881,
               0.0761710852,
               -0.0804494619,
               -0.151438355,
               0.0143391164,
               0.0814879835,
               0.0339545049,
               0.0870997459,
               0.076254189,
               -0.0668167397,
               0.020517109,
               0.117075734,
               -0.0544287898,
               -0.133355334,
               -0.104272634,
               -0.139477655,
               0.0425728485,
               0.0549727716,
               -0.0873936117,
               0.109860629,
               -0.0907795206,
               0.0354073904,
               -0.0732023641,
               -0.0641398951,
               0.0812992,
               -0.0236947611,
               -0.0719277114,
               -0.00417379243,
               0.0346893221,
               -0.127017692,
               -0.0121428408,
               0.0255960468,
               0.116348669,
               0.0971199125,
               0.144621685,
