{
 "irVersion": "6",
 "opsetImport": [],
 "producerName": "tenncor",
 "producerVersion": "1.0.0",
 "domain": "com.tenncor.eteq",
 "modelVersion": "6",
 "docString": "",
 "graph": {
  "node": [
   {
    "input": [
     "_i0"
    ],
    "output": [
     "5"
    ],
    "name": "5",
    "opType": "_DENSE_LAYER",
    "domain": "",
    "attribute": [
     {
      "name": "layer",
      "refAttrName": "",
      "docString": "",
      "type": "GRAPH",
      "f": 0,
      "i": "0",
      "s": "",
      "g": {
       "node": [
        {
         "input": [
          "_i0",
          "1"
         ],
         "output": [
          "2"
         ],
         "name": "2",
         "opType": "MATMUL",
         "domain": "",
         "attribute": [
          {
           "name": "rank_pairs",
           "refAttrName": "",
           "docString": "",
           "type": "INTS",
           "f": 0,
           "i": "0",
           "s": "",
           "floats": [],
           "ints": [
            "0",
            "1"
           ],
           "strings": [],
           "tensors": [],
           "graphs": [],
           "sparseTensors": []
          }
         ],
         "docString": ""
        },
        {
         "input": [
          "3"
         ],
         "output": [
          "4"
         ],
         "name": "4",
         "opType": "EXTEND",
         "domain": "",
         "attribute": [
          {
           "name": "tensor",
           "refAttrName": "",
           "docString": "",
           "type": "TENSOR",
           "f": 0,
           "i": "0",
           "s": "",
           "t": {
            "dims": [],
            "dataType": 0,
            "floatData": [],
            "int32Data": [],
            "stringData": [],
            "int64Data": [],
            "name": "2",
            "docString": "",
            "rawData": "",
            "externalData": [],
            "dataLocation": "DEFAULT",
            "doubleData": [],
            "uint64Data": []
           },
           "floats": [],
           "ints": [],
           "strings": [],
           "tensors": [],
           "graphs": [],
           "sparseTensors": []
          }
         ],
         "docString": ""
        },
        {
         "input": [
          "2",
          "4"
         ],
         "output": [
          "5"
         ],
         "name": "5",
         "opType": "ADD",
         "domain": "",
         "attribute": [],
         "docString": ""
        }
       ],
       "name": "",
       "initializer": [
        {
         "dims": [
          "9",
          "10",
          "1",
          "1",
          "1",
          "1",
          "1",
          "1"
         ],
         "dataType": 1,
         "floatData": [
          -1.68477237,
          -1.16236281,
          -0.741113484,
          0.665652454,
          0.576570392,
          0.400643975,
          0.544850647,
          0.0283194743,
          -0.00290031731,
          -1.4093014,
          -1.30863214,
          -0.993467391,
          0.723049223,
          0.557505786,
          0.588048279,
          0.603414476,
          0.139188454,
          0.555843771,
          -0.133791745,
          1.41157842,
          -0.842857182,
          0.937734425,
          -0.70646739,
          -0.652252913,
          -0.403282195,
          0.529348671,
          -1.16332054,
          -0.222073659,
          1.07426846,
          -0.758880675,
          1.16188049,
          -0.822208047,
          -1.01993167,
          -0.456036061,
          0.58206,
          -0.558994293,
          0.440383554,
          -0.771935582,
          -0.51022917,
          -0.523692489,
          1.22244442,
          -0.417503297,
          -1.06179214,
          1.00030136,
          -0.657552779,
          0.545776367,
          -0.601957083,
          -0.418577075,
          -0.691364288,
          1.08119261,
          -0.59446162,
          -1.14024,
          1.00827396,
          -0.527522624,
          0.33568278,
          -0.538412631,
          -0.89162451,
          0.277479768,
          -0.744686782,
          1.7354573,
          -0.947779536,
          -0.234012172,
          0.283676237,
          0.227762192,
          -0.669078827,
          -1.00786889,
          -0.0636462942,
          -1.07118237,
          1.56978667,
          -1.23790777,
          -0.442315578,
          0.335841745,
          0.635185182,
          -0.0236003213,
          -0.529871047,
          0.635949314,
          0.940408945,
          -0.399331689,
          -0.20062381,
          -1.73099315,
          0.085476,
          1.07428217,
          -0.181848437,
          -0.0600687563,
          0.926985085,
          0.720592141,
          -0.160542652,
          -0.207200319,
          -1.52949846,
          -0.517253637
         ],
         "int32Data": [],
         "stringData": [],
         "int64Data": [],
         "name": "1",
         "docString": "",
         "rawData": "",
         "externalData": [],
         "dataLocation": "DEFAULT",
         "doubleData": [],
         "uint64Data": []
        },
        {
         "dims": [
          "9",
          "1",
          "1",
          "1",
          "1",
          "1",
          "1",
          "1"
         ],
         "dataType": 1,
         "floatData": [
          -0.282782942,
          1.89861059,
          2.62411857,
          -2.25665736,
          -0.752916098,
          -0.0123698823,
          1.92574632,
          0.2122996,
          -0.0706793815
         ],
         "int32Data": [],
         "stringData": [],
         "int64Data": [],
         "name": "3",
         "docString": "",
         "rawData": "",
         "externalData": [],
         "dataLocation": "DEFAULT",
         "doubleData": [],
         "uint64Data": []
        }
       ],
       "sparseInitializer": [],
       "docString": "",
       "input": [
        {
         "name": "_i0",
         "type": {
          "tensorType": {
           "elemType": 1,
           "shape": {
            "dim": [
             {
              "denotation": "",
              "dimValue": "10"
             },
             {
              "denotation": "",
              "dimValue": "1"
             },
             {
              "denotation": "",
              "dimValue": "1"
             },
             {
              "denotation": "",
              "dimValue": "1"
             },
             {
              "denotation": "",
              "dimValue": "1"
             },
             {
              "denotation": "",
              "dimValue": "1"
             },
             {
              "denotation": "",
              "dimValue": "1"
             },
             {
              "denotation": "",
              "dimValue": "1"
             }
            ]
           }
          },
          "denotation": ""
         },
         "docString": ""
        }
       ],
       "output": [
        {
         "name": "5",
         "type": {
          "tensorType": {
           "elemType": 0,
           "shape": {
            "dim": [
             {
              "denotation": "",
              "dimValue": "9"
             },
             {
              "denotation": "",
              "dimValue": "1"
             },
             {
              "denotation": "",
              "dimValue": "1"
             },
             {
              "denotation": "",
              "dimValue": "1"
             },
             {
              "denotation": "",
              "dimValue": "1"
             },
             {
              "denotation": "",
              "dimValue": "1"
             },
             {
              "denotation": "",
              "dimValue": "1"
             },
             {
              "denotation": "",
              "dimValue": "1"
             }
            ]
           }
          },
          "denotation": ""
         },
         "docString": ""
        }
       ],
       "valueInfo": [],
       "quantizationAnnotation": [
        {
         "tensorName": "1",
         "quantParameterTensorNames": [
          {
           "key": "TENSOR_NAME",
           "value": "weight"
          },
          {
           "key": "LEAF_USAGE",
           "value": "variable"
          }
         ]
        },
        {
         "tensorName": "3",
         "quantParameterTensorNames": [
          {
           "key": "TENSOR_NAME",
           "value": "bias"
          },
          {
           "key": "LEAF_USAGE",
           "value": "variable"
          }
         ]
        }
       ]
      },
      "floats": [],
      "ints": [],
      "strings": [],
      "tensors": [],
      "graphs": [],
      "sparseTensors": []
     }
    ],
    "docString": ""
   },
   {
    "input": [
     "5"
    ],
    "output": [
     "6"
    ],
    "name": "6",
    "opType": "SIGMOID",
    "domain": "",
    "attribute": [],
    "docString": ""
   },
   {
    "input": [
     "6"
    ],
    "output": [
     "11"
    ],
    "name": "11",
    "opType": "_DENSE_LAYER",
    "domain": "",
    "attribute": [
     {
      "name": "layer",
      "refAttrName": "",
      "docString": "",
      "type": "GRAPH",
      "f": 0,
      "i": "0",
      "s": "",
      "g": {
       "node": [
        {
         "input": [
          "6",
          "7"
         ],
         "output": [
          "8"
         ],
         "name": "8",
         "opType": "MATMUL",
         "domain": "",
         "attribute": [
          {
           "name": "rank_pairs",
           "refAttrName": "",
           "docString": "",
           "type": "INTS",
           "f": 0,
           "i": "0",
           "s": "",
           "floats": [],
           "ints": [
            "0",
            "1"
           ],
           "strings": [],
           "tensors": [],
           "graphs": [],
           "sparseTensors": []
          }
         ],
         "docString": ""
        },
        {
         "input": [
          "9"
         ],
         "output": [
          "10"
         ],
         "name": "10",
         "opType": "EXTEND",
         "domain": "",
         "attribute": [
          {
           "name": "tensor",
           "refAttrName": "",
           "docString": "",
           "type": "TENSOR",
           "f": 0,
           "i": "0",
           "s": "",
           "t": {
            "dims": [],
            "dataType": 0,
            "floatData": [],
            "int32Data": [],
            "stringData": [],
            "int64Data": [],
            "name": "8",
            "docString": "",
            "rawData": "",
            "externalData": [],
            "dataLocation": "DEFAULT",
            "doubleData": [],
            "uint64Data": []
           },
           "floats": [],
           "ints": [],
           "strings": [],
           "tensors": [],
           "graphs": [],
           "sparseTensors": []
          }
         ],
         "docString": ""
        },
        {
         "input": [
          "8",
          "10"
         ],
         "output": [
          "11"
         ],
         "name": "11",
         "opType": "ADD",
         "domain": "",
         "attribute": [],
         "docString": ""
        }
       ],
       "name": "",
       "initializer": [
        {
         "dims": [
          "5",
          "9",
          "1",
          "1",
          "1",
          "1",
          "1",
          "1"
         ],
         "dataType": 1,
         "floatData": [
          -2.31202245,
          -0.503671646,
          1.07057571,
          0.8297593,
          1.41599059,
          -2.91174984,
          1.78826034,
          -1.37194562,
          -1.04785752,
          -0.414966494,
          -1.71554041,
          -1.92442167,
          -0.839403152,
          -1.94530916,
          -0.718701899,
          1.44830096,
          2.33055305,
          -0.606938,
          0.628905177,
          1.57618535,
          1.26562715,
          -1.18045664,
          2.15294528,
          -1.56199419,
          1.6992079,
          1.1059469,
          -1.41601992,
          -0.817674816,
          2.70383668,
          -0.85204035,
          0.863510191,
          -0.7728315,
          -2.09160328,
          -2.30502701,
          -0.491950601,
          0.439771205,
          1.28564894,
          1.91026783,
          -0.890612066,
          -3.07568049,
          0.456121236,
          -1.34254539,
          -0.88523829,
          0.197367772,
          -0.459537923
         ],
         "int32Data": [],
         "stringData": [],
         "int64Data": [],
         "name": "7",
         "docString": "",
         "rawData": "",
         "externalData": [],
         "dataLocation": "DEFAULT",
         "doubleData": [],
         "uint64Data": []
        },
        {
         "dims": [
          "5",
          "1",
          "1",
          "1",
          "1",
          "1",
          "1",
          "1"
         ],
         "dataType": 1,
         "floatData": [
          1.00933468,
          0.181418374,
          0.485740691,
          0.932559729,
          0.613845944
         ],
         "int32Data": [],
         "stringData": [],
         "int64Data": [],
         "name": "9",
         "docString": "",
         "rawData": "",
         "externalData": [],
         "dataLocation": "DEFAULT",
         "doubleData": [],
         "uint64Data": []
        }
       ],
       "sparseInitializer": [],
       "docString": "",
       "input": [
        {
         "name": "6",
         "type": {
          "tensorType": {
           "elemType": 1,
           "shape": {
            "dim": [
             {
              "denotation": "",
              "dimValue": "9"
             },
             {
              "denotation": "",
              "dimValue": "1"
             },
             {
              "denotation": "",
              "dimValue": "1"
             },
             {
              "denotation": "",
              "dimValue": "1"
             },
             {
              "denotation": "",
              "dimValue": "1"
             },
             {
              "denotation": "",
              "dimValue": "1"
             },
             {
              "denotation": "",
              "dimValue": "1"
             },
             {
              "denotation": "",
              "dimValue": "1"
             }
            ]
           }
          },
          "denotation": ""
         },
         "docString": ""
        }
       ],
       "output": [
        {
         "name": "11",
         "type": {
          "tensorType": {
           "elemType": 0,
           "shape": {
            "dim": [
             {
              "denotation": "",
              "dimValue": "5"
             },
             {
              "denotation": "",
              "dimValue": "1"
             },
             {
              "denotation": "",
              "dimValue": "1"
             },
             {
              "denotation": "",
              "dimValue": "1"
             },
             {
              "denotation": "",
              "dimValue": "1"
             },
             {
              "denotation": "",
              "dimValue": "1"
             },
             {
              "denotation": "",
              "dimValue": "1"
             },
             {
              "denotation": "",
              "dimValue": "1"
             }
            ]
           }
          },
          "denotation": ""
         },
         "docString": ""
        }
       ],
       "valueInfo": [],
       "quantizationAnnotation": [
        {
         "tensorName": "7",
         "quantParameterTensorNames": [
          {
           "key": "TENSOR_NAME",
           "value": "weight"
          },
          {
           "key": "LEAF_USAGE",
           "value": "variable"
          }
         ]
        },
        {
         "tensorName": "9",
         "quantParameterTensorNames": [
          {
           "key": "TENSOR_NAME",
           "value": "bias"
          },
          {
           "key": "LEAF_USAGE",
           "value": "variable"
          }
         ]
        }
       ]
      },
      "floats": [],
      "ints": [],
      "strings": [],
      "tensors": [],
      "graphs": [],
      "sparseTensors": []
     }
    ],
    "docString": ""
   },
   {
    "input": [
     "11"
    ],
    "output": [
     "_r0"
    ],
    "name": "_r0",
    "opType": "SIGMOID",
    "domain": "",
    "attribute": [],
    "docString": ""
   }
  ],
  "name": "",
  "initializer": [
   {
    "dims": [
     "10",
     "1",
     "1",
     "1",
     "1",
     "1",
     "1",
     "1"
    ],
    "dataType": 1,
    "floatData": [
     0,
     0,
     0,
     0,
     0,
     0,
     0,
     0,
     0,
     0
    ],
    "int32Data": [],
    "stringData": [],
    "int64Data": [],
    "name": "_i0",
    "docString": "",
    "rawData": "",
    "externalData": [],
    "dataLocation": "DEFAULT",
    "doubleData": [],
    "uint64Data": []
   }
  ],
  "sparseInitializer": [],
  "docString": "",
  "input": [],
  "output": [
   {
    "name": "_r0",
    "type": {
     "tensorType": {
      "elemType": 0,
      "shape": {
       "dim": [
        {
         "denotation": "",
         "dimValue": "5"
        },
        {
         "denotation": "",
         "dimValue": "1"
        },
        {
         "denotation": "",
         "dimValue": "1"
        },
        {
         "denotation": "",
         "dimValue": "1"
        },
        {
         "denotation": "",
         "dimValue": "1"
        },
        {
         "denotation": "",
         "dimValue": "1"
        },
        {
         "denotation": "",
         "dimValue": "1"
        },
        {
         "denotation": "",
         "dimValue": "1"
        }
       ]
      }
     },
     "denotation": ""
    },
    "docString": ""
   }
  ],
  "valueInfo": [],
  "quantizationAnnotation": [
   {
    "tensorName": "_i0",
    "quantParameterTensorNames": [
     {
      "key": "TENSOR_NAME",
      "value": "input"
     },
     {
      "key": "LEAF_USAGE",
      "value": "variable"
     }
    ]
   }
  ]
 },
 "metadataProps": []
}
