{
 "irVersion": "6",
 "opsetImport": [],
 "producerName": "tenncor",
 "producerVersion": "1.0.0",
 "domain": "com.tenncor.eteq",
 "modelVersion": "6",
 "docString": "",
 "graph": {
  "node": [
   {
    "input": [
     "_i0"
    ],
    "output": [
     "5"
    ],
    "name": "5",
    "opType": "_DENSE_LAYER",
    "domain": "",
    "attribute": [
     {
      "name": "layer",
      "refAttrName": "",
      "docString": "",
      "type": "GRAPH",
      "f": 0,
      "i": "0",
      "s": "",
      "g": {
       "node": [
        {
         "input": [
          "_i0",
          "1"
         ],
         "output": [
          "2"
         ],
         "name": "2",
         "opType": "MATMUL",
         "domain": "",
         "attribute": [
          {
           "name": "rank_pairs",
           "refAttrName": "",
           "docString": "",
           "type": "INTS",
           "f": 0,
           "i": "0",
           "s": "",
           "floats": [],
           "ints": [
            "0",
            "1"
           ],
           "strings": [],
           "tensors": [],
           "graphs": [],
           "sparseTensors": []
          }
         ],
         "docString": ""
        },
        {
         "input": [
          "3"
         ],
         "output": [
          "4"
         ],
         "name": "4",
         "opType": "EXTEND",
         "domain": "",
         "attribute": [
          {
           "name": "tensor",
           "refAttrName": "",
           "docString": "",
           "type": "TENSOR",
           "f": 0,
           "i": "0",
           "s": "",
           "t": {
            "dims": [],
            "dataType": 0,
            "floatData": [],
            "int32Data": [],
            "stringData": [],
            "int64Data": [],
            "name": "2",
            "docString": "",
            "rawData": "",
            "externalData": [],
            "dataLocation": "DEFAULT",
            "doubleData": [],
            "uint64Data": []
           },
           "floats": [],
           "ints": [],
           "strings": [],
           "tensors": [],
           "graphs": [],
           "sparseTensors": []
          }
         ],
         "docString": ""
        },
        {
         "input": [
          "2",
          "4"
         ],
         "output": [
          "5"
         ],
         "name": "5",
         "opType": "ADD",
         "domain": "",
         "attribute": [
          {
           "name": "commutative",
           "refAttrName": "",
           "docString": "",
           "type": "STRING",
           "f": 0,
           "i": "0",
           "s": "",
           "floats": [],
           "ints": [],
           "strings": [],
           "tensors": [],
           "graphs": [],
           "sparseTensors": []
          }
         ],
         "docString": ""
        }
       ],
       "name": "",
       "initializer": [
        {
         "dims": [
          "9",
          "10",
          "1",
          "1",
          "1",
          "1",
          "1",
          "1"
         ],
         "dataType": 1,
         "floatData": [
          -0.362341642,
          -0.167818099,
          -1.09364116,
          -1.08155894,
          0.0271097049,
          -0.928887427,
          -0.368731588,
          1.12768888,
          0.948985159,
          -0.390012532,
          -0.7600559,
          -1.23612881,
          -1.15326178,
          0.0142138209,
          -0.614567101,
          -0.391875386,
          1.04058576,
          0.89784795,
          1.23159111,
          -0.32407847,
          0.923916638,
          -0.743864536,
          0.327676773,
          -1.10115385,
          -0.204763129,
          -0.275010645,
          -0.951606,
          1.48426878,
          -0.791731715,
          0.703192174,
          -0.593516827,
          0.459667176,
          -0.853839517,
          -0.0845340639,
          -0.132266223,
          -0.836777747,
          0.949610353,
          -0.101892665,
          -0.357078522,
          0.75281316,
          -1.73213387,
          0.0061985692,
          -0.62102735,
          0.41459465,
          0.205615476,
          0.889526904,
          0.00728036184,
          -0.298932403,
          0.665418804,
          -1.80299544,
          -0.0944171771,
          -0.654288232,
          0.421546817,
          0.20174998,
          -0.737692833,
          -0.583607197,
          0.563194573,
          0.30195722,
          -0.367285311,
          -0.1110048,
          1.09257412,
          1.29361475,
          -1.3491416,
          -0.602616549,
          -0.469454169,
          0.393769354,
          0.374227077,
          -0.328216285,
          -0.131119147,
          1.48499,
          1.27251244,
          -1.16112471,
          -0.646835923,
          -0.929002643,
          -0.467454255,
          1.28197157,
          0.499072373,
          -1.25831163,
          -0.467750043,
          -0.641548,
          0.163944274,
          -0.739202797,
          -0.860746503,
          -0.175146878,
          1.21307039,
          0.273303479,
          -1.23870373,
          -0.416318327,
          -0.733494818,
          0.25111866
         ],
         "int32Data": [],
         "stringData": [],
         "int64Data": [],
         "name": "1",
         "docString": "",
         "rawData": "",
         "externalData": [],
         "dataLocation": "DEFAULT",
         "doubleData": [],
         "uint64Data": []
        },
        {
         "dims": [
          "9",
          "1",
          "1",
          "1",
          "1",
          "1",
          "1",
          "1"
         ],
         "dataType": 1,
         "floatData": [
          -0.584328711,
          1.36374795,
          -0.658632636,
          -0.42652303,
          1.23423398,
          3.20760727,
          -0.342849225,
          -1.7624706,
          0.251859874
         ],
         "int32Data": [],
         "stringData": [],
         "int64Data": [],
         "name": "3",
         "docString": "",
         "rawData": "",
         "externalData": [],
         "dataLocation": "DEFAULT",
         "doubleData": [],
         "uint64Data": []
        }
       ],
       "sparseInitializer": [],
       "docString": "",
       "input": [
        {
         "name": "_i0",
         "type": {
          "tensorType": {
           "elemType": 1,
           "shape": {
            "dim": [
             {
              "denotation": "",
              "dimValue": "10"
             },
             {
              "denotation": "",
              "dimValue": "1"
             },
             {
              "denotation": "",
              "dimValue": "1"
             },
             {
              "denotation": "",
              "dimValue": "1"
             },
             {
              "denotation": "",
              "dimValue": "1"
             },
             {
              "denotation": "",
              "dimValue": "1"
             },
             {
              "denotation": "",
              "dimValue": "1"
             },
             {
              "denotation": "",
              "dimValue": "1"
             }
            ]
           }
          },
          "denotation": ""
         },
         "docString": ""
        }
       ],
       "output": [
        {
         "name": "5",
         "type": {
          "tensorType": {
           "elemType": 0,
           "shape": {
            "dim": [
             {
              "denotation": "",
              "dimValue": "9"
             },
             {
              "denotation": "",
              "dimValue": "1"
             },
             {
              "denotation": "",
              "dimValue": "1"
             },
             {
              "denotation": "",
              "dimValue": "1"
             },
             {
              "denotation": "",
              "dimValue": "1"
             },
             {
              "denotation": "",
              "dimValue": "1"
             },
             {
              "denotation": "",
              "dimValue": "1"
             },
             {
              "denotation": "",
              "dimValue": "1"
             }
            ]
           }
          },
          "denotation": ""
         },
         "docString": ""
        }
       ],
       "valueInfo": [],
       "quantizationAnnotation": [
        {
         "tensorName": "1",
         "quantParameterTensorNames": [
          {
           "key": "TENSOR_NAME",
           "value": "weight"
          },
          {
           "key": "LEAF_USAGE",
           "value": "variable"
          }
         ]
        },
        {
         "tensorName": "3",
         "quantParameterTensorNames": [
          {
           "key": "TENSOR_NAME",
           "value": "bias"
          },
          {
           "key": "LEAF_USAGE",
           "value": "variable"
          }
         ]
        }
       ]
      },
      "floats": [],
      "ints": [],
      "strings": [],
      "tensors": [],
      "graphs": [],
      "sparseTensors": []
     },
     {
      "name": "commutative",
      "refAttrName": "",
      "docString": "",
      "type": "STRING",
      "f": 0,
      "i": "0",
      "s": "",
      "floats": [],
      "ints": [],
      "strings": [],
      "tensors": [],
      "graphs": [],
      "sparseTensors": []
     }
    ],
    "docString": ""
   },
   {
    "input": [
     "5"
    ],
    "output": [
     "6"
    ],
    "name": "6",
    "opType": "SIGMOID",
    "domain": "",
    "attribute": [],
    "docString": ""
   },
   {
    "input": [
     "6"
    ],
    "output": [
     "11"
    ],
    "name": "11",
    "opType": "_DENSE_LAYER",
    "domain": "",
    "attribute": [
     {
      "name": "layer",
      "refAttrName": "",
      "docString": "",
      "type": "GRAPH",
      "f": 0,
      "i": "0",
      "s": "",
      "g": {
       "node": [
        {
         "input": [
          "6",
          "7"
         ],
         "output": [
          "8"
         ],
         "name": "8",
         "opType": "MATMUL",
         "domain": "",
         "attribute": [
          {
           "name": "rank_pairs",
           "refAttrName": "",
           "docString": "",
           "type": "INTS",
           "f": 0,
           "i": "0",
           "s": "",
           "floats": [],
           "ints": [
            "0",
            "1"
           ],
           "strings": [],
           "tensors": [],
           "graphs": [],
           "sparseTensors": []
          }
         ],
         "docString": ""
        },
        {
         "input": [
          "9"
         ],
         "output": [
          "10"
         ],
         "name": "10",
         "opType": "EXTEND",
         "domain": "",
         "attribute": [
          {
           "name": "tensor",
           "refAttrName": "",
           "docString": "",
           "type": "TENSOR",
           "f": 0,
           "i": "0",
           "s": "",
           "t": {
            "dims": [],
            "dataType": 0,
            "floatData": [],
            "int32Data": [],
            "stringData": [],
            "int64Data": [],
            "name": "8",
            "docString": "",
            "rawData": "",
            "externalData": [],
            "dataLocation": "DEFAULT",
            "doubleData": [],
            "uint64Data": []
           },
           "floats": [],
           "ints": [],
           "strings": [],
           "tensors": [],
           "graphs": [],
           "sparseTensors": []
          }
         ],
         "docString": ""
        },
        {
         "input": [
          "8",
          "10"
         ],
         "output": [
          "11"
         ],
         "name": "11",
         "opType": "ADD",
         "domain": "",
         "attribute": [
          {
           "name": "commutative",
           "refAttrName": "",
           "docString": "",
           "type": "STRING",
           "f": 0,
           "i": "0",
           "s": "",
           "floats": [],
           "ints": [],
           "strings": [],
           "tensors": [],
           "graphs": [],
           "sparseTensors": []
          }
         ],
         "docString": ""
        }
       ],
       "name": "",
       "initializer": [
        {
         "dims": [
          "5",
          "9",
          "1",
          "1",
          "1",
          "1",
          "1",
          "1"
         ],
         "dataType": 1,
         "floatData": [
          -0.683141887,
          2.86416507,
          1.78958809,
          -1.40016448,
          -1.1514014,
          -0.996852696,
          -1.21115816,
          -0.350001127,
          -1.12110829,
          -1.55114233,
          -1.5505085,
          1.23692656,
          -0.453391045,
          0.668355823,
          -0.336587489,
          -2.22059894,
          -1.26031125,
          1.51466703,
          0.622566044,
          2.76151133,
          -0.0764343888,
          0.707631707,
          -3.44377875,
          -0.793502808,
          0.77325815,
          -1.7830168,
          -2.24384379,
          -0.325350493,
          -0.56445992,
          -2.73674893,
          -0.474128455,
          -0.135564461,
          -0.971696138,
          1.81806457,
          -0.579214513,
          2.21739173,
          -0.131211147,
          0.903725564,
          2.34627938,
          -0.954212844,
          1.6184504,
          -1.52603972,
          0.356846899,
          -2.17712164,
          0.463639528
         ],
         "int32Data": [],
         "stringData": [],
         "int64Data": [],
         "name": "7",
         "docString": "",
         "rawData": "",
         "externalData": [],
         "dataLocation": "DEFAULT",
         "doubleData": [],
         "uint64Data": []
        },
        {
         "dims": [
          "5",
          "1",
          "1",
          "1",
          "1",
          "1",
          "1",
          "1"
         ],
         "dataType": 1,
         "floatData": [
          1.59385073,
          0.75228405,
          0.183374912,
          0.0551086031,
          1.20056915
         ],
         "int32Data": [],
         "stringData": [],
         "int64Data": [],
         "name": "9",
         "docString": "",
         "rawData": "",
         "externalData": [],
         "dataLocation": "DEFAULT",
         "doubleData": [],
         "uint64Data": []
        }
       ],
       "sparseInitializer": [],
       "docString": "",
       "input": [
        {
         "name": "6",
         "type": {
          "tensorType": {
           "elemType": 1,
           "shape": {
            "dim": [
             {
              "denotation": "",
              "dimValue": "9"
             },
             {
              "denotation": "",
              "dimValue": "1"
             },
             {
              "denotation": "",
              "dimValue": "1"
             },
             {
              "denotation": "",
              "dimValue": "1"
             },
             {
              "denotation": "",
              "dimValue": "1"
             },
             {
              "denotation": "",
              "dimValue": "1"
             },
             {
              "denotation": "",
              "dimValue": "1"
             },
             {
              "denotation": "",
              "dimValue": "1"
             }
            ]
           }
          },
          "denotation": ""
         },
         "docString": ""
        }
       ],
       "output": [
        {
         "name": "11",
         "type": {
          "tensorType": {
           "elemType": 0,
           "shape": {
            "dim": [
             {
              "denotation": "",
              "dimValue": "5"
             },
             {
              "denotation": "",
              "dimValue": "1"
             },
             {
              "denotation": "",
              "dimValue": "1"
             },
             {
              "denotation": "",
              "dimValue": "1"
             },
             {
              "denotation": "",
              "dimValue": "1"
             },
             {
              "denotation": "",
              "dimValue": "1"
             },
             {
              "denotation": "",
              "dimValue": "1"
             },
             {
              "denotation": "",
              "dimValue": "1"
             }
            ]
           }
          },
          "denotation": ""
         },
         "docString": ""
        }
       ],
       "valueInfo": [],
       "quantizationAnnotation": [
        {
         "tensorName": "7",
         "quantParameterTensorNames": [
          {
           "key": "TENSOR_NAME",
           "value": "weight"
          },
          {
           "key": "LEAF_USAGE",
           "value": "variable"
          }
         ]
        },
        {
         "tensorName": "9",
         "quantParameterTensorNames": [
          {
           "key": "TENSOR_NAME",
           "value": "bias"
          },
          {
           "key": "LEAF_USAGE",
           "value": "variable"
          }
         ]
        }
       ]
      },
      "floats": [],
      "ints": [],
      "strings": [],
      "tensors": [],
      "graphs": [],
      "sparseTensors": []
     },
     {
      "name": "commutative",
      "refAttrName": "",
      "docString": "",
      "type": "STRING",
      "f": 0,
      "i": "0",
      "s": "",
      "floats": [],
      "ints": [],
      "strings": [],
      "tensors": [],
      "graphs": [],
      "sparseTensors": []
     }
    ],
    "docString": ""
   },
   {
    "input": [
     "11"
    ],
    "output": [
     "_r0"
    ],
    "name": "_r0",
    "opType": "SIGMOID",
    "domain": "",
    "attribute": [],
    "docString": ""
   }
  ],
  "name": "",
  "initializer": [
   {
    "dims": [
     "10",
     "1",
     "1",
     "1",
     "1",
     "1",
     "1",
     "1"
    ],
    "dataType": 1,
    "floatData": [
     0,
     0,
     0,
     0,
     0,
     0,
     0,
     0,
     0,
     0
    ],
    "int32Data": [],
    "stringData": [],
    "int64Data": [],
    "name": "_i0",
    "docString": "",
    "rawData": "",
    "externalData": [],
    "dataLocation": "DEFAULT",
    "doubleData": [],
    "uint64Data": []
   }
  ],
  "sparseInitializer": [],
  "docString": "",
  "input": [],
  "output": [
   {
    "name": "_r0",
    "type": {
     "tensorType": {
      "elemType": 0,
      "shape": {
       "dim": [
        {
         "denotation": "",
         "dimValue": "5"
        },
        {
         "denotation": "",
         "dimValue": "1"
        },
        {
         "denotation": "",
         "dimValue": "1"
        },
        {
         "denotation": "",
         "dimValue": "1"
        },
        {
         "denotation": "",
         "dimValue": "1"
        },
        {
         "denotation": "",
         "dimValue": "1"
        },
        {
         "denotation": "",
         "dimValue": "1"
        },
        {
         "denotation": "",
         "dimValue": "1"
        }
       ]
      }
     },
     "denotation": ""
    },
    "docString": ""
   }
  ],
  "valueInfo": [],
  "quantizationAnnotation": [
   {
    "tensorName": "_i0",
    "quantParameterTensorNames": [
     {
      "key": "TENSOR_NAME",
      "value": "input"
     },
     {
      "key": "LEAF_USAGE",
      "value": "variable"
     }
    ]
   }
  ]
 },
 "metadataProps": []
}
