{
 "irVersion": "6",
 "opsetImport": [],
 "producerName": "tenncor",
 "producerVersion": "1.0.0",
 "domain": "com.mingkaic.tenncor",
 "modelVersion": "6",
 "docString": "",
 "graph": {
  "node": [
   {
    "input": [
     "0"
    ],
    "output": [
     "17"
    ],
    "name": "17",
    "opType": "_LINK",
    "domain": "",
    "attribute": [
     {
      "name": "layer",
      "refAttrName": "",
      "docString": "",
      "type": "GRAPH",
      "f": 0,
      "i": "0",
      "s": "",
      "g": {
       "node": [
        {
         "input": [
          "0"
         ],
         "output": [
          "6"
         ],
         "name": "6",
         "opType": "_DENSE_LAYER",
         "domain": "",
         "attribute": [
          {
           "name": "layer",
           "refAttrName": "",
           "docString": "",
           "type": "GRAPH",
           "f": 0,
           "i": "0",
           "s": "",
           "g": {
            "node": [
             {
              "input": [
               "0",
               "1"
              ],
              "output": [
               "2"
              ],
              "name": "2",
              "opType": "MATMUL",
              "domain": "",
              "attribute": [
               {
                "name": "rank_pairs",
                "refAttrName": "",
                "docString": "",
                "type": "INTS",
                "f": 0,
                "i": "0",
                "s": "",
                "floats": [],
                "ints": [
                 "0",
                 "1"
                ],
                "strings": [],
                "tensors": [],
                "graphs": [],
                "sparseTensors": []
               }
              ],
              "docString": ""
             },
             {
              "input": [
               "3"
              ],
              "output": [
               "4"
              ],
              "name": "4",
              "opType": "EXTEND",
              "domain": "",
              "attribute": [
               {
                "name": "tensor",
                "refAttrName": "",
                "docString": "",
                "type": "TENSOR",
                "f": 0,
                "i": "0",
                "s": "",
                "t": {
                 "dims": [],
                 "dataType": 0,
                 "floatData": [],
                 "int32Data": [],
                 "stringData": [],
                 "int64Data": [],
                 "name": "2",
                 "docString": "",
                 "rawData": "",
                 "externalData": [],
                 "dataLocation": "DEFAULT",
                 "doubleData": [],
                 "uint64Data": []
                },
                "floats": [],
                "ints": [],
                "strings": [],
                "tensors": [],
                "graphs": [],
                "sparseTensors": []
               }
              ],
              "docString": ""
             },
             {
              "input": [
               "2",
               "4"
              ],
              "output": [
               "5"
              ],
              "name": "5",
              "opType": "ADD",
              "domain": "",
              "attribute": [],
              "docString": ""
             },
             {
              "input": [
               "5"
              ],
              "output": [
               "6"
              ],
              "name": "6",
              "opType": "IDENTITY",
              "domain": "",
              "attribute": [],
              "docString": ""
             }
            ],
            "name": "",
            "initializer": [
             {
              "dims": [
               "9",
               "10",
               "1",
               "1",
               "1",
               "1",
               "1",
               "1"
              ],
              "dataType": 1,
              "floatData": [
               -1.63770843,
               -1.28656709,
               -0.44665882,
               0.430983126,
               0.581176817,
               0.32193327,
               0.665763,
               0.0255984105,
               -0.295770675,
               -1.38735259,
               -1.27725708,
               -0.659298062,
               0.579866767,
               0.747192442,
               0.353506148,
               0.810507715,
               0.193920851,
               0.211989895,
               -0.430876,
               1.1187377,
               -1.17035294,
               1.18723142,
               -0.393908232,
               -0.487369895,
               -0.200435653,
               0.380153805,
               -1.08813035,
               -0.377882689,
               0.838306904,
               -0.947855532,
               1.56466651,
               -0.668666422,
               -0.575309217,
               -0.374229163,
               0.428877831,
               -0.469407678,
               0.572308,
               -0.871826291,
               -0.306526363,
               -0.501894832,
               0.822256446,
               -0.561198711,
               -1.25439441,
               1.13104594,
               -0.741756618,
               0.428629816,
               -1.05038822,
               -0.267037183,
               -0.456429899,
               0.673508406,
               -0.693408072,
               -1.29043579,
               1.02407,
               -0.620479584,
               0.347807974,
               -0.360808492,
               -0.862522423,
               -0.0621232726,
               -0.649270415,
               1.76362801,
               -0.886334479,
               -0.327815115,
               0.307731062,
               0.114531599,
               -0.461804688,
               -0.984849513,
               -0.299961984,
               -0.842039585,
               1.33818758,
               -1.12161756,
               -0.643259466,
               0.226104915,
               0.648167133,
               0.0660617575,
               -0.483100772,
               0.377800941,
               1.31923139,
               -0.451213837,
               -0.203115895,
               -1.55311728,
               0.0296499841,
               0.848920524,
               -0.156191215,
               -0.038124904,
               0.808385193,
               1.1421566,
               -0.290637761,
               -0.106733747,
               -1.55781245,
               -0.624732852
              ],
              "int32Data": [],
              "stringData": [],
              "int64Data": [],
              "name": "1",
              "docString": "",
              "rawData": "",
              "externalData": [],
              "dataLocation": "DEFAULT",
              "doubleData": [],
              "uint64Data": []
             },
             {
              "dims": [
               "9",
               "1",
               "1",
               "1",
               "1",
               "1",
               "1",
               "1"
              ],
              "dataType": 1,
              "floatData": [
               0.0509777591,
               1.33893251,
               2.46631312,
               -2.1231215,
               -1.69557357,
               -0.652008355,
               1.63563538,
               0.309213936,
               0.0437689088
              ],
              "int32Data": [],
              "stringData": [],
              "int64Data": [],
              "name": "3",
              "docString": "",
              "rawData": "",
              "externalData": [],
              "dataLocation": "DEFAULT",
              "doubleData": [],
              "uint64Data": []
             }
            ],
            "sparseInitializer": [],
            "docString": "",
            "input": [
             {
              "name": "0",
              "type": {
               "tensorType": {
                "elemType": 1,
                "shape": {
                 "dim": [
                  {
                   "denotation": "",
                   "dimValue": "10"
                  },
                  {
                   "denotation": "",
                   "dimValue": "1"
                  },
                  {
                   "denotation": "",
                   "dimValue": "1"
                  },
                  {
                   "denotation": "",
                   "dimValue": "1"
                  },
                  {
                   "denotation": "",
                   "dimValue": "1"
                  },
                  {
                   "denotation": "",
                   "dimValue": "1"
                  },
                  {
                   "denotation": "",
                   "dimValue": "1"
                  },
                  {
                   "denotation": "",
                   "dimValue": "1"
                  }
                 ]
                }
               },
               "denotation": ""
              },
              "docString": ""
             }
            ],
            "output": [
             {
              "name": "6",
              "type": {
               "tensorType": {
                "elemType": 0,
                "shape": {
                 "dim": [
                  {
                   "denotation": "",
                   "dimValue": "9"
                  },
                  {
                   "denotation": "",
                   "dimValue": "1"
                  },
                  {
                   "denotation": "",
                   "dimValue": "1"
                  },
                  {
                   "denotation": "",
                   "dimValue": "1"
                  },
                  {
                   "denotation": "",
                   "dimValue": "1"
                  },
                  {
                   "denotation": "",
                   "dimValue": "1"
                  },
                  {
                   "denotation": "",
                   "dimValue": "1"
                  },
                  {
                   "denotation": "",
                   "dimValue": "1"
                  }
                 ]
                }
               },
               "denotation": ""
              },
              "docString": ""
             }
            ],
            "valueInfo": [],
            "quantizationAnnotation": [
             {
              "tensorName": "1",
              "quantParameterTensorNames": [
               {
                "key": "TENSOR_NAME",
                "value": "weight"
               },
               {
                "key": "LEAF_USAGE",
                "value": "variable"
               }
              ]
             },
             {
              "tensorName": "3",
              "quantParameterTensorNames": [
               {
                "key": "TENSOR_NAME",
                "value": "bias"
               },
               {
                "key": "LEAF_USAGE",
                "value": "variable"
               }
              ]
             }
            ]
           },
           "floats": [],
           "ints": [],
           "strings": [],
           "tensors": [],
           "graphs": [],
           "sparseTensors": []
          }
         ],
         "docString": ""
        },
        {
         "input": [
          "6"
         ],
         "output": [
          "8"
         ],
         "name": "8",
         "opType": "_UNARY_BIND",
         "domain": "",
         "attribute": [
          {
           "name": "layer",
           "refAttrName": "",
           "docString": "",
           "type": "GRAPH",
           "f": 0,
           "i": "0",
           "s": "",
           "g": {
            "node": [
             {
              "input": [
               "6"
              ],
              "output": [
               "7"
              ],
              "name": "7",
              "opType": "SIGMOID",
              "domain": "",
              "attribute": [],
              "docString": ""
             },
             {
              "input": [
               "7"
              ],
              "output": [
               "8"
              ],
              "name": "8",
              "opType": "IDENTITY",
              "domain": "",
              "attribute": [],
              "docString": ""
             }
            ],
            "name": "",
            "initializer": [],
            "sparseInitializer": [],
            "docString": "",
            "input": [
             {
              "name": "6",
              "type": {
               "tensorType": {
                "elemType": 1,
                "shape": {
                 "dim": [
                  {
                   "denotation": "",
                   "dimValue": "9"
                  },
                  {
                   "denotation": "",
                   "dimValue": "1"
                  },
                  {
                   "denotation": "",
                   "dimValue": "1"
                  },
                  {
                   "denotation": "",
                   "dimValue": "1"
                  },
                  {
                   "denotation": "",
                   "dimValue": "1"
                  },
                  {
                   "denotation": "",
                   "dimValue": "1"
                  },
                  {
                   "denotation": "",
                   "dimValue": "1"
                  },
                  {
                   "denotation": "",
                   "dimValue": "1"
                  }
                 ]
                }
               },
               "denotation": ""
              },
              "docString": ""
             }
            ],
            "output": [
             {
              "name": "8",
              "type": {
               "tensorType": {
                "elemType": 0,
                "shape": {
                 "dim": [
                  {
                   "denotation": "",
                   "dimValue": "9"
                  },
                  {
                   "denotation": "",
                   "dimValue": "1"
                  },
                  {
                   "denotation": "",
                   "dimValue": "1"
                  },
                  {
                   "denotation": "",
                   "dimValue": "1"
                  },
                  {
                   "denotation": "",
                   "dimValue": "1"
                  },
                  {
                   "denotation": "",
                   "dimValue": "1"
                  },
                  {
                   "denotation": "",
                   "dimValue": "1"
                  },
                  {
                   "denotation": "",
                   "dimValue": "1"
                  }
                 ]
                }
               },
               "denotation": ""
              },
              "docString": ""
             }
            ],
            "valueInfo": [],
            "quantizationAnnotation": []
           },
           "floats": [],
           "ints": [],
           "strings": [],
           "tensors": [],
           "graphs": [],
           "sparseTensors": []
          }
         ],
         "docString": ""
        },
        {
         "input": [
          "8"
         ],
         "output": [
          "14"
         ],
         "name": "14",
         "opType": "_DENSE_LAYER",
         "domain": "",
         "attribute": [
          {
           "name": "layer",
           "refAttrName": "",
           "docString": "",
           "type": "GRAPH",
           "f": 0,
           "i": "0",
           "s": "",
           "g": {
            "node": [
             {
              "input": [
               "8",
               "9"
              ],
              "output": [
               "10"
              ],
              "name": "10",
              "opType": "MATMUL",
              "domain": "",
              "attribute": [
               {
                "name": "rank_pairs",
                "refAttrName": "",
                "docString": "",
                "type": "INTS",
                "f": 0,
                "i": "0",
                "s": "",
                "floats": [],
                "ints": [
                 "0",
                 "1"
                ],
                "strings": [],
                "tensors": [],
                "graphs": [],
                "sparseTensors": []
               }
              ],
              "docString": ""
             },
             {
              "input": [
               "11"
              ],
              "output": [
               "12"
              ],
              "name": "12",
              "opType": "EXTEND",
              "domain": "",
              "attribute": [
               {
                "name": "tensor",
                "refAttrName": "",
                "docString": "",
                "type": "TENSOR",
                "f": 0,
                "i": "0",
                "s": "",
                "t": {
                 "dims": [],
                 "dataType": 0,
                 "floatData": [],
                 "int32Data": [],
                 "stringData": [],
                 "int64Data": [],
                 "name": "10",
                 "docString": "",
                 "rawData": "",
                 "externalData": [],
                 "dataLocation": "DEFAULT",
                 "doubleData": [],
                 "uint64Data": []
                },
                "floats": [],
                "ints": [],
                "strings": [],
                "tensors": [],
                "graphs": [],
                "sparseTensors": []
               }
              ],
              "docString": ""
             },
             {
              "input": [
               "10",
               "12"
              ],
              "output": [
               "13"
              ],
              "name": "13",
              "opType": "ADD",
              "domain": "",
              "attribute": [],
              "docString": ""
             },
             {
              "input": [
               "13"
              ],
              "output": [
               "14"
              ],
              "name": "14",
              "opType": "IDENTITY",
              "domain": "",
              "attribute": [],
              "docString": ""
             }
            ],
            "name": "",
            "initializer": [
             {
              "dims": [
               "5",
               "9",
               "1",
               "1",
               "1",
               "1",
               "1",
               "1"
              ],
              "dataType": 1,
              "floatData": [
               -2.57678771,
               -0.610161,
               0.984390378,
               0.463927,
               1.15393162,
               -2.31316876,
               1.72537124,
               -1.6700809,
               -0.702845633,
               -0.0814072266,
               -1.20897603,
               -2.18721819,
               -0.545626521,
               -1.70889044,
               -0.714121938,
               1.14103413,
               2.52292848,
               -0.401658714,
               0.136503279,
               1.2164067,
               1.36829817,
               -0.709711969,
               1.57964742,
               -0.901010573,
               2.26946521,
               0.611522496,
               -0.891234398,
               -0.89085,
               2.98655295,
               -0.698082387,
               1.35892284,
               -0.720772147,
               -2.2280097,
               -1.72386312,
               -0.469985068,
               0.267205447,
               0.957267761,
               2.10752177,
               -0.729828417,
               -3.09784269,
               -0.0791495815,
               -1.28196442,
               -1.03837883,
               0.202330887,
               -0.568500102
              ],
              "int32Data": [],
              "stringData": [],
              "int64Data": [],
              "name": "9",
              "docString": "",
              "rawData": "",
              "externalData": [],
              "dataLocation": "DEFAULT",
              "doubleData": [],
              "uint64Data": []
             },
             {
              "dims": [
               "5",
               "1",
               "1",
               "1",
               "1",
               "1",
               "1",
               "1"
              ],
              "dataType": 1,
              "floatData": [
               0.438827455,
               -0.00443019625,
               0.47587797,
               0.75349915,
               0.418781728
              ],
              "int32Data": [],
              "stringData": [],
              "int64Data": [],
              "name": "11",
              "docString": "",
              "rawData": "",
              "externalData": [],
              "dataLocation": "DEFAULT",
              "doubleData": [],
              "uint64Data": []
             }
            ],
            "sparseInitializer": [],
            "docString": "",
            "input": [
             {
              "name": "8",
              "type": {
               "tensorType": {
                "elemType": 1,
                "shape": {
                 "dim": [
                  {
                   "denotation": "",
                   "dimValue": "9"
                  },
                  {
                   "denotation": "",
                   "dimValue": "1"
                  },
                  {
                   "denotation": "",
                   "dimValue": "1"
                  },
                  {
                   "denotation": "",
                   "dimValue": "1"
                  },
                  {
                   "denotation": "",
                   "dimValue": "1"
                  },
                  {
                   "denotation": "",
                   "dimValue": "1"
                  },
                  {
                   "denotation": "",
                   "dimValue": "1"
                  },
                  {
                   "denotation": "",
                   "dimValue": "1"
                  }
                 ]
                }
               },
               "denotation": ""
              },
              "docString": ""
             }
            ],
            "output": [
             {
              "name": "14",
              "type": {
               "tensorType": {
                "elemType": 0,
                "shape": {
                 "dim": [
                  {
                   "denotation": "",
                   "dimValue": "5"
                  },
                  {
                   "denotation": "",
                   "dimValue": "1"
                  },
                  {
                   "denotation": "",
                   "dimValue": "1"
                  },
                  {
                   "denotation": "",
                   "dimValue": "1"
                  },
                  {
                   "denotation": "",
                   "dimValue": "1"
                  },
                  {
                   "denotation": "",
                   "dimValue": "1"
                  },
                  {
                   "denotation": "",
                   "dimValue": "1"
                  },
                  {
                   "denotation": "",
                   "dimValue": "1"
                  }
                 ]
                }
               },
               "denotation": ""
              },
              "docString": ""
             }
            ],
            "valueInfo": [],
            "quantizationAnnotation": [
             {
              "tensorName": "9",
              "quantParameterTensorNames": [
               {
                "key": "TENSOR_NAME",
                "value": "weight"
               },
               {
                "key": "LEAF_USAGE",
                "value": "variable"
               }
              ]
             },
             {
              "tensorName": "11",
              "quantParameterTensorNames": [
               {
                "key": "TENSOR_NAME",
                "value": "bias"
               },
               {
                "key": "LEAF_USAGE",
                "value": "variable"
               }
              ]
             }
            ]
           },
           "floats": [],
           "ints": [],
           "strings": [],
           "tensors": [],
           "graphs": [],
           "sparseTensors": []
          }
         ],
         "docString": ""
        },
        {
         "input": [
          "14"
         ],
         "output": [
          "16"
         ],
         "name": "16",
         "opType": "_UNARY_BIND",
         "domain": "",
         "attribute": [
          {
           "name": "layer",
           "refAttrName": "",
           "docString": "",
           "type": "GRAPH",
           "f": 0,
           "i": "0",
           "s": "",
           "g": {
            "node": [
             {
              "input": [
               "14"
              ],
              "output": [
               "15"
              ],
              "name": "15",
              "opType": "SIGMOID",
              "domain": "",
              "attribute": [],
              "docString": ""
             },
             {
              "input": [
               "15"
              ],
              "output": [
               "16"
              ],
              "name": "16",
              "opType": "IDENTITY",
              "domain": "",
              "attribute": [],
              "docString": ""
             }
            ],
            "name": "",
            "initializer": [],
            "sparseInitializer": [],
            "docString": "",
            "input": [
             {
              "name": "14",
              "type": {
               "tensorType": {
                "elemType": 1,
                "shape": {
                 "dim": [
                  {
                   "denotation": "",
                   "dimValue": "5"
                  },
                  {
                   "denotation": "",
                   "dimValue": "1"
                  },
                  {
                   "denotation": "",
                   "dimValue": "1"
                  },
                  {
                   "denotation": "",
                   "dimValue": "1"
                  },
                  {
                   "denotation": "",
                   "dimValue": "1"
                  },
                  {
                   "denotation": "",
                   "dimValue": "1"
                  },
                  {
                   "denotation": "",
                   "dimValue": "1"
                  },
                  {
                   "denotation": "",
                   "dimValue": "1"
                  }
                 ]
                }
               },
               "denotation": ""
              },
              "docString": ""
             }
            ],
            "output": [
             {
              "name": "16",
              "type": {
               "tensorType": {
                "elemType": 0,
                "shape": {
                 "dim": [
                  {
                   "denotation": "",
                   "dimValue": "5"
                  },
                  {
                   "denotation": "",
                   "dimValue": "1"
                  },
                  {
                   "denotation": "",
                   "dimValue": "1"
                  },
                  {
                   "denotation": "",
                   "dimValue": "1"
                  },
                  {
                   "denotation": "",
                   "dimValue": "1"
                  },
                  {
                   "denotation": "",
                   "dimValue": "1"
                  },
                  {
                   "denotation": "",
                   "dimValue": "1"
                  },
                  {
                   "denotation": "",
                   "dimValue": "1"
                  }
                 ]
                }
               },
               "denotation": ""
              },
              "docString": ""
             }
            ],
            "valueInfo": [],
            "quantizationAnnotation": []
           },
           "floats": [],
           "ints": [],
           "strings": [],
           "tensors": [],
           "graphs": [],
           "sparseTensors": []
          }
         ],
         "docString": ""
        },
        {
         "input": [
          "16"
         ],
         "output": [
          "17"
         ],
         "name": "17",
         "opType": "IDENTITY",
         "domain": "",
         "attribute": [],
         "docString": ""
        }
       ],
       "name": "",
       "initializer": [],
       "sparseInitializer": [],
       "docString": "",
       "input": [
        {
         "name": "0",
         "type": {
          "tensorType": {
           "elemType": 1,
           "shape": {
            "dim": [
             {
              "denotation": "",
              "dimValue": "10"
             },
             {
              "denotation": "",
              "dimValue": "1"
             },
             {
              "denotation": "",
              "dimValue": "1"
             },
             {
              "denotation": "",
              "dimValue": "1"
             },
             {
              "denotation": "",
              "dimValue": "1"
             },
             {
              "denotation": "",
              "dimValue": "1"
             },
             {
              "denotation": "",
              "dimValue": "1"
             },
             {
              "denotation": "",
              "dimValue": "1"
             }
            ]
           }
          },
          "denotation": ""
         },
         "docString": ""
        }
       ],
       "output": [
        {
         "name": "17",
         "type": {
          "tensorType": {
           "elemType": 0,
           "shape": {
            "dim": [
             {
              "denotation": "",
              "dimValue": "5"
             },
             {
              "denotation": "",
              "dimValue": "1"
             },
             {
              "denotation": "",
              "dimValue": "1"
             },
             {
              "denotation": "",
              "dimValue": "1"
             },
             {
              "denotation": "",
              "dimValue": "1"
             },
             {
              "denotation": "",
              "dimValue": "1"
             },
             {
              "denotation": "",
              "dimValue": "1"
             },
             {
              "denotation": "",
              "dimValue": "1"
             }
            ]
           }
          },
          "denotation": ""
         },
         "docString": ""
        }
       ],
       "valueInfo": [],
       "quantizationAnnotation": []
      },
      "floats": [],
      "ints": [],
      "strings": [],
      "tensors": [],
      "graphs": [],
      "sparseTensors": []
     }
    ],
    "docString": ""
   }
  ],
  "name": "",
  "initializer": [
   {
    "dims": [
     "10",
     "1",
     "1",
     "1",
     "1",
     "1",
     "1",
     "1"
    ],
    "dataType": 1,
    "floatData": [
     0,
     0,
     0,
     0,
     0,
     0,
     0,
     0,
     0,
     0
    ],
    "int32Data": [],
    "stringData": [],
    "int64Data": [],
    "name": "0",
    "docString": "",
    "rawData": "",
    "externalData": [],
    "dataLocation": "DEFAULT",
    "doubleData": [],
    "uint64Data": []
   }
  ],
  "sparseInitializer": [],
  "docString": "",
  "input": [],
  "output": [
   {
    "name": "17",
    "type": {
     "tensorType": {
      "elemType": 0,
      "shape": {
       "dim": [
        {
         "denotation": "",
         "dimValue": "5"
        },
        {
         "denotation": "",
         "dimValue": "1"
        },
        {
         "denotation": "",
         "dimValue": "1"
        },
        {
         "denotation": "",
         "dimValue": "1"
        },
        {
         "denotation": "",
         "dimValue": "1"
        },
        {
         "denotation": "",
         "dimValue": "1"
        },
        {
         "denotation": "",
         "dimValue": "1"
        },
        {
         "denotation": "",
         "dimValue": "1"
        }
       ]
      }
     },
     "denotation": ""
    },
    "docString": ""
   }
  ],
  "valueInfo": [],
  "quantizationAnnotation": [
   {
    "tensorName": "0",
    "quantParameterTensorNames": [
     {
      "key": "TENSOR_NAME",
      "value": "input"
     },
     {
      "key": "LEAF_USAGE",
      "value": "variable"
     }
    ]
   }
  ]
 },
 "metadataProps": []
}
