{
 "irVersion": "6",
 "opsetImport": [],
 "producerName": "tenncor",
 "producerVersion": "1.0.0",
 "domain": "com.tenncor.eteq",
 "modelVersion": "6",
 "docString": "",
 "graph": {
  "node": [
   {
    "input": [
     "_i0"
    ],
    "output": [
     "558"
    ],
    "name": "558",
    "opType": "_GRU_LAYER",
    "domain": "",
    "attribute": [
     {
      "name": "layer",
      "refAttrName": "",
      "docString": "",
      "type": "GRAPH",
      "f": 0,
      "i": "0",
      "s": "",
      "g": {
       "node": [
        {
         "input": [
          "_i0"
         ],
         "output": [
          "1"
         ],
         "name": "1",
         "opType": "SLICE",
         "domain": "",
         "attribute": [
          {
           "name": "dimension_pairs",
           "refAttrName": "",
           "docString": "",
           "type": "INTS",
           "f": 0,
           "i": "0",
           "s": "",
           "floats": [],
           "ints": [
            "0",
            "65535",
            "0",
            "1",
            "0",
            "65535",
            "0",
            "65535",
            "0",
            "65535",
            "0",
            "65535",
            "0",
            "65535",
            "0",
            "65535"
           ],
           "strings": [],
           "tensors": [],
           "graphs": [],
           "sparseTensors": []
          }
         ],
         "docString": ""
        },
        {
         "input": [
          "1",
          "2"
         ],
         "output": [
          "3"
         ],
         "name": "3",
         "opType": "CONCAT",
         "domain": "",
         "attribute": [
          {
           "name": "rank",
           "refAttrName": "",
           "docString": "",
           "type": "INT",
           "f": 0,
           "i": "0",
           "s": "",
           "floats": [],
           "ints": [],
           "strings": [],
           "tensors": [],
           "graphs": [],
           "sparseTensors": []
          }
         ],
         "docString": ""
        },
        {
         "input": [
          "3"
         ],
         "output": [
          "8"
         ],
         "name": "8",
         "opType": "_DENSE_LAYER",
         "domain": "",
         "attribute": [
          {
           "name": "layer",
           "refAttrName": "",
           "docString": "",
           "type": "GRAPH",
           "f": 0,
           "i": "0",
           "s": "",
           "g": {
            "node": [
             {
              "input": [
               "3",
               "4"
              ],
              "output": [
               "5"
              ],
              "name": "5",
              "opType": "MATMUL",
              "domain": "",
              "attribute": [
               {
                "name": "rank_pairs",
                "refAttrName": "",
                "docString": "",
                "type": "INTS",
                "f": 0,
                "i": "0",
                "s": "",
                "floats": [],
                "ints": [
                 "0",
                 "1"
                ],
                "strings": [],
                "tensors": [],
                "graphs": [],
                "sparseTensors": []
               }
              ],
              "docString": ""
             },
             {
              "input": [
               "6"
              ],
              "output": [
               "7"
              ],
              "name": "7",
              "opType": "EXTEND",
              "domain": "",
              "attribute": [
               {
                "name": "tensor",
                "refAttrName": "",
                "docString": "",
                "type": "TENSOR",
                "f": 0,
                "i": "0",
                "s": "",
                "t": {
                 "dims": [],
                 "dataType": 0,
                 "floatData": [],
                 "int32Data": [],
                 "stringData": [],
                 "int64Data": [],
                 "name": "5",
                 "docString": "",
                 "rawData": "",
                 "externalData": [],
                 "dataLocation": "DEFAULT",
                 "doubleData": [],
                 "uint64Data": []
                },
                "floats": [],
                "ints": [],
                "strings": [],
                "tensors": [],
                "graphs": [],
                "sparseTensors": []
               }
              ],
              "docString": ""
             },
             {
              "input": [
               "5",
               "7"
              ],
              "output": [
               "8"
              ],
              "name": "8",
              "opType": "ADD",
              "domain": "",
              "attribute": [],
              "docString": ""
             }
            ],
            "name": "",
            "initializer": [
             {
              "dims": [
               "64",
               "128",
               "1",
               "1",
               "1",
               "1",
               "1",
               "1"
              ],
              "dataType": 1,
              "floatData": [
               -0.053464476,
               -0.0196410418,
               0.00362680433,
               -0.0230509527,
               0.0104364334,
               0.311559558,
               0.0153078698,
               0.0408935398,
               -0.0538208485,
               -0.124366231,
               0.331801891,
               -0.012525971,
               -0.02216978,
               -0.0538746491,
               -0.056347996,
               0.0638870448,
               -0.110022262,
               0.0420698524,
               0.024789324,
               -0.0108381966,
               0.118145198,
               0.0194140095,
               0.0263659433,
               0.0349677838,
               -0.0501723699,
               0.428068459,
               -0.105300181,
               0.0559701398,
               0.0215295199,
               0.0637157857,
               -0.0924276263,
               -0.00335339131,
               0.0949267372,
               0.0038466542,
               -0.00632135663,
               0.132344857,
               0.0981119424,
               0.00146379694,
               -0.0180070475,
               0.0344523,
               -0.0305896774,
               0.00180512876,
               -0.0608452149,
               0.0333966278,
               0.0492014885,
               -0.00209458661,
               0.234107137,
               -0.00747707533,
               0.239517629,
               0.0492011122,
               0.0999904573,
               -0.060483627,
               0.0215826072,
               -0.0070919781,
               -0.058492139,
               -0.0502658114,
               0.00701241149,
               -0.102017127,
               -0.031574104,
               0.0997390077,
               0.0938273072,
               0.0595258512,
               0.168254226,
               -0.0279878192,
               -0.195433274,
               0.0556934,
               -0.302790582,
               -0.420770496,
               -0.230243787,
               0.00182358734,
               -0.0230678637,
               -0.419495553,
               0.440030962,
               -0.226923466,
               -0.787784338,
               -0.196813837,
               0.20553121,
               -0.139700189,
               -0.111620858,
               -0.593244731,
               -0.0404038057,
               0.0193656534,
               -0.168065473,
               0.048505,
               -0.0639184043,
               0.0753809139,
               0.387792856,
               -0.291197658,
               0.00932014,
               0.0970045179,
               0.329087317,
               -0.552049875,
               0.0904384479,
               -0.410666347,
               0.0860932171,
               0.19631277,
               -0.576890647,
               0.151308015,
               -0.759291768,
               -0.220825821,
               -0.303748697,
               0.583161,
               -0.0372154862,
               0.500668526,
               0.761746585,
               -0.0415057801,
               -0.127594084,
               0.376644433,
               -0.358968049,
               0.214344323,
               -0.501673102,
               -0.314770699,
               -0.211912453,
               -0.680813611,
               -0.45862025,
               -0.0169979446,
               -0.596199214,
               0.0828237236,
               0.375558019,
               -0.610274374,
               0.274182886,
               0.299425811,
               -0.417154,
               -0.253607184,
               -0.262854755,
               -0.586881042,
               -0.247022435,
               0.00998337194,
               0.0143642928,
               -0.0954524502,
               -0.00983674917,
               -0.0321720205,
               -0.00668249745,
               0.00120643678,
               -0.000863923167,
               0.00763657968,
               0.0514434427,
               0.0161756761,
               -0.0485113338,
               0.00699729286,
               0.0414561518,
               -0.0286660232,
               -0.0172466878,
               0.0297083538,
               0.041571714,
               0.0100329034,
               -0.0450644642,
               0.0466323234,
               -0.0613679253,
               0.0249750894,
               -0.0480121374,
               0.053630922,
               -0.0283514839,
               -0.0202918556,
               -0.0154830245,
               0.0263291933,
               -0.0156762656,
               0.0102898339,
               -0.03313,
               -0.0434693433,
               0.0540911369,
               -0.0219283551,
               0.0478655696,
               0.0604881607,
               0.0185495038,
               0.00123813807,
               -0.0511402972,
               -0.0175405499,
               0.0300620571,
               0.0334330313,
               -0.0058089,
               -0.0892131776,
               -0.0194435269,
               -0.0609464608,
               -0.0229163431,
               -0.0451788828,
               -0.00835672207,
               0.0306742433,
               0.0365685932,
               -0.0701150224,
               -0.14034234,
               -0.0081866,
               0.0791667178,
               -0.0451675132,
               0.0819594413,
               -0.0184660498,
               -0.000323799817,
               -0.0281824153,
               -0.0862679332,
               -0.0125118196,
               0.00916602649,
               -0.0471481457,
               -0.0381271765,
               0.0447284952,
               0.0301349498,
               -0.0215861946,
               -0.147660211,
               -0.0564758517,
               -0.0528562851,
               -0.00178415433,
               -0.0979856178,
               0.0556331314,
               -0.00598558597,
               -0.0256567746,
               -0.0486445427,
               -0.0449295454,
               0.00448844722,
               0.035915,
               -0.166423395,
               0.0365243368,
               0.0680103153,
               -0.0363386385,
               0.0241026171,
               -0.00789288338,
               -0.0814359933,
               0.0374571048,
               -0.013009551,
               -0.0118266046,
               -0.0263780765,
               0.0375092067,
               -0.0219384581,
               0.00826968718,
               0.00873471145,
               0.0285787247,
               -0.0500715971,
               0.00824289583,
               0.0210356601,
               -0.0220795423,
               0.0470645167,
               -0.0112260748,
               -0.0160005651,
               -0.0677144825,
               -0.00689937035,
               -0.171350777,
               -0.0284786951,
               0.0154602593,
               0.0472011529,
               0.00550677953,
               -0.0549899414,
               -0.0108319698,
               0.0401211791,
               -0.0323429145,
               -0.00742494781,
               -0.0338094346,
               0.0286911931,
               -0.012446519,
               -0.0124801183,
               -0.0833745822,
               -0.0460441895,
               -0.0582249537,
               -0.00665609771,
               0.0516922139,
               0.00812387094,
               0.0145969428,
               0.0590607561,
               -0.0434649289,
               0.0464552976,
               -0.0976274237,
               0.117692195,
               -0.0826785192,
               -0.447583079,
               -0.447373211,
               -0.0631476715,
               0.120826475,
               0.0835080147,
               -0.0200812537,
               0.0184885021,
               -0.214823112,
               -0.124092512,
               0.100088656,
               -0.0576827228,
               -0.0375228561,
               -0.174103975,
               0.0399707668,
               -0.059597712,
               0.15131399,
               -3.52720963e-05,
               0.0360507704,
               -0.318334669,
               0.00663281465,
               -0.253111839,
               0.401628643,
               -0.630962729,
               -0.342374951,
               -0.198621541,
               -0.115188234,
               -0.151349649,
               0.0537308343,
               -0.0834490582,
               0.0800331533,
               -0.0957339853,
               0.0521529205,
               0.0741614103,
               -0.207315117,
               -0.0149610229,
               -0.0490942709,
               0.126411542,
               0.320206165,
               0.0246490259,
               0.00957895815,
               -0.242872566,
               -0.305948853,
               0.0260069445,
               -0.0311672799,
               -0.107749648,
               -0.00285251788,
               -0.0915941894,
               0.0246847924,
               -0.52576822,
               -0.270265222,
               -0.0596202686,
               -0.204907596,
               -0.225358397,
               -0.0442590863,
               0.00618961593,
               -0.00737338,
               -0.259136617,
               0.0416948348,
               -0.375124782,
               -0.36305958,
               -0.0447554551,
               -0.05179644,
               -0.0774183869,
               -0.168646753,
               -0.115378849,
               0.000902097207,
               -0.0342236459,
               0.0457611047,
               0.0900119841,
               -0.0443039462,
               -0.154566556,
               0.0768141821,
               -0.13095814,
               0.0894335657,
               -0.0591857955,
               0.00708657,
               0.0921641514,
               -0.219010249,
               0.0165619534,
               -0.0228566024,
               -0.00713175815,
               -0.0447346531,
               -0.0190877784,
               0.0905201361,
               0.0158924535,
               -0.0170236938,
               -0.0894103572,
               -0.127097219,
               0.0240661874,
               0.0729423091,
               -0.00208751741,
               -0.0749122202,
               -0.117680281,
               0.0341207497,
               -0.0628404841,
               0.0420342423,
               -0.027609624,
               0.0772092119,
               0.00906846114,
               0.0833966956,
               -0.072375752,
               -0.0197206568,
               -0.0716746822,
               -0.10380014,
               -0.0361548141,
               0.11918442,
               0.0504271388,
               0.00303676701,
               0.0230028126,
               0.0441786274,
               -0.02675144,
               -0.00360914343,
               0.0103679653,
               0.038417507,
               0.141068637,
               -0.372344196,
               0.00336506707,
               0.0773637667,
               -0.0510763638,
               -0.0100145293,
               -0.0121392412,
               -0.0135617,
               0.00157573365,
               -0.0927493647,
               -0.0535282195,
               -0.0962690637,
               0.0397094078,
               -0.0877670795,
               -0.147380546,
               -0.353833407,
               -0.0562544577,
               -0.0676122159,
               -0.452556342,
               0.0164951589,
               -0.414165765,
               -0.00801579934,
               -0.107485831,
               -0.0127192056,
               -0.0958465934,
               0.0187063701,
               -0.386985809,
               0.070742093,
               -0.0786946118,
               0.144866586,
               0.0475094542,
               -0.0747326165,
               -0.246461898,
               -0.0579083525,
               0.138425574,
               -0.125038087,
               -0.204851553,
               -0.269126892,
               -0.209057555,
               -0.0683815256,
               -0.125546724,
               -0.162140638,
               -0.0669190958,
               -0.121640809,
               0.07679528,
               -0.186962366,
               0.0865055472,
               -0.121725142,
               -0.362620682,
               -0.304213881,
               -0.25020647,
               0.0484928861,
               0.0494075,
               -0.0106267221,
               0.0373366363,
               -0.064421542,
               0.0237872731,
               0.0764476061,
               -0.0242042448,
               -0.0275613237,
               0.0237637945,
               -0.205739647,
               -0.117586784,
               -0.497610211,
               -0.25636062,
               -0.152406693,
               0.0409791395,
               0.0189407412,
               0.0935646147,
               -0.027084535,
               -0.291194052,
               0.0293391049,
               -0.0598155297,
               -0.0403599553,
               0.04973308,
               0.0392381921,
               -0.000933665782,
               0.0462617911,
               -0.0271756928,
               -0.035387747,
               0.0569435582,
               -0.0214001201,
               0.0229461491,
               -0.0471339151,
               -0.0144334631,
               0.0389591046,
               -0.0289610196,
               -0.012545174,
               -0.0532358,
               0.0212353803,
               -0.0270823352,
               -0.0304905102,
               -0.00814541429,
               -0.0198666789,
               0.0365915447,
               -0.0332674272,
               -0.0018719025,
               0.0392580666,
               0.0134996781,
               -0.0129484581,
               0.0400176048,
               0.0250576735,
               0.0137591809,
               0.0466853715,
               0.049924,
               -0.00608355831,
               -0.0484956652,
               -0.0212080274,
               -0.0265972875,
               -0.0136192795,
               -0.0380928814,
               0.0110519323,
               -0.00939929392,
               0.041492559,
               0.0470554903,
               0.00357527379,
               -0.0403745957,
               0.000492060091,
               0.0535716787,
               -0.00319267251,
               0.00209782086,
               -0.0244454443,
               -0.0187588036,
               -0.0102621932,
               -0.0252940897,
               0.00192170776,
               0.0316940248,
               -0.00574315898,
               0.00154226972,
               0.0221641473,
               -0.0175655615,
               0.0407327376,
               0.0357939787,
               -0.0468976758,
               -0.0311895907,
               -0.00896155834,
               -0.0427796468,
               -0.0198419318,
               0.0121812029,
               0.0167527683,
               -0.0155962063,
               0.036258962,
               -0.0668194816,
               -0.07337109,
               0.0297547542,
               0.0594133288,
               0.0081195,
               -0.00939434301,
               -0.0784107521,
               0.0176908672,
               -0.0175906084,
               -0.0143953841,
               0.00878288504,
               0.111564308,
               -0.0596099049,
               0.00239828648,
               -0.0363305323,
               -0.0161728039,
               0.0568518192,
               -0.0024707648,
               -0.0879720226,
               -0.0728300437,
               0.0164553206,
               0.000921564293,
               -0.0915064514,
               0.0334616527,
               -0.0132157961,
               -0.00825754739,
               -0.0339683741,
               -0.00531589845,
               -0.0133385472,
               -0.100383915,
               -0.054891061,
               -0.0348636098,
               -0.00778918713,
               0.000358908903,
               -0.0129307825,
               -0.0558782481,
               -0.172356263,
               -0.0526362024,
               0.0523905866,
               -0.046365682,
               -0.0231977366,
               0.0120774722,
               -0.0376902148,
               0.014082416,
               -0.0137620792,
               -0.0152352769,
               0.0885594711,
               -0.0213038363,
               0.0852335915,
               0.00786582474,
               0.0451087356,
               0.0763830543,
               0.0336247571,
               0.0817009,
               0.070843704,
               -0.0560863204,
               -0.0199527219,
               -0.0368171483,
               -0.0706155896,
               -0.055093307,
               -0.0610331483,
               -0.0832496062,
               -0.0892584622,
               0.022968838,
               -0.167042583,
               -0.0355186537,
               -0.125368237,
               -0.0488698706,
               -0.0894673318,
               -0.0223402195,
               -0.197083205,
               -0.0362008139,
               -0.0818774551,
               0.0303291418,
               -0.0588780083,
               -0.00114031765,
               -0.0141324289,
               -0.000793517509,
               -0.0592804961,
               0.00331568741,
               -0.0253021754,
               0.0321391635,
               -0.128075,
               -0.0171011612,
               -0.111920357,
               -0.178376898,
               -0.0293385461,
               -0.0924834087,
               0.00505093345,
               -0.017252231,
               -0.0631025359,
               -0.0540409,
               -0.0481480546,
               -0.040675994,
               -0.0660456866,
               -0.0644561872,
               0.0253935419,
               -0.0732922405,
               -0.0837683678,
               -0.11944636,
               -0.161686331,
               0.0151124634,
               -0.00395141123,
               -0.000967475062,
               -0.0237778872,
               -0.0630188286,
               -0.0751547292,
               -0.00320427632,
               0.0140430667,
               0.0633175,
               -0.0661797449,
               0.0694133267,
               -0.258992761,
               -0.107257716,
               -0.0943515226,
               -0.0680901706,
               -0.118416697,
               -0.0770420358,
               -0.0437615849,
               -0.0307472087,
               -0.298268586,
               -0.0383010544,
               0.04053187,
               -0.0746072605,
               0.019649338,
               0.186080456,
               0.027224388,
               -0.00642673578,
               -0.0685802475,
               -0.0688877106,
               -0.0681219697,
               0.0118211638,
               0.224507242,
               -0.023563657,
               -0.0650903583,
               0.00520317908,
               0.014633663,
               -0.0147447856,
               0.00734369317,
               -0.0923643559,
               0.0136375986,
               -0.0373265408,
               -0.0488454364,
               0.0195354074,
               -0.0832119808,
               0.0309995785,
               -0.116101794,
               -0.0552089587,
               -0.0960477516,
               -0.0841430947,
               -0.0359333,
               -0.0349090025,
               0.0600708835,
               0.0134599954,
               -0.0261067152,
               -0.014911253,
               -0.0297035109,
               -0.0422217213,
               0.0491278842,
               0.00201070076,
               -0.0467590541,
               -0.0489480682,
               -0.153700173,
               -0.0560080111,
               -0.0914250538,
               -0.00819748826,
               -0.0365426503,
               -0.107413024,
               0.000380784157,
               0.031283088,
               -0.0360929444,
               -0.0499878228,
               0.0450086817,
               -0.0334057882,
               0.0249563362,
               -0.139068708,
               -0.113818735,
               -0.0476632826,
               0.00516046863,
               -0.028327113,
               -0.11277242,
               -0.0274322033,
               -0.035773471,
               -0.0319006443,
               -0.331442565,
               -0.0187314413,
               -0.0569295362,
               -0.111687757,
               -0.0696862116,
               -0.0175269302,
               -0.0802703425,
               -0.111910895,
               -0.2577537,
               0.0172416419,
               -0.104297191,
               -0.257652819,
               0.0323351063,
               -0.00129122706,
               -0.325779468,
               -0.163584009,
               -0.169822812,
               -0.0699685663,
               0.09457542,
               0.0398020446,
               0.0118913222,
               -0.0573903732,
               -0.0272815861,
               0.0739401,
               -0.00450172648,
               0.0656263828,
               0.0019519378,
               -0.00225308305,
               -0.00228383043,
               0.410847753,
               -0.045382496,
               -0.117849097,
               -0.141461909,
               0.0269727893,
               -0.0980101377,
               -0.0656280667,
               -0.173690826,
               -0.127161354,
               -0.0597240403,
               0.0336541869,
               -0.0184618793,
               -0.0787362307,
               0.045690909,
               -0.140452385,
               -0.213100463,
               0.0243845712,
               0.0599208102,
               0.14833878,
               0.0795989856,
               0.0570231676,
               -0.223534033,
               0.0894799381,
               -0.0270863064,
               0.014242989,
               0.00760277826,
               0.0550229102,
               -0.00886723,
               0.0358223282,
               0.0165748093,
               -0.0339188278,
               0.0990512371,
               0.184836984,
               0.0263116583,
               0.0135157239,
               0.121888772,
               -0.0551952943,
               -0.378598392,
               -0.183574215,
               0.0262556747,
               0.0178300459,
               0.0249015577,
               -0.0400744751,
               0.0274785813,
               -0.018228706,
               0.0671307892,
               0.00724476436,
               0.00606174907,
               -0.00254388433,
               0.0369468071,
               0.0196646843,
               -0.049803935,
               0.00122248614,
               -0.13180925,
               0.0232920963,
               0.0297124237,
               0.0213338956,
               -0.00972635392,
               -0.0777740404,
               -0.00451334566,
               -0.0808073953,
               0.0061891037,
               -0.0290770121,
               -0.00657263491,
               -0.0360734873,
               0.0483388305,
               0.0795244426,
               -0.0271440372,
               -0.0245087072,
               -0.00602254458,
               -0.0618094578,
               -0.077346392,
               0.0140070077,
               -0.0490538925,
               -0.0197172798,
               0.0295826569,
               0.013873294,
               0.0442763939,
               -0.00649734214,
               0.113297187,
               -0.0365918875,
               -0.0076971692,
               -0.0569744334,
               -0.0203886461,
               0.0326799899,
               -0.0386175811,
               -0.0172908753,
               -0.0336584672,
               -0.00414816337,
               0.0255271979,
               -0.00894544274,
               -0.0282058399,
               -0.0464505143,
               0.0216701,
               -0.090242967,
               -0.0650104657,
               -0.015474258,
               -0.0257911664,
               0.0334400758,
               -0.0470545813,
               -0.0831102058,
               0.0388381295,
               -0.0564754,
               0.0294928327,
               -0.0451514125,
               -0.0365577526,
               0.0529658049,
               -0.0375999138,
               0.000614165561,
               -0.0468613766,
               -0.0017771041,
               -0.0530122183,
               0.206446335,
               -0.0925253332,
               -0.129595831,
               -0.0101699717,
               0.0282975677,
               0.0693928376,
               -0.0990165547,
               -0.0411971733,
               0.102135271,
               -0.0779081732,
               0.0719741434,
               -0.126615316,
               -0.0623637661,
               0.0524878912,
               0.00915579498,
               -0.0400400683,
               -0.320023119,
               -0.0713744611,
               0.0689976811,
               -0.05707426,
               -0.147154123,
               -0.241367772,
               0.0275634304,
               0.0857973248,
               0.0350512937,
               -0.028939819,
               -0.0637803897,
               0.00492613297,
               0.0230041668,
               -0.0972320884,
               -0.119089268,
               0.187551081,
               0.198635429,
               0.105041347,
               0.00335951243,
               -0.0461787805,
               0.00356984604,
               -0.0945295393,
               -0.0210522339,
               0.0266137458,
               -0.0552049875,
               0.0135563314,
               0.0600854158,
               0.0340215452,
               -0.109253109,
               0.0640157834,
               0.110713862,
               -0.0334953032,
               0.0602454469,
               -0.0270992965,
               -0.0138688888,
               0.0224238243,
               -0.0305749737,
               0.0310569778,
               -0.210273623,
               0.0193067342,
               0.0150167607,
               -0.0177085493,
               0.0132016065,
               0.148745403,
               -0.00380706647,
               -0.0382024832,
               0.0213480387,
               0.0365171283,
               0.0180642325,
               -0.0605817065,
               -0.0883569121,
               0.00825211313,
               -0.0737685785,
               -0.242165536,
               -0.0563010834,
               -0.129025608,
               -0.121862769,
               -0.0484825857,
               0.020075174,
               0.00978240184,
               -0.0205147937,
               -0.0220966302,
               -0.0435385965,
               0.0400117263,
               -0.185904905,
               0.0226518717,
               0.010850003,
               0.00826889742,
               -0.00242477935,
               -0.0927810818,
               -0.036915265,
               0.0591998398,
               -0.0420076288,
               0.0679610074,
               -0.041826237,
               0.0463697538,
               -0.0254039615,
               -0.0227378439,
               0.0288754608,
               -0.243109524,
               0.0213105362,
               -0.0937196538,
               -0.0161880795,
               -0.0154033713,
               -0.12134169,
               -0.119727656,
               0.0279872119,
               -0.0407574177,
               -0.012798192,
               0.00128548848,
               0.0104164276,
               0.0137395198,
               -0.0133680645,
               0.00880357344,
               0.0643169209,
               -0.0678648427,
               0.00227583107,
               -0.0469940417,
               0.00468767621,
               -0.00113890099,
               -0.0706409812,
               0.0660967082,
               0.0332742445,
               -0.0476954728,
               0.0494542681,
               -0.10406974,
               0.0135617657,
               -0.0368110836,
               -0.105931878,
               -0.00946814567,
               -0.204641327,
               0.231293499,
               0.182613254,
               -0.207456991,
               -0.0725968555,
               -0.0546783656,
               -0.188269198,
               -0.375753134,
               -0.021552328,
               -0.189408854,
               0.314997286,
               0.0126378061,
               -0.0512628,
               -0.00946622621,
               0.275378346,
               -0.0134306476,
               -0.0158082601,
               -0.0346382,
               0.438243389,
               -0.08889772,
               -0.0838922262,
               -0.00496437307,
               0.0855077729,
               -0.00540548563,
               -0.27390787,
               0.0179311186,
               -0.109717563,
               0.0340282321,
               -0.0830042139,
               0.0244551022,
               -0.134644657,
               0.0766217932,
               -0.0193124339,
               -0.0214042626,
               -0.20768787,
               0.0215704422,
               -0.025028212,
               -0.00280504883,
               -0.0866423324,
               -0.198179066,
               -0.0459191315,
               0.0192884095,
               0.0167405512,
               0.0409783162,
               -0.0397922061,
               -0.0721058324,
               0.111270979,
               0.139268085,
               -0.124841332,
               -0.0460290685,
               0.0974035859,
               0.0427941233,
               0.0151484851,
               -0.0173806809,
               -0.240943149,
               -0.125360116,
               -0.046729371,
               -0.0178611875,
               0.0410278291,
               0.0289475452,
               -0.0184111744,
               0.0553173237,
               -0.0368653461,
               -0.00243856478,
               -0.0406100415,
               0.00633682963,
               0.0765102953,
               0.0124358479,
               0.00480180187,
               0.00385743682,
               -0.0227488726,
               -0.0764820278,
               0.00615871558,
               -0.014382856,
               -0.0335900076,
               0.0197001155,
               0.042500522,
               -0.0417567864,
               0.0145622874,
               0.0156468097,
               0.0279396176,
               0.00210093497,
               0.0950763226,
               -0.0101710716,
               -0.0594226681,
               0.0269404612,
               -0.0241534673,
               0.089821443,
               -0.0194878094,
               -0.00180084771,
               0.0278447941,
               0.0189687107,
               -0.0430949517,
               0.0398085639,
               -0.00558866654,
               -0.0843144581,
               -0.0449316911,
               0.0879951,
               -0.168869168,
               -0.0748296753,
               0.0384791568,
               0.0318708532,
               -0.04219798,
               -0.0367138907,
               0.0544971079,
               -0.00294637796,
               -0.0295873955,
               0.00549305743,
               -0.0402423963,
               -0.0264849849,
               0.0171439424,
               0.0452584624,
               0.0105511937,
               -0.00369201205,
               -0.00257901661,
               -0.0298286192,
               0.047438547,
               0.0780646279,
               0.0292149335,
               0.0157831926,
               0.0536363497,
               0.0197046511,
               -0.0110456543,
               -0.0229590368,
               -0.0657658949,
               -0.0572079,
               0.053139329,
               -0.0754836947,
               0.0150492294,
               -0.04351658,
               0.210417435,
               0.0765087381,
               0.0446558408,
               0.00588001264,
               0.0432757065,
               0.0343592316,
               0.0436074,
               0.10294155,
               -0.00421394315,
               0.00621889951,
               -0.0282723699,
               -0.00656889891,
               0.00351348869,
               -0.0471275859,
               -0.0169102717,
               -0.00544830831,
               0.176448897,
               0.000257011,
               -0.0803444088,
               0.0473837815,
               -0.0229586884,
               0.083011061,
               0.0334636718,
               0.0609357581,
               0.0382344052,
               0.0561380535,
               -0.0181834511,
               0.0236273576,
               -0.0236402452,
               -0.0418400876,
               -0.0214915108,
               0.0740746185,
               -0.069408752,
               -0.0503605455,
               -0.0191726219,
               0.048639413,
               -0.0211237837,
               0.0911904201,
               -0.0259315874,
               0.0684083775,
               0.00845291559,
               -0.0162635259,
               0.0277180299,
               -0.0455670133,
               -0.0475452095,
               -0.0346018709,
               0.106486984,
               -0.0417580083,
               -0.0886304602,
               -0.0190595873,
               -0.00406154199,
               0.00964726321,
               -0.0354327708,
               -0.0281753689,
               -0.0241146069,
               -0.0203517545,
               -0.0188024621,
               0.0242662374,
               0.0556434728,
               -0.0988716,
               0.064715,
               -0.0639788359,
               -0.0371228456,
               -0.124480061,
               0.0795100927,
               0.105612457,
               -0.130497545,
               -0.115471266,
               -0.0861590207,
               -0.0570224747,
               -0.0564943515,
               -0.0148637826,
               0.0305212848,
               -0.0648284107,
               0.0541824214,
               0.0023719864,
               -0.0713748783,
               0.0605456941,
               -0.0282804836,
               0.0196433719,
               -0.314804077,
               0.0681648925,
               0.0001161174,
               -0.0717199296,
               -0.0831744224,
               0.0261621941,
               -0.0174789168,
               -0.0472182184,
               -0.000633544289,
               -0.00567445066,
               -0.0383872129,
               0.116960764,
               -0.00731650926,
               -0.00919824,
               -0.019846661,
               -0.140045717,
               -0.0957828686,
               -0.0412790328,
               -0.120862499,
               0.058468096,
               -0.133319899,
               -0.0475763269,
               0.0322784521,
               -0.0234885402,
               0.0244693756,
               -0.0312079675,
               0.0335525051,
               -0.0454629101,
               -0.0170167573,
               0.0232514981,
               0.0536277853,
               -0.113964863,
               -0.0630302727,
               -0.0900385827,
               0.0712097287,
               0.0955742672,
               -0.137444839,
               -0.0541398637,
               -0.183311537,
               -0.054824166,
               -0.0513711311,
               0.0784395039,
               -0.0284200478,
               -0.14439638,
               0.0675330907,
               0.00222935365,
               -0.0938457102,
               -0.0348624,
               0.0311181229,
               0.163595259,
               -0.107969694,
               -0.0106298253,
               0.00950121321,
               0.10364566,
               -0.00311759533,
               -0.112441935,
               -0.141693905,
               -0.0334729217,
               -0.0672565475,
               0.0555953905,
               -0.0228010491,
               -0.0914701447,
               0.0477132238,
               -0.0317835584,
               0.114883922,
               -0.117425516,
               -0.0626958609,
               -0.118309051,
               0.0320128612,
               0.0101231597,
               0.0174191948,
               0.230896562,
               -0.187058181,
               -0.0503981225,
               0.126996517,
               -0.087951161,
               0.0188903362,
               0.0434215441,
               -0.094953008,
               -0.0889251828,
               0.179386467,
               0.0934183225,
               0.0382094756,
               0.0276915841,
               -0.0339474231,
               -0.11423672,
               0.0213667899,
               0.043058686,
               0.0624930821,
               0.0650769472,
               -0.0948245674,
               -0.0930492,
               -0.0266216695,
               0.110202618,
               -0.0781641901,
               -0.0782869682,
               -0.118352316,
               0.0396740101,
               0.0407864638,
               -0.178232804,
               0.00732321758,
               0.0837098509,
               -0.0342984758,
               0.0153735084,
               0.0187438298,
               -0.034654662,
               -0.0236723032,
               0.000798592344,
               0.0523991622,
               -0.0509896576,
               -0.0171296373,
               -0.160177603,
               -0.391878128,
               -0.0013694131,
               0.0541294478,
               0.0243982356,
               -0.0201255754,
               -0.114321575,
               0.0684664771,
               0.133312598,
               -0.0567140393,
               0.080653511,
               -0.0239734333,
               0.0526802838,
               -0.00469085202,
               -0.0150773376,
               0.00807857886,
               0.0277870875,
               -0.303237498,
               0.0278354809,
               -0.0738201365,
               0.107961975,
               0.0210990552,
               0.00409277948,
               -0.0349811,
               -0.0478285663,
               -0.0279001053,
               0.0175266173,
               0.00224715,
               0.061995659,
               0.0645574629,
               -0.000489146682,
               0.032611914,
               0.113557421,
               -0.132294118,
               -0.118507892,
               -0.00668622879,
               0.00480406312,
               0.0476056077,
               0.0802425891,
               -0.0267656874,
               -0.0602413341,
               0.0466467626,
               -0.0239337012,
               0.00122284144,
               0.0413664877,
               -0.0325269289,
               0.000592797238,
               0.0357172266,
               0.0131299458,
               -0.167168245,
               0.00444692094,
               -0.016916573,
               0.000681464153,
               -0.0497619286,
               0.00381450681,
               -0.0769876689,
               0.0472251885,
               0.0743818954,
               -0.0172054563,
               -0.0217015967,
               -0.0330780931,
               0.0324774124,
               -0.0453001037,
               0.0942131355,
               -0.0518764518,
               -0.180424452,
               0.0617802218,
               -0.0704635084,
               -0.0166100748,
               -0.0169254225,
               0.109062,
               0.0412638783,
               0.00888530351,
               -0.0593576543,
               -0.0552848652,
               0.0277695488,
               0.011779882,
               0.0139789488,
               0.0619075745,
               -4.11695801e-05,
               0.0211335234,
               -0.0345657691,
               0.0140543478,
               -0.068777971,
               0.134875312,
               -0.0420175306,
               -0.136224315,
               -0.00306312717,
               -0.0323992372,
               -0.00344873639,
               -0.0362115949,
               -0.145356148,
               0.0510451794,
               -0.0388326608,
               0.00141669973,
               0.00724014,
               -0.0475870483,
               -0.160560787,
               -0.0278159082,
               -0.0976004,
               -0.0551750176,
               0.000557505758,
               -0.0401276164,
               0.0241277218,
               -0.0239228699,
               0.0342771336,
               0.0287324525,
               0.023502877,
               -0.000923992717,
               0.0774410143,
               0.032277327,
               0.0466451533,
               0.00666564191,
               -0.148908257,
               -0.0165507942,
               0.0069280332,
               0.05192459,
               -0.0124532385,
               -0.10179428,
               -0.00437095109,
               0.121796459,
               0.029654853,
               0.0173644163,
               -0.0175779313,
               0.105935141,
               -0.0407508276,
               -0.0542356558,
               -0.240781203,
               -0.339312375,
               -0.028972609,
               -0.346954286,
               -0.162662223,
               -0.181582093,
               -0.0803612471,
               -0.0152707063,
               0.0584457554,
               0.0545903929,
               -0.1080762,
               0.0933383107,
               -0.0389279202,
               0.0829552338,
               0.0282929856,
               -0.100906417,
               -0.061899554,
               0.0247537829,
               -0.334332228,
               0.0744780898,
               -0.174694583,
               0.175679594,
               -0.0913187861,
               -0.0295063127,
               0.09889175,
               -0.0823904127,
               -0.0631208,
               0.0286989212,
               -0.217786536,
               -0.0618062802,
               -0.0374855809,
               0.0214463696,
               -0.182427704,
               0.0846753195,
               -0.139321715,
               -0.00613650773,
               -0.062138319,
               -0.0311334282,
               0.0678354949,
               -0.133793324,
               -0.00227659987,
               -0.0117015354,
               0.123743527,
               0.0848887488,
               -0.071568042,
               -0.0598182604,
               0.0373158939,
               -0.188047558,
               -0.0306840893,
               -0.0256986581,
               0.194432825,
               0.00286286091,
               -0.0638965443,
               -0.00505000586,
               -0.019255938,
               -0.294341892,
               0.0135315303,
               0.0467891544,
               0.0520233,
               -0.0229365546,
               -0.0339361206,
               0.0369342454,
               -0.0988627747,
               0.0168602448,
               -0.0121118,
               -0.00496676611,
               -0.0451641418,
               -0.0639397204,
               0.110970922,
               0.0783929899,
               0.069733426,
               0.0125101516,
               0.0290913824,
               0.02600074,
               0.033823885,
               -0.0226581097,
               -0.0455144607,
               -0.00979713164,
               0.0904305652,
               0.0517455898,
               -0.0475049093,
               -0.0604551844,
               0.178647727,
               -0.0528229773,
               -0.236178592,
               0.0807481408,
               0.0800170526,
               -0.0279870611,
               0.0593344793,
               0.0582006574,
               -0.0214383211,
               0.0162575766,
               0.0431768484,
               0.0760717317,
               -0.0122561343,
               -0.0382851958,
               -0.0674775764,
               0.0585833155,
               0.105252743,
               -0.0443269312,
               -0.0658909678,
               0.0373108909,
               0.0627905205,
               0.0527479686,
               0.0209174789,
               0.0121151917,
               0.0370919034,
               -0.0141301909,
               0.0531064942,
               0.0163844451,
               0.0415924042,
