{
 "irVersion": "6",
 "opsetImport": [],
 "producerName": "tenncor",
 "producerVersion": "1.0.0",
 "domain": "com.tenncor.eteq",
 "modelVersion": "6",
 "docString": "",
 "graph": {
  "node": [
   {
    "input": [
     "_i0"
    ],
    "output": [
     "558"
    ],
    "name": "558",
    "opType": "_GRU_LAYER",
    "domain": "",
    "attribute": [
     {
      "name": "layer",
      "refAttrName": "",
      "docString": "",
      "type": "GRAPH",
      "f": 0,
      "i": "0",
      "s": "",
      "g": {
       "node": [
        {
         "input": [
          "_i0"
         ],
         "output": [
          "1"
         ],
         "name": "1",
         "opType": "SLICE",
         "domain": "",
         "attribute": [
          {
           "name": "dimension_pairs",
           "refAttrName": "",
           "docString": "",
           "type": "INTS",
           "f": 0,
           "i": "0",
           "s": "",
           "floats": [],
           "ints": [
            "0",
            "65535",
            "0",
            "1",
            "0",
            "65535",
            "0",
            "65535",
            "0",
            "65535",
            "0",
            "65535",
            "0",
            "65535",
            "0",
            "65535"
           ],
           "strings": [],
           "tensors": [],
           "graphs": [],
           "sparseTensors": []
          }
         ],
         "docString": ""
        },
        {
         "input": [
          "1",
          "2"
         ],
         "output": [
          "3"
         ],
         "name": "3",
         "opType": "CONCAT",
         "domain": "",
         "attribute": [
          {
           "name": "rank",
           "refAttrName": "",
           "docString": "",
           "type": "INT",
           "f": 0,
           "i": "0",
           "s": "",
           "floats": [],
           "ints": [],
           "strings": [],
           "tensors": [],
           "graphs": [],
           "sparseTensors": []
          }
         ],
         "docString": ""
        },
        {
         "input": [
          "3"
         ],
         "output": [
          "8"
         ],
         "name": "8",
         "opType": "_DENSE_LAYER",
         "domain": "",
         "attribute": [
          {
           "name": "layer",
           "refAttrName": "",
           "docString": "",
           "type": "GRAPH",
           "f": 0,
           "i": "0",
           "s": "",
           "g": {
            "node": [
             {
              "input": [
               "3",
               "4"
              ],
              "output": [
               "5"
              ],
              "name": "5",
              "opType": "MATMUL",
              "domain": "",
              "attribute": [
               {
                "name": "rank_pairs",
                "refAttrName": "",
                "docString": "",
                "type": "INTS",
                "f": 0,
                "i": "0",
                "s": "",
                "floats": [],
                "ints": [
                 "0",
                 "1"
                ],
                "strings": [],
                "tensors": [],
                "graphs": [],
                "sparseTensors": []
               }
              ],
              "docString": ""
             },
             {
              "input": [
               "6"
              ],
              "output": [
               "7"
              ],
              "name": "7",
              "opType": "EXTEND",
              "domain": "",
              "attribute": [
               {
                "name": "tensor",
                "refAttrName": "",
                "docString": "",
                "type": "TENSOR",
                "f": 0,
                "i": "0",
                "s": "",
                "t": {
                 "dims": [],
                 "dataType": 0,
                 "floatData": [],
                 "int32Data": [],
                 "stringData": [],
                 "int64Data": [],
                 "name": "5",
                 "docString": "",
                 "rawData": "",
                 "externalData": [],
                 "dataLocation": "DEFAULT",
                 "doubleData": [],
                 "uint64Data": []
                },
                "floats": [],
                "ints": [],
                "strings": [],
                "tensors": [],
                "graphs": [],
                "sparseTensors": []
               }
              ],
              "docString": ""
             },
             {
              "input": [
               "5",
               "7"
              ],
              "output": [
               "8"
              ],
              "name": "8",
              "opType": "ADD",
              "domain": "",
              "attribute": [
               {
                "name": "commutative",
                "refAttrName": "",
                "docString": "",
                "type": "STRING",
                "f": 0,
                "i": "0",
                "s": "",
                "floats": [],
                "ints": [],
                "strings": [],
                "tensors": [],
                "graphs": [],
                "sparseTensors": []
               }
              ],
              "docString": ""
             }
            ],
            "name": "",
            "initializer": [
             {
              "dims": [
               "64",
               "128",
               "1",
               "1",
               "1",
               "1",
               "1",
               "1"
              ],
              "dataType": 1,
              "floatData": [
               -0.0537946597,
               -0.0303091425,
               -0.0011853,
               -0.0220626295,
               -0.0238855761,
               0.337448835,
               0.014883494,
               0.0519399308,
               -0.0455800071,
               -0.123788781,
               0.361430854,
               -0.00749968039,
               -0.011587318,
               -0.0499164909,
               -0.0628217459,
               0.0542669445,
               -0.110953182,
               0.0284551661,
               0.0338413902,
               -0.00125332887,
               0.132907122,
               0.0134015214,
               0.02283445,
               0.0381779,
               -0.0389516763,
               0.400065273,
               -0.107445702,
               0.0479685403,
               0.0171021037,
               0.0672356412,
               -0.0945430398,
               -0.00464885216,
               0.0827158093,
               -0.00783578772,
               -6.55392651e-05,
               0.138346583,
               0.0654151142,
               0.00199149945,
               -0.0243120268,
               0.0415419191,
               -0.0328972414,
               -0.0334776118,
               -0.0581840202,
               0.030339241,
               0.0360499062,
               0.00026972458,
               0.214061096,
               -0.0227850191,
               0.220167309,
               0.0296145044,
               0.0822081268,
               -0.05609034,
               0.0275788605,
               -0.0107179899,
               -0.0612187386,
               -0.0448289812,
               0.0121038314,
               -0.103024691,
               -0.0315289833,
               0.092975013,
               0.135820642,
               0.0449269228,
               0.147284925,
               -0.0271831788,
               -0.236211553,
               0.0445872881,
               -0.377599359,
               -0.433311105,
               -0.215980843,
               0.0113950036,
               -0.0597456656,
               -0.447550029,
               0.487539232,
               -0.222372159,
               -0.811181605,
               -0.193147942,
               0.133964807,
               -0.203552142,
               -0.095432,
               -0.562300205,
               -0.106618106,
               0.00913571473,
               -0.169456393,
               0.0361469574,
               -0.0720945373,
               0.0823434293,
               0.413420647,
               -0.246987417,
               -0.00125157414,
               0.0663639307,
               0.307112873,
               -0.543829381,
               0.106449902,
               -0.426887512,
               0.107224211,
               0.217035294,
               -0.602281,
               0.100578152,
               -0.750000656,
               -0.180283472,
               -0.289486557,
               0.557133436,
               -0.0574280284,
               0.481910467,
               0.726929784,
               -0.00332804653,
               -0.108887441,
               0.363455147,
               -0.374110729,
               0.192770615,
               -0.512187541,
               -0.323750526,
               -0.223157808,
               -0.671674728,
               -0.441717029,
               -0.0274062864,
               -0.592568219,
               0.0438464954,
               0.367269158,
               -0.576947451,
               0.23152186,
               0.341706663,
               -0.410096943,
               -0.221502453,
               -0.295266956,
               -0.589446306,
               -0.281650215,
               0.00811025314,
               0.015092006,
               -0.0928418413,
               -0.00877869781,
               -0.0335819907,
               -0.0046079345,
               -0.00372182229,
               0.00214667176,
               0.00636568945,
               0.046692837,
               0.0159291979,
               -0.0594287701,
               -3.35487348e-05,
               0.0446505398,
               -0.029180523,
               -0.0112191569,
               0.031793315,
               0.0439018756,
               0.0105154198,
               -0.0424557067,
               0.0598376803,
               -0.0473184586,
               0.0255880728,
               -0.047485888,
               0.0551735573,
               -0.0294199251,
               -0.026125513,
               -0.00292424089,
               0.0278102718,
               -0.0107182348,
               0.00982723851,
               -0.0357183293,
               -0.0474716052,
               0.0567701384,
               -0.0207080133,
               0.0504770502,
               0.0569842495,
               0.0238665603,
               0.00321147894,
               -0.0498315319,
               -0.0182451922,
               0.0234096833,
               0.0260023791,
               -0.00632460415,
               -0.0840421841,
               -0.0204185043,
               -0.056851279,
               -0.0256051552,
               -0.0441911407,
               -0.0127823539,
               0.0308538973,
               0.0357646383,
               -0.0623522252,
               -0.136013672,
               -0.00389533606,
               0.080986388,
               -0.0497421883,
               0.0644736588,
               -0.0102139972,
               0.000826499308,
               -0.0217751972,
               -0.107789226,
               -0.0109310728,
               0.0115037346,
               -0.0508588292,
               -0.0310714114,
               0.0447407775,
               0.0302108023,
               -0.0218973346,
               -0.143392742,
               -0.0559326969,
               -0.0546688177,
               -0.00307377055,
               -0.0929128528,
               0.0545897856,
               -0.00757514965,
               -0.025432393,
               -0.0475374497,
               -0.0376408733,
               0.00778768351,
               0.036047332,
               -0.142598853,
               0.0370538794,
               0.0670229,
               -0.0287683439,
               0.0228595678,
               -0.00995354168,
               -0.0788455531,
               0.0408948399,
               -0.0136714578,
               -0.0120188007,
               -0.0208703801,
               0.0418869741,
               -0.0177621506,
               0.00853204,
               0.0141780376,
               0.0299824942,
               -0.0457938127,
               0.00709686941,
               0.0212054271,
               -0.025564719,
               0.046472311,
               -0.00925936643,
               -0.0164000373,
               -0.0586730875,
               -0.00571871642,
               -0.15555948,
               -0.0229694508,
               0.00932657346,
               0.0464890152,
               -0.00252497871,
               -0.0493515618,
               -0.00800062716,
               0.0418748036,
               -0.0328100584,
               -0.00704098167,
               -0.0336267762,
               0.0282067358,
               -0.0118505945,
               -0.0155184325,
               -0.0858659744,
               -0.0437863618,
               -0.0562909767,
               -0.00616362877,
               0.0503074,
               0.0121879242,
               0.00805712,
               0.0557574369,
               -0.042503871,
               0.0488783047,
               -0.108123213,
               0.0845391452,
               -0.0864553154,
               -0.501803577,
               -0.479444623,
               -0.0637547523,
               0.132384464,
               0.0686889365,
               -0.00348705309,
               0.0558098108,
               -0.185242847,
               -0.141439,
               0.0564729422,
               -0.0501998849,
               -0.0204152148,
               -0.181955755,
               -0.00551107945,
               -0.0541620106,
               0.144129,
               -0.00078447652,
               0.0426651947,
               -0.310528815,
               0.01417882,
               -0.214450896,
               0.401618183,
               -0.61472857,
               -0.322524846,
               -0.169938356,
               -0.105898604,
               -0.155603349,
               0.0226297,
               -0.0894054845,
               0.0764707923,
               -0.0902618468,
               0.0608934499,
               0.0704492703,
               -0.190216675,
               -0.0137340333,
               -0.0473775454,
               0.0993184671,
               0.325487345,
               0.020122055,
               0.0327482037,
               -0.28853941,
               -0.313850552,
               0.037379805,
               -0.0235490594,
               -0.0674210116,
               0.0162844807,
               -0.097275883,
               0.0116233174,
               -0.513212919,
               -0.263801962,
               -0.0743018463,
               -0.1842,
               -0.184861317,
               -0.0120498147,
               0.0135419276,
               0.00395228248,
               -0.264668614,
               0.0575322583,
               -0.383092672,
               -0.356815845,
               -0.0422117189,
               -0.0432987213,
               -0.0722842813,
               -0.175973132,
               -0.122543432,
               -0.0113299759,
               -0.0332452,
               0.034427464,
               0.0717415884,
               -0.0415035337,
               -0.140229911,
               0.0722531751,
               -0.136795565,
               0.0858057588,
               -0.0636513,
               0.00777961873,
               0.0701956898,
               -0.215086579,
               0.00962873641,
               -0.0194082651,
               -0.00620105444,
               -0.0472454838,
               -0.0207842123,
               0.0832426921,
               0.0127152968,
               -0.0252288617,
               -0.0870078653,
               -0.130925253,
               0.0340730548,
               0.0733692348,
               -0.00289078895,
               -0.0608292,
               -0.102948874,
               0.0338015482,
               -0.0554330871,
               0.0393401794,
               -0.0278548673,
               0.0761490613,
               0.0196049698,
               0.0841595307,
               -0.0761222914,
               -0.00999705,
               -0.0676399,
               -0.0893386155,
               -0.0356501937,
               0.111949146,
               0.0482137,
               0.00288440892,
               0.021294672,
               0.0461651683,
               -0.0264078937,
               -0.00174116855,
               0.00781898,
               0.0373440459,
               0.13987425,
               -0.379599541,
               0.000351170311,
               0.0741482526,
               -0.0480473116,
               -0.00934902951,
               -0.00523610925,
               -0.0155548807,
               -0.00393348699,
               -0.0883369222,
               -0.0581435077,
               -0.102469832,
               0.0253445599,
               -0.08919321,
               -0.170919031,
               -0.354703546,
               -0.0857780129,
               -0.079530634,
               -0.451221883,
               0.0128801782,
               -0.445459872,
               -0.000974506,
               -0.101595797,
               -0.0110959727,
               -0.0957173482,
               0.0240363907,
               -0.351834357,
               0.0848848522,
               -0.0949490517,
               0.163929373,
               0.0591352507,
               -0.0823847279,
               -0.243991658,
               -0.0773311928,
               0.126215339,
               -0.113609135,
               -0.203167692,
               -0.277213544,
               -0.191387206,
               -0.0733500645,
               -0.142806143,
               -0.122055508,
               -0.0800633207,
               -0.106912315,
               0.100903645,
               -0.170105442,
               0.0815210491,
               -0.125008106,
               -0.377818257,
               -0.294839561,
               -0.222410247,
               0.0560562499,
               0.0357419066,
               -0.0128396191,
               0.0153970094,
               -0.0697379485,
               0.00469695544,
               0.0654840842,
               -0.0161368642,
               0.00199837633,
               0.0292739756,
               -0.208489388,
               -0.0914802402,
               -0.492478758,
               -0.24830538,
               -0.169213176,
               0.0450465791,
               0.0464021787,
               0.0916303545,
               -0.0310664903,
               -0.303836346,
               0.0229961015,
               -0.0758138672,
               -0.0307460316,
               0.049895484,
               0.0394359156,
               0.00026601064,
               0.0449729338,
               -0.0268702358,
               -0.0348787159,
               0.0564924404,
               -0.0226535574,
               0.024459118,
               -0.0469364636,
               -0.0115072206,
               0.038964089,
               -0.0285077523,
               -0.0124495486,
               -0.0559421405,
               0.0209676754,
               -0.0271988083,
               -0.0304695126,
               -0.00887174066,
               -0.0199148543,
               0.0364804044,
               -0.0331105776,
               -0.00368075,
               0.0390427522,
               0.0135454824,
               -0.0158531424,
               0.0402070098,
               0.0242628213,
               0.0135208592,
               0.0467127934,
               0.0498501547,
               -0.00560554396,
               -0.0474148206,
               -0.0212143604,
               -0.0266424622,
               -0.0136688268,
               -0.0380064771,
               0.0111379232,
               -0.00960295927,
               0.0414754599,
               0.0470149778,
               0.00415803678,
               -0.0469176099,
               0.00215954403,
               0.0521645,
               -0.00263346,
               0.00192833762,
               -0.0242438447,
               -0.0213471688,
               -0.0103461407,
               -0.0255319551,
               0.00178647239,
               0.0315401778,
               -0.00568714738,
               0.00127170538,
               0.0217764471,
               -0.0170541238,
               0.0415454954,
               0.0356933847,
               -0.0473965518,
               -0.0303382557,
               -0.00895066559,
               -0.0455413461,
               -0.0193656012,
               0.0129285939,
               0.0168258976,
               -0.0134191439,
               0.0282931235,
               -0.0504085831,
               -0.0783352,
               0.0161975529,
               0.0636819899,
               0.00436061621,
               -0.00896020513,
               -0.0780028477,
               0.018696636,
               -0.0295284055,
               -0.0157719366,
               0.00844669249,
               0.108015038,
               -0.0592086837,
               0.0103323311,
               -0.0322221331,
               -0.012226766,
               0.0545383804,
               -0.00169757952,
               -0.0999641493,
               -0.0791987404,
               0.0160717145,
               0.00613506278,
               -0.0777908415,
               0.032436043,
               -0.0287821982,
               -0.00956927892,
               -0.0344189741,
               -0.00586504769,
               -0.00685456488,
               -0.0980206132,
               -0.0641728,
               -0.0280215442,
               -0.0100867255,
               -0.00807919819,
               -0.0236404669,
               -0.0600322932,
               -0.156779513,
               -0.0554124601,
               0.0586577617,
               -0.0492099263,
               -0.0270355791,
               0.00149632723,
               -0.0324397311,
               0.0176917817,
               -0.0129773021,
               -0.0133176139,
               0.088581,
               -0.0200126525,
               0.0899077207,
               0.00712883333,
               0.0527074337,
               0.0760968253,
               0.0394010581,
               0.0851597339,
               0.0749186426,
               -0.0575085208,
               -0.0411873162,
               -0.0368250944,
               -0.0600260347,
               -0.0534207039,
               -0.0623428114,
               -0.074650608,
               -0.0755677521,
               0.0161983818,
               -0.17130518,
               -0.0395802148,
               -0.145954087,
               -0.0489966981,
               -0.0732122734,
               -0.0254338719,
               -0.199743882,
               -0.0429560132,
               -0.075699538,
               0.026833022,
               -0.0655899867,
               -0.00699265767,
               -0.0128519051,
               -0.00249061943,
               -0.0676604658,
               0.00228565,
               -0.0297135282,
               0.0349133424,
               -0.122650877,
               -0.0187258,
               -0.110427111,
               -0.202330783,
               -0.0306253508,
               -0.0907529667,
               0.0196309853,
               -0.0177764352,
               -0.0645217225,
               -0.0517183468,
               -0.0440958813,
               -0.033897128,
               -0.0745172277,
               -0.0632286,
               0.0275543407,
               -0.0929400846,
               -0.0908756182,
               -0.112924449,
               -0.16002582,
               0.017849911,
               0.00089956529,
               0.0115213115,
               -0.0287494063,
               -0.0571838692,
               -0.0720217,
               -0.0107595278,
               0.012519937,
               0.0615261719,
               -0.0631962121,
               0.060568653,
               -0.247593522,
               -0.0992297232,
               -0.0937754,
               -0.0602581166,
               -0.112373009,
               -0.0804347321,
               -0.0481528342,
               -0.0270324964,
               -0.334629029,
               -0.0399328806,
               0.0375540368,
               -0.0767779,
               0.0231106225,
               0.18041487,
               0.0249806494,
               -0.00530010462,
               -0.0829635933,
               -0.0813728347,
               -0.0723306388,
               0.0126355486,
               0.205283374,
               -0.0210364908,
               -0.0694304779,
               0.00421206234,
               0.0144866789,
               -0.0149411513,
               0.0105844345,
               -0.0942408592,
               0.00939768087,
               -0.0429766215,
               -0.051379662,
               0.0177229904,
               -0.0708986297,
               0.0280729868,
               -0.117776088,
               -0.0525195301,
               -0.0898063555,
               -0.10508737,
               -0.0320247,
               -0.0358469,
               0.0453208499,
               0.0125978272,
               -0.0265194047,
               -0.0223097,
               -0.0244819317,
               -0.0426714085,
               0.0450658947,
               0.00011858686,
               -0.0425435565,
               -0.0450869836,
               -0.147129789,
               -0.0536384284,
               -0.0709213912,
               -0.0160528161,
               -0.0419137739,
               -0.101927176,
               -0.00092871103,
               0.0408217162,
               -0.0324034728,
               -0.0439510979,
               0.0412503667,
               -0.0377832614,
               0.0189408306,
               -0.129397675,
               -0.115000248,
               -0.0459390692,
               0.00422308547,
               -0.0318197906,
               -0.11176084,
               -0.0253385343,
               -0.0333610736,
               -0.0258452799,
               -0.328577608,
               -0.0190131832,
               -0.0512069799,
               -0.11033766,
               -0.0925124884,
               -0.0280572101,
               -0.0823815838,
               -0.110562198,
               -0.256394953,
               0.019682534,
               -0.0950605571,
               -0.234962091,
               0.0411822721,
               0.00655657705,
               -0.343488812,
               -0.161494836,
               -0.183015227,
               -0.0526718795,
               0.0919211879,
               0.0414894633,
               0.0266829897,
               -0.0756055117,
               -0.0110496022,
               0.0780087933,
               -0.00604920555,
               0.0534419566,
               -0.00391544541,
               -0.000215496635,
               0.000169466017,
               0.438560367,
               -0.0380684473,
               -0.117471524,
               -0.160202637,
               0.0303992145,
               -0.0852786452,
               -0.0658982098,
               -0.166700512,
               -0.13511309,
               -0.0537369773,
               0.0365128666,
               -0.0248973444,
               -0.0653722,
               0.0227159634,
               -0.155360818,
               -0.193343133,
               0.0411530957,
               0.0810879,
               0.1466939,
               0.0799578205,
               0.0502581,
               -0.225405306,
               0.0865694731,
               -0.0282797012,
               0.0158277359,
               0.00237755082,
               0.0469629839,
               -0.00537080271,
               0.0177535433,
               0.00691136578,
               -0.0563174263,
               0.0962871537,
               0.174006537,
               0.0236262251,
               0.00954289641,
               0.121537007,
               -0.046192877,
               -0.393784434,
               -0.159534737,
               0.0259156767,
               0.0174536612,
               0.0241714418,
               -0.0415417217,
               0.0188987572,
               -0.0193533506,
               0.0618903153,
               0.00469974149,
               0.0106935231,
               0.0202260856,
               0.0474038161,
               0.00836157147,
               -0.0584917255,
               0.000628699316,
               -0.131671041,
               0.0215239674,
               0.0248149447,
               0.00303740986,
               -0.011074964,
               -0.0836295635,
               -0.0061045452,
               -0.0779335797,
               0.00529065123,
               -0.0286468845,
               -0.00595076382,
               -0.00579076586,
               0.0485959537,
               0.0738826543,
               -0.024405174,
               -0.0248272568,
               -0.016781358,
               -0.0656629,
               -0.0857321694,
               0.0133470297,
               -0.0544977672,
               -0.0208188947,
               0.0292300917,
               0.0127667738,
               0.0456329025,
               0.000263191963,
               0.13295348,
               -0.0335215852,
               -0.00270740036,
               -0.0577334389,
               -0.019987544,
               0.0345255844,
               -0.0354017839,
               -0.0173228327,
               -0.0349381,
               -0.00495943381,
               0.0252251066,
               -0.00753982877,
               -0.0287952013,
               -0.0480514653,
               0.0179287177,
               -0.0948664695,
               -0.0596755221,
               -0.0123282131,
               -0.0264375266,
               0.0346145444,
               -0.0536758229,
               -0.0831009522,
               0.0401313938,
               -0.0521527082,
               0.0700056106,
               -0.0595247671,
               -0.0185469743,
               0.0574987568,
               -0.0566562861,
               0.00572305731,
               -0.0435535498,
               -0.00642736442,
               -0.0631733835,
               0.186611637,
               -0.0842954367,
               -0.155623049,
               -0.0118009746,
               0.021075394,
               0.0795385614,
               -0.092940256,
               -0.0464571863,
               0.105998948,
               -0.0754284933,
               0.0751652494,
               -0.123870261,
               -0.0667149648,
               0.0520396605,
               0.0152668292,
               -0.0408946797,
               -0.303392112,
               -0.0684208423,
               0.0726056844,
               -0.0664866939,
               -0.149896488,
               -0.223088712,
               0.050550852,
               0.106039472,
               0.0373932756,
               -0.0381050408,
               -0.0618096665,
               0.00516353454,
               0.0282427985,
               -0.104222327,
               -0.101893693,
               0.166380271,
               0.198135734,
               0.105177343,
               -0.0109581705,
               -0.0488423,
               0.0032160175,
               -0.0964768678,
               -0.0135867279,
               0.0217983611,
               -0.0556788184,
               0.0180650018,
               0.0669175163,
               0.0302233677,
               -0.10559085,
               0.0848603621,
               0.102300465,
               -0.0251548253,
               0.0790463,
               -0.0261120293,
               -0.0110103264,
               0.0315359,
               -0.0220368076,
               0.0232555121,
               -0.206694439,
               0.0183800235,
               0.0139379315,
               -0.0187028535,
               0.0166871566,
               0.144100443,
               -0.00145534868,
               -0.0420290679,
               0.0159609448,
               0.047564473,
               0.0236803,
               -0.0523167625,
               -0.113443956,
               0.00816700608,
               -0.0690926239,
               -0.221877754,
               -0.055847913,
               -0.0794297457,
               -0.106740147,
               -0.0533097908,
               0.0192367937,
               0.0113673853,
               -0.0283866934,
               -0.020392675,
               -0.0446785875,
               0.0370399617,
               -0.178448394,
               0.0213912074,
               0.00609206501,
               0.0283216536,
               0.00241111475,
               -0.0798376873,
               -0.0405998,
               0.0458366424,
               -0.0436983854,
               0.0744519234,
               -0.033991877,
               0.040033821,
               -0.0259356722,
               -0.0140190646,
               0.0353780352,
               -0.243945375,
               0.0100171538,
               -0.0960135609,
               -0.0164726432,
               -0.0182937104,
               -0.12567164,
               -0.120445892,
               0.0260666627,
               -0.0464582,
               -0.0124540059,
               -0.00190215639,
               0.00839720294,
               0.0117582008,
               -0.00574076409,
               -0.000469067367,
               0.0648004189,
               -0.0686546862,
               -0.0195487253,
               -0.045214735,
               0.00343640149,
               0.0385097712,
               -0.0711245,
               0.0467239246,
               0.0393387973,
               -0.0575949363,
               0.0485322587,
               -0.133964926,
               0.0158649441,
               -0.0294605922,
               -0.0901476592,
               0.000326705,
               -0.195286423,
               0.225142151,
               0.180305779,
               -0.182540312,
               -0.054207921,
               -0.0595509782,
               -0.218058392,
               -0.3622379,
               -0.0201889835,
               -0.196413264,
               0.30320853,
               0.00919518527,
               -0.0494610891,
               -0.0107073858,
               0.258627355,
               -0.0191346947,
               -0.0267539471,
               -0.0355404355,
               0.505129695,
               -0.0819765925,
               -0.0713601932,
               -0.0245631114,
               0.100584939,
               -0.00269228499,
               -0.294781983,
               0.0132893212,
               -0.117734037,
               0.0411612689,
               -0.093291983,
               0.0308370721,
               -0.156890854,
               0.069869,
               -0.026287118,
               -0.056673523,
               -0.20672965,
               0.0183952712,
               -0.0247406065,
               0.000828929711,
               -0.0713255331,
               -0.195545554,
               -0.0400848463,
               0.0226763263,
               0.0249257591,
               0.0444679298,
               -0.0355854221,
               -0.0836816356,
               0.0954492688,
               0.125818506,
               -0.119768962,
               -0.0444546901,
               0.0592726395,
               0.037479,
               0.0211600717,
               -0.0375444926,
               -0.26319021,
               -0.129529595,
               -0.00757658714,
               -0.0184220597,
               0.0379972123,
               0.0279485714,
               -0.021196397,
               0.058507815,
               -0.0386555716,
               -0.00122872379,
               -0.0401978232,
               0.00205401704,
               0.0729759112,
               0.0137729533,
               0.00794083811,
               0.0052859392,
               -0.0243373141,
               -0.0854021534,
               0.00841845945,
               -0.0117246378,
               -0.0261850655,
               0.0195016731,
               0.0430095196,
               -0.042378597,
               0.0058888807,
               0.0159829,
               0.0299134366,
               0.00333335577,
               0.0877327919,
               -0.0110003902,
               -0.0579582304,
               0.0422340818,
               -0.0241634492,
               0.0862695202,
               -0.0193334613,
               0.00168841891,
               0.0279516019,
               0.0205056891,
               -0.0422157645,
               0.0367928222,
               -0.00462896144,
               -0.0823835135,
               -0.0523795933,
               0.0815393552,
               -0.169284672,
               -0.0760269612,
               0.0400246233,
               0.0319176689,
               -0.0427925922,
               -0.0358872488,
               0.0521372929,
               -0.00150362367,
               -0.0286377,
               0.00549588725,
               -0.0423177034,
               -0.0209636595,
               0.0218986254,
               0.0413249135,
               0.0130240368,
               -0.00451825513,
               -0.00859095,
               -0.0292171072,
               0.0477106273,
               0.0809197426,
               0.0307009816,
               0.0109551,
               0.0488417856,
               0.00637192186,
               -0.0127073955,
               -0.0201610439,
               -0.0678670928,
               -0.0629805103,
               0.0514551736,
               -0.0641325787,
               0.0143346163,
               -0.039166145,
               0.21011354,
               0.0822179914,
               0.0726892054,
               0.00759444945,
               0.0477908514,
               0.0321459845,
               0.040351063,
               0.0946738273,
               0.00284331525,
               0.00434256159,
               -0.0244715605,
               -0.00805715472,
               0.00374076865,
               -0.0447880737,
               -0.0112998402,
               -0.0058682235,
               0.177070022,
               0.00210006186,
               -0.0848774239,
               0.0505621471,
               -0.020844847,
               0.0787482485,
               0.0216768328,
               0.0661914498,
               0.0393129177,
               0.0598062612,
               -0.0197439287,
               0.0244171657,
               -0.0279448852,
               -0.0445235372,
               -0.027170701,
               0.0898737758,
               -0.0746054202,
               -0.0560833961,
               -0.01630334,
               0.0487817563,
               -0.0191410817,
               0.0876574442,
               -0.0254213512,
               0.0688990876,
               0.00877439138,
               -0.0181806441,
               0.029227607,
               -0.0479550436,
               -0.0483719297,
               -0.0381016,
               0.106259041,
               -0.0416908488,
               -0.0777732357,
               -0.0184399,
               -0.00250856439,
               0.00784464367,
               -0.0330447853,
               -0.0287281051,
               -0.024899032,
               -0.0286180247,
               -0.0243887175,
               0.0185912251,
               0.0556802787,
               -0.0955722,
               0.0643679798,
               -0.0685783401,
               -0.0241862461,
               -0.12104512,
               0.0686802417,
               0.111275017,
               -0.102038,
               -0.108378187,
               -0.0736221895,
               -0.0335677,
               -0.0476976484,
               -0.015380118,
               0.0136121074,
               -0.0849095359,
               0.05227549,
               0.00749480631,
               -0.0545110255,
               0.0627966076,
               -0.030788105,
               0.023830045,
               -0.286628664,
               0.0682156533,
               0.00349698123,
               -0.0496992096,
               -0.0881975442,
               0.0170862358,
               -0.00617857976,
               -0.0406138971,
               0.00309328455,
               -0.00720785558,
               -0.0378425308,
               0.125148773,
               -0.00903631188,
               -0.0112465238,
               -0.0102016255,
               -0.168043,
               -0.116155982,
               -0.0465276279,
               -0.112794593,
               0.0597963519,
               -0.129695281,
               -0.0534035861,
               0.0297524538,
               -0.0162882432,
               0.0238256603,
               -0.0382992625,
               0.0378133766,
               -0.0423003137,
               -0.0224971063,
               0.0208681431,
               0.0491905473,
               -0.0993559659,
               -0.0403074138,
               -0.0968347266,
               0.0693044,
               0.10129118,
               -0.143118501,
               -0.0870207325,
               -0.163422436,
               -0.0652433112,
               -0.064099662,
               0.0776312,
               -0.0219083223,
               -0.156439379,
               0.0701476485,
               0.00305720489,
               -0.119285136,
               -0.0189293548,
               0.0165528562,
               0.182133228,
               -0.176084712,
               -0.00494182855,
               0.00876072422,
               0.0961760581,
               -0.00390627654,
               -0.112207435,
               -0.153027207,
               -0.0259592105,
               -0.0619677529,
               0.0544942766,
               -0.0467288569,
               -0.0954396352,
               0.0438078269,
               -0.034266606,
               0.0852830335,
               -0.116105281,
               -0.0840582922,
               -0.136471927,
               0.042202387,
               0.0107929381,
               -0.00476384722,
               0.242722511,
               -0.179549143,
               -0.0493319482,
               0.11795269,
               -0.0867168456,
               0.023796849,
               0.0498596393,
               -0.108563483,
               -0.0868150219,
               0.214253455,
               0.106235713,
               0.0618935302,
               0.0360597484,
               -0.0395682603,
               -0.122419685,
               0.0174634419,
               0.0421634912,
               0.0609709769,
               0.0692791343,
               -0.0829117671,
               -0.0773251578,
               -0.026832711,
               0.119251534,
               -0.0615953542,
               -0.0664861426,
               -0.136854365,
               0.0393703207,
               0.0405587964,
               -0.167676359,
               0.0127512915,
               0.099685289,
               -0.0394059606,
               0.0219707098,
               0.0192944463,
               -0.0365319364,
               -0.0167301241,
               0.00673767785,
               0.0554056615,
               -0.0552291088,
               -0.0209817719,
               -0.158997759,
               -0.382526219,
               -0.0145109482,
               0.0451170653,
               0.0229018275,
               -0.021473946,
               -0.129281774,
               0.061984621,
               0.121852137,
               -0.0469903909,
               0.0861581564,
               -0.0221377555,
               0.0532767288,
               -0.00808529183,
               -0.0132288346,
               0.01141713,
               0.0280134082,
               -0.313055158,
               0.0293340143,
               -0.0667716041,
               0.10507188,
               0.017784914,
               -0.0011320496,
               -0.0284518749,
               -0.0646700338,
               -0.0264609288,
               0.0218959935,
               0.00340498798,
               0.0575007424,
               0.0651351735,
               0.00242223823,
               0.0335311219,
               0.143711478,
               -0.138267,
               -0.120920449,
               -0.00422728248,
               0.00680711074,
               0.0449799746,
               0.0776365325,
               -0.0297208689,
               -0.0589853935,
               0.0495072678,
               -0.0254453663,
               -0.000512312399,
               0.0390606448,
               -0.0321181901,
               0.0105205784,
               0.0360477529,
               0.0171867833,
               -0.171509206,
               0.00170554861,
               -0.0194991324,
               0.00525682746,
               -0.0595680922,
               0.00461149262,
               -0.0916784,
               0.0427778326,
               0.0693522841,
               -0.0175583344,
               -0.0199711733,
               -0.0233756788,
               0.0381413437,
               -0.0380727686,
               0.104333177,
               -0.0367244072,
               -0.168855473,
               0.0732275695,
               -0.105261557,
               -0.0123928348,
               -0.0242178459,
               0.101529151,
               0.0373884737,
               -0.0114533575,
               -0.0669025481,
               -0.0658464134,
               0.0342992693,
               0.00891967118,
               0.0237700157,
               0.0621437393,
               -0.00404952839,
               0.0202926099,
               0.00577450637,
               0.0123591423,
               -0.0705245063,
               0.137889534,
               -0.0402929224,
               -0.143623129,
               0.0011283434,
               -0.0246437583,
               -0.0053472193,
               -0.0350098498,
               -0.136268049,
               0.0492905341,
               -0.0373537652,
               0.00846623909,
               0.00983034167,
               -0.0804879218,
               -0.160766318,
               -0.0082343,
               -0.108120181,
               -0.0551700331,
               0.00315103214,
               -0.0348029174,
               0.0222241357,
               -0.0196736101,
               0.0344512649,
               0.026252741,
               0.0231823027,
               0.00155097386,
               0.0746926293,
               0.0284277648,
               0.0512875021,
               0.00148044282,
               -0.139205188,
               -0.0198416356,
               0.00511189457,
               0.0419381559,
               -0.015427242,
               -0.11675109,
               -0.00288741128,
               0.136257097,
               0.0193678811,
               0.0244326387,
               -0.0184856914,
               0.0836322904,
               -0.0396278836,
               -0.0553594567,
               -0.218697637,
               -0.327610314,
               -0.0177748427,
               -0.40415594,
               -0.180717617,
               -0.155118689,
               -0.0653105304,
               -0.0228101909,
               0.0595897026,
               0.0742790475,
               -0.078978911,
               0.0973067135,
               -0.0100402869,
               0.0757865757,
               0.0192902759,
               -0.104944013,
               -0.058579661,
               0.0190587323,
               -0.333168477,
               0.0723912343,
               -0.168516979,
               0.170292169,
               -0.107253902,
               -0.0151904225,
               0.077735357,
               -0.0858900547,
               -0.0664843395,
               0.027885,
               -0.216737732,
               -0.0501376949,
               -0.0441604257,
               0.0240947176,
               -0.179749906,
               0.0608752295,
               -0.135078728,
               0.00686774962,
               -0.0675053746,
               -0.04559277,
               0.060253609,
               -0.139206067,
               -0.00152335898,
               -0.00281727454,
               0.115546986,
               0.0811797678,
               -0.0733128116,
               -0.0606796071,
               0.0320833884,
               -0.173578978,
               -0.0190974474,
               -0.0306044314,
               0.179371715,
               0.00842654612,
               -0.0610855334,
               -0.00185235078,
               -0.0128077939,
               -0.264082253,
               0.0110654347,
               0.0614267662,
               0.0491434,
               -0.0208715703,
               -0.0498297065,
               0.0352399647,
               -0.0996949,
               0.0149930483,
               -0.013880997,
               -0.0161129888,
               -0.0344410576,
               -0.0601487756,
               0.112316348,
               0.0771150813,
               0.0680526122,
               0.0174263213,
               0.0299972203,
               0.0225210562,
               0.0308073983,
               -0.0253677759,
               -0.0532489195,
               -0.00802743,
               0.0913507193,
               0.0522038564,
               -0.0405609533,
               -0.0582577288,
               0.160400137,
               -0.0524683967,
               -0.247924849,
               0.0850761235,
               0.0857346579,
               -0.0194003042,
               0.0780992955,
               0.0590156466,
               -0.0229773354,
               0.0164234117,
               0.0409289561,
               0.0750454962,
               -0.0108407401,
               -0.0400817469,
               -0.064090386,
               0.0712578222,
