{
 "irVersion": "6",
 "opsetImport": [],
 "producerName": "tenncor",
 "producerVersion": "1.0.0",
 "domain": "com.mingkaic.tenncor",
 "modelVersion": "6",
 "docString": "",
 "graph": {
  "node": [
   {
    "input": [
     "0"
    ],
    "output": [
     "671"
    ],
    "name": "671",
    "opType": "_LINK",
    "domain": "",
    "attribute": [
     {
      "name": "layer",
      "refAttrName": "",
      "docString": "",
      "type": "GRAPH",
      "f": 0,
      "i": "0",
      "s": "",
      "g": {
       "node": [
        {
         "input": [
          "0"
         ],
         "output": [
          "654"
         ],
         "name": "654",
         "opType": "_LSTM_LAYER",
         "domain": "",
         "attribute": [
          {
           "name": "layer",
           "refAttrName": "",
           "docString": "",
           "type": "GRAPH",
           "f": 0,
           "i": "0",
           "s": "",
           "g": {
            "node": [
             {
              "input": [
               "0"
              ],
              "output": [
               "1"
              ],
              "name": "1",
              "opType": "SLICE",
              "domain": "",
              "attribute": [
               {
                "name": "dimension_pairs",
                "refAttrName": "",
                "docString": "",
                "type": "INTS",
                "f": 0,
                "i": "0",
                "s": "",
                "floats": [],
                "ints": [
                 "0",
                 "65535",
                 "0",
                 "1",
                 "0",
                 "65535",
                 "0",
                 "65535",
                 "0",
                 "65535",
                 "0",
                 "65535",
                 "0",
                 "65535",
                 "0",
                 "65535"
                ],
                "strings": [],
                "tensors": [],
                "graphs": [],
                "sparseTensors": []
               }
              ],
              "docString": ""
             },
             {
              "input": [
               "1",
               "2"
              ],
              "output": [
               "3"
              ],
              "name": "3",
              "opType": "CONCAT",
              "domain": "",
              "attribute": [
               {
                "name": "rank",
                "refAttrName": "",
                "docString": "",
                "type": "INT",
                "f": 0,
                "i": "0",
                "s": "",
                "floats": [],
                "ints": [],
                "strings": [],
                "tensors": [],
                "graphs": [],
                "sparseTensors": []
               }
              ],
              "docString": ""
             },
             {
              "input": [
               "3"
              ],
              "output": [
               "9"
              ],
              "name": "9",
              "opType": "_DENSE_LAYER",
              "domain": "",
              "attribute": [
               {
                "name": "layer",
                "refAttrName": "",
                "docString": "",
                "type": "GRAPH",
                "f": 0,
                "i": "0",
                "s": "",
                "g": {
                 "node": [
                  {
                   "input": [
                    "3",
                    "4"
                   ],
                   "output": [
                    "5"
                   ],
                   "name": "5",
                   "opType": "MATMUL",
                   "domain": "",
                   "attribute": [
                    {
                     "name": "rank_pairs",
                     "refAttrName": "",
                     "docString": "",
                     "type": "INTS",
                     "f": 0,
                     "i": "0",
                     "s": "",
                     "floats": [],
                     "ints": [
                      "0",
                      "1"
                     ],
                     "strings": [],
                     "tensors": [],
                     "graphs": [],
                     "sparseTensors": []
                    }
                   ],
                   "docString": ""
                  },
                  {
                   "input": [
                    "6"
                   ],
                   "output": [
                    "7"
                   ],
                   "name": "7",
                   "opType": "EXTEND",
                   "domain": "",
                   "attribute": [
                    {
                     "name": "tensor",
                     "refAttrName": "",
                     "docString": "",
                     "type": "TENSOR",
                     "f": 0,
                     "i": "0",
                     "s": "",
                     "t": {
                      "dims": [],
                      "dataType": 0,
                      "floatData": [],
                      "int32Data": [],
                      "stringData": [],
                      "int64Data": [],
                      "name": "5",
                      "docString": "",
                      "rawData": "",
                      "externalData": [],
                      "dataLocation": "DEFAULT",
                      "doubleData": [],
                      "uint64Data": []
                     },
                     "floats": [],
                     "ints": [],
                     "strings": [],
                     "tensors": [],
                     "graphs": [],
                     "sparseTensors": []
                    }
                   ],
                   "docString": ""
                  },
                  {
                   "input": [
                    "5",
                    "7"
                   ],
                   "output": [
                    "8"
                   ],
                   "name": "8",
                   "opType": "ADD",
                   "domain": "",
                   "attribute": [],
                   "docString": ""
                  },
                  {
                   "input": [
                    "8"
                   ],
                   "output": [
                    "9"
                   ],
                   "name": "9",
                   "opType": "IDENTITY",
                   "domain": "",
                   "attribute": [],
                   "docString": ""
                  }
                 ],
                 "name": "",
                 "initializer": [
                  {
                   "dims": [
                    "64",
                    "128",
                    "1",
                    "1",
                    "1",
                    "1",
                    "1",
                    "1"
                   ],
                   "dataType": 1,
                   "floatData": [
                    -0.118275173,
                    0.502191722,
                    -0.400523186,
                    0.106687181,
                    0.638198733,
                    -0.791387081,
                    0.370560229,
                    -0.21289432,
                    0.114072174,
                    -0.140451074,
                    -0.192861199,
                    0.436017215,
                    0.137638777,
                    -0.126731619,
                    -0.662349403,
                    0.228542447,
                    0.251615167,
                    -0.565302908,
                    0.368027598,
                    -0.21952711,
                    -0.0608556904,
                    -0.07435368,
                    -0.178373173,
                    -0.367752522,
                    -0.472926885,
                    -0.162991524,
                    0.176786676,
                    0.953258157,
                    0.677868903,
                    -0.345185935,
                    -0.300476611,
                    0.322324753,
                    0.316190809,
                    -0.411080092,
                    0.538698137,
                    0.0975872,
                    -0.390140176,
                    -0.137227058,
                    0.321873605,
                    -0.241962865,
                    0.346236318,
                    0.465614945,
                    0.678428888,
                    0.550808728,
                    -0.0265466888,
                    0.6748299,
                    -0.257623434,
                    0.194792554,
                    -0.610281,
                    -0.437657833,
                    0.0796379447,
                    0.253876299,
                    -0.471726894,
                    0.737695098,
                    0.14706853,
                    0.440603912,
                    0.222699419,
                    -0.0933526456,
                    -0.239441663,
                    -0.924010158,
                    -0.211794108,
                    0.382701188,
                    0.134723008,
                    0.335116506,
                    -1.63360989,
                    -0.806736827,
                    -0.172427118,
                    -0.060186591,
                    0.628965914,
                    -0.812062919,
                    0.378660589,
                    -0.0525418036,
                    -0.451323569,
                    0.0939235315,
                    1.68076336,
                    -0.526705503,
                    -1.93897474,
                    0.0713510886,
                    -0.588257253,
                    -0.653940082,
                    0.230836183,
                    -0.304115474,
                    0.198393404,
                    0.158429027,
                    0.136346519,
                    -1.40762448,
                    -0.049251616,
                    -0.230500832,
                    -0.191706657,
                    -0.0448624,
                    -0.112854294,
                    0.588234246,
                    0.622285485,
                    -0.455118179,
                    -0.744965255,
                    0.306805313,
                    -0.0154970679,
                    -0.217697129,
                    0.83866626,
                    -1.1549139,
                    -0.701932251,
                    -0.0159901865,
                    -0.011549633,
                    1.47969854,
                    -1.60542142,
                    0.188509643,
                    0.808231115,
                    0.386139274,
                    -0.0618853122,
                    2.33866954,
                    -0.241556942,
                    0.455548376,
                    0.681104481,
                    -0.178853184,
                    0.0784207135,
                    0.0542519689,
                    -0.0187901668,
                    1.03849959,
                    0.822899222,
                    -0.0651555806,
                    1.69969845,
                    -2.13627887,
                    0.723544,
                    -0.945299506,
                    0.0190239884,
                    1.12980366,
                    -0.25577125,
                    -0.0875769407,
                    0.833914816,
                    0.625257,
                    -0.00423416868,
                    0.0127231013,
                    0.0915642306,
                    -0.347325206,
                    -0.0483836643,
                    0.0417069197,
                    -0.397589,
                    0.0894543752,
                    -0.383693933,
                    0.136073053,
                    0.6031968,
                    0.039276287,
                    0.0636301413,
                    0.0927249864,
                    -0.0720635,
                    0.124041088,
                    -0.164327696,
                    0.6005494,
                    0.138177931,
                    0.32330665,
                    0.0291356631,
                    0.127318501,
                    0.0366670601,
                    0.0697221681,
                    -0.0317693427,
                    0.389802814,
                    0.337556183,
                    -0.0402000956,
                    -0.133725077,
                    -0.0633146092,
                    -0.0188615154,
                    -0.0736472681,
                    0.0560082309,
                    0.332817346,
                    0.0854217634,
                    0.0780811682,
                    -0.0211911388,
                    -0.774164617,
                    0.502475858,
                    0.0190004613,
                    -0.000859094085,
                    0.0481036901,
                    -0.000568128657,
                    -0.606350482,
                    -0.290171742,
                    0.0568689667,
                    -0.482976347,
                    0.112259425,
                    0.244750604,
                    -0.069184348,
                    -0.196617067,
                    0.51164937,
                    0.0693691298,
                    -0.0566664971,
                    -0.188769981,
                    0.674712479,
                    -0.144228101,
                    -0.278158575,
                    -0.0575854294,
                    -0.345046252,
                    -0.059948381,
                    0.0111854533,
                    -0.327789843,
                    0.0443624295,
                    0.10916014,
                    0.0182639509,
                    -0.0931756049,
                    0.105613373,
                    -0.00651521236,
                    -0.0427398495,
                    -0.06590119,
                    -0.003691928,
                    0.232622847,
                    -0.0423354506,
                    -0.256996483,
                    -0.0559917167,
                    0.0251118876,
                    -0.21090588,
                    -0.0740865767,
                    0.129574969,
                    0.0323951766,
                    -0.141520128,
                    -0.00943740644,
                    -0.113128781,
                    -0.0840824172,
                    0.0272062439,
                    -0.0831607804,
                    -0.0181978289,
                    0.0158833358,
                    -0.116462879,
                    0.100186631,
                    0.0723766237,
                    -0.0560000688,
                    0.0470954664,
                    -0.0174262654,
                    -0.0384904891,
                    -0.0268408861,
                    0.109425068,
                    0.00691775326,
                    0.0148399249,
                    -0.0129015148,
                    0.100676179,
                    0.272190392,
                    -0.0734927133,
                    0.0771759301,
                    0.0346554928,
                    0.135812268,
                    -0.154722273,
                    0.0335680321,
                    0.0139017105,
                    -0.122783348,
                    -0.066522032,
                    0.0933741182,
                    0.00254275,
                    -0.0144189093,
                    -0.158076897,
                    0.10274893,
                    -0.0237700325,
                    -0.150226712,
                    0.225968897,
                    0.0446555912,
                    0.156762928,
                    0.0274978187,
                    -0.180650115,
                    0.0515223183,
                    0.0259574223,
                    1.30076051,
                    1.32638276,
                    0.477762938,
                    -0.244902447,
                    -0.313048571,
                    1.22282112,
                    -0.160265848,
                    0.154247597,
                    0.118164264,
                    0.144497842,
                    -1.15509474,
                    0.65010941,
                    1.72309756,
                    0.164675981,
                    0.883752942,
                    0.649800122,
                    -0.591957808,
                    0.758844256,
                    0.0471151806,
                    1.02308929,
                    0.317013234,
                    1.14336014,
                    0.335906506,
                    0.72494781,
                    0.238844275,
                    0.072071448,
                    -0.0789944604,
                    -0.637062,
                    -0.652035058,
                    0.502583086,
                    0.853508711,
                    -0.210594669,
                    0.0362010077,
                    0.422997385,
                    -1.59288859,
                    0.00210096524,
                    0.688682914,
                    0.0131254783,
                    -0.0980767906,
                    -1.44236159,
                    1.03326964,
                    0.0141923353,
                    0.139717713,
                    -0.4320319,
                    0.642056584,
                    -0.669795036,
                    -0.437875926,
                    -0.406760484,
                    -1.3693856,
                    0.222848639,
                    -0.0858062282,
                    -0.209319517,
                    0.31299144,
                    -1.66159308,
                    -0.321152598,
                    -0.108138695,
                    -1.42845547,
                    1.66607475,
                    -0.250651956,
                    0.601100564,
                    -0.523285568,
                    -1.32338607,
                    -0.0459043905,
                    -0.539505661,
                    -0.612756968,
                    0.120242074,
                    0.144632742,
                    0.231592014,
                    0.225396022,
                    -0.226719871,
                    0.120454013,
                    -0.255943626,
                    -0.346425265,
                    -0.10650903,
                    0.537239254,
                    0.427127123,
                    -0.149167269,
                    -0.0607686639,
                    -0.323263794,
                    -0.721611142,
                    0.189786851,
                    -0.398065597,
                    0.189699277,
                    -0.822230637,
                    -0.162702143,
                    -0.230651543,
                    -0.0794989,
                    0.0617013946,
                    -0.0234958,
                    -0.0933888853,
                    0.0793405101,
                    -0.242127746,
                    -0.174293146,
                    -0.475113,
                    -0.303440958,
                    0.0245116428,
                    0.0699711815,
                    -0.0973175317,
                    0.321746856,
                    -0.527255118,
                    0.100608878,
                    -0.113963209,
                    0.318475127,
                    -0.027760651,
                    0.505967438,
                    0.324943841,
                    -0.0890582725,
                    0.492877871,
                    0.732522249,
                    0.518390596,
                    -0.181637108,
                    0.065550983,
                    0.147167042,
                    -0.117359675,
                    -0.0314387903,
                    0.0772055835,
                    -0.514125943,
                    0.721136928,
                    0.305831045,
                    0.369469851,
                    0.423345715,
                    0.568540692,
                    -0.133523822,
                    -0.599560201,
                    -0.147800565,
                    0.857900321,
                    0.132480234,
                    0.573344648,
                    1.27382517,
                    1.39188993,
                    -0.213332787,
                    -0.051736787,
                    0.155202284,
                    -1.29789698,
                    -0.32274732,
                    -0.149825171,
                    -0.225101814,
                    0.0442922115,
                    -1.23702753,
                    0.746945143,
                    1.15241742,
                    0.0771291,
                    -0.540370107,
                    0.579487085,
                    0.101422578,
                    0.179761037,
                    -0.00832462311,
                    1.24625647,
                    -0.0409004353,
                    -0.164123654,
                    -0.165813521,
                    0.0448435433,
                    -0.329875827,
                    0.293536931,
                    -0.0670818388,
                    1.2213273,
                    1.1257782,
                    -0.15588814,
                    -0.524568915,
                    -0.0446327627,
                    0.0606948659,
                    -0.632604659,
                    0.808096528,
                    0.884681702,
                    0.102431275,
                    0.249257937,
                    0.12108437,
                    -1.36662543,
                    1.36419284,
                    0.454864502,
                    1.30235589,
                    0.841841936,
                    0.588160634,
                    -1.12286508,
                    -0.666269064,
                    -0.123179287,
                    -1.17001903,
                    0.013165446,
                    0.328640491,
                    -0.125856,
                    -0.792220771,
                    0.633569956,
                    -0.274507701,
                    0.142699137,
                    -0.0209972523,
                    1.14854014,
                    -0.436779588,
                    -1.10893261,
                    -0.967105091,
                    -1.34602499,
                    -0.105461553,
                    0.276895612,
                    -0.126881123,
                    0.0273052286,
                    -0.0339257456,
                    0.065654546,
                    -0.061263822,
                    -0.0820131,
                    0.0452073812,
                    -0.0684899241,
                    0.415342271,
                    -0.0442411266,
                    -0.00483987108,
                    0.0966647565,
                    -0.274269581,
                    -0.0133610154,
                    -0.0814079493,
                    -0.322139472,
                    -0.0484834872,
                    -0.0152161745,
                    -0.0240363106,
                    -0.0542977042,
                    0.0275501944,
                    0.0208208114,
                    -0.0207904354,
                    0.0249074567,
                    -0.00901151821,
                    0.0376828872,
                    0.041754,
                    0.0127167832,
                    0.0715634525,
                    0.118368343,
                    0.131714106,
                    -0.00205302821,
                    -0.044915013,
                    -0.0596903265,
                    -0.145391941,
                    -0.0453841612,
                    -0.0375930481,
                    0.0148051316,
                    0.00301231211,
                    0.312032253,
                    -0.189332306,
                    -0.125635684,
                    0.120500207,
                    0.11321266,
                    -0.308973104,
                    0.148271114,
                    0.0961003825,
                    0.162041157,
                    0.0981274843,
                    -0.00711308047,
                    -0.189607412,
                    0.0212220065,
                    -0.0874495208,
                    -0.0675658286,
                    0.144832641,
                    0.181625187,
                    0.33931455,
                    -0.260458767,
                    0.0664419755,
                    -0.289399058,
                    0.0736952722,
                    0.184321776,
                    -0.035806857,
                    0.0682973,
                    0.768015504,
                    0.862218678,
                    0.0455241799,
                    -0.0147963241,
                    -0.220216647,
                    -0.264206499,
                    -0.088117741,
                    0.0893986,
                    -0.199293554,
                    0.0474227332,
                    -0.604091167,
                    0.330403328,
                    0.708404124,
                    0.0338512585,
                    -0.171503112,
                    0.0613868162,
                    -0.0853186771,
                    0.375386596,
                    0.0267582443,
                    0.532536,
                    0.0517054237,
                    0.22678563,
                    0.043724969,
                    0.101285823,
                    0.083173357,
                    0.0312939472,
                    0.0233835913,
                    0.362038642,
                    0.211597249,
                    0.0466358401,
                    -0.134641573,
                    -0.0548603,
                    0.0253720321,
                    -0.236253798,
                    0.151701644,
                    0.386713058,
                    0.061585404,
                    0.0376985706,
                    0.0357475579,
                    -0.908599734,
                    0.836313903,
                    -0.0321707912,
                    0.374259561,
                    -0.0577081777,
                    0.139769137,
                    -0.534594238,
                    -0.2462302,
                    -0.170788974,
                    -0.586213946,
                    0.0112711191,
                    0.103275068,
                    -0.02096311,
                    -0.177329272,
                    -0.0384738147,
                    -0.0483692512,
                    -0.0120941969,
                    -0.368822068,
                    0.88335681,
                    -0.294852912,
                    -0.173557848,
                    -0.35007453,
                    -0.589749634,
                    -0.00451464,
                    0.0330230296,
                    1.11528826,
                    1.28370523,
                    -0.310649812,
                    0.125369161,
                    0.381320834,
                    -1.11088943,
                    -0.0703315735,
                    -0.170920193,
                    -0.262277335,
                    -0.0545958914,
                    -0.949004829,
                    0.573243201,
                    1.10787404,
                    0.0134784784,
                    -0.388086,
                    0.453776211,
                    0.0355262756,
                    0.106161445,
                    -0.0388283581,
                    0.918624341,
                    -0.040552225,
                    0.133793414,
                    -0.111763656,
                    -0.113092147,
                    -0.409542143,
                    0.0899871439,
                    -0.0083805928,
                    1.10124862,
                    0.664912343,
                    -0.00390908448,
                    -0.665209949,
                    -0.0185577311,
                    0.0266942699,
                    -0.431193084,
                    0.615453541,
                    0.86306864,
                    0.0174619835,
                    0.0231675357,
                    -0.0287083033,
                    -0.982447743,
                    0.924506068,
                    0.414896816,
                    0.66400528,
                    0.510261297,
                    0.5733518,
                    -0.663730621,
                    -0.215385273,
                    0.182581156,
                    -0.520583749,
                    0.00318875629,
                    0.170369968,
                    0.0298901983,
                    -0.655975878,
                    0.657219648,
                    -0.117275856,
                    0.0659248307,
                    0.240918443,
                    0.868448853,
                    -0.284988374,
                    -0.939531803,
                    -0.737176895,
                    -1.25437009,
                    0.0202345941,
                    0.282657772,
                    1.20992661,
                    1.15110219,
                    -0.199914366,
                    0.153846845,
                    0.178836063,
                    -0.984460235,
                    -0.108324409,
                    -0.0366241522,
                    -0.105241239,
                    -0.00390134379,
                    -0.694219768,
                    0.515322,
                    0.980804145,
                    -0.0104009788,
                    -0.183394879,
                    0.459936172,
                    0.0472637042,
                    0.261421,
                    0.0927428901,
                    1.01443553,
                    -0.0550170913,
                    0.0837768614,
                    -0.0559015162,
                    -0.0206788629,
                    -0.236328557,
                    0.0611588247,
                    -0.00162568165,
                    0.93747,
                    0.360780656,
                    -0.0180525184,
                    -0.514529765,
                    -0.0196412187,
                    0.0176563989,
                    -0.367227137,
                    0.465586126,
                    0.651995599,
                    0.0472284555,
                    0.0607726276,
                    -0.080857262,
                    -0.881791711,
                    0.893991411,
                    0.409916788,
                    0.438754797,
                    0.437349528,
                    0.367073178,
                    -0.689000845,
                    -0.184128061,
                    0.155561492,
                    -0.36728853,
                    -0.0364056341,
                    0.181814447,
                    -0.108082518,
                    -0.606162488,
                    0.469537169,
                    -0.0199477,
                    -0.0451318212,
                    0.0793891847,
                    0.836347342,
                    -0.264021546,
                    -0.70612973,
                    -0.418676376,
                    -1.12402868,
                    -0.0957337245,
                    0.14407824,
                    -0.0224579349,
                    0.13459827,
                    -0.0599103309,
                    -0.10535223,
                    0.682467639,
                    0.229669362,
                    0.046688281,
                    -0.74360913,
                    -0.795642138,
                    -0.261643618,
                    0.12261299,
                    0.0153162591,
                    -0.310400665,
                    -0.0644987747,
                    0.226741135,
                    0.352547467,
                    -0.317592084,
                    -0.0979378894,
                    -0.141895652,
                    0.86994791,
                    -0.154405728,
                    0.0140965451,
                    -0.0475129336,
                    -0.582322657,
                    0.136417195,
                    0.021096861,
                    -0.0438908078,
                    -0.398393422,
                    -0.599309921,
                    -0.0521423966,
                    0.00119888654,
                    0.0338741615,
                    -0.00827341899,
                    0.164793879,
                    -0.0651332587,
                    -0.0530568659,
                    0.330365241,
                    0.017925553,
                    0.0579263568,
                    -0.458236396,
                    -0.58738023,
                    -0.0900612921,
                    -0.0997919217,
                    -0.353942841,
                    0.722346961,
                    0.331595182,
                    -0.382212102,
                    -0.227738962,
                    -0.29230845,
                    0.0928315371,
                    0.175983682,
                    0.0838638693,
                    0.513317,
                    -0.00751330145,
                    0.23905836,
                    -0.584353864,
                    0.204902098,
                    0.790585876,
                    -0.318094909,
                    0.0489246249,
                    -0.00858565047,
                    -0.765249133,
                    0.110198349,
                    -0.569751322,
                    0.132881433,
                    -0.152371928,
                    0.0230988357,
                    -0.0951598,
                    -0.69142282,
                    -0.0168309137,
                    0.0297953524,
                    0.532328427,
                    0.449018627,
                    -0.0727424473,
                    0.0360202119,
                    0.0724453181,
                    -0.148516685,
                    -0.0575924553,
                    0.0329397433,
                    0.386607498,
                    0.143673986,
                    -0.0285069738,
                    0.0105620641,
                    0.0689337,
                    -0.0662484691,
                    -0.010031878,
                    0.0106858639,
                    -0.0924919471,
                    0.0273093861,
                    -0.0576768182,
                    0.0899147317,
                    -0.0122100124,
                    -0.120947473,
                    -0.435474396,
                    -0.229660586,
                    0.0130740022,
                    -0.0575959682,
                    0.112379588,
                    -0.0204973482,
                    0.0854210481,
                    -0.0610718727,
                    0.0654954,
                    -0.0970711708,
                    -0.332682073,
                    -0.118326589,
                    0.00378971128,
                    -0.10151656,
                    0.47394377,
                    -0.374172509,
                    0.0834529772,
                    -0.215949044,
                    -0.023279231,
                    -0.04832967,
                    -0.0227087513,
                    -0.306316733,
                    -0.0382797718,
                    0.0699613541,
                    -0.075331293,
                    0.00600583106,
                    0.181025863,
                    0.12589173,
                    0.382830381,
                    -0.0974372178,
                    0.0112482887,
                    0.323550552,
                    -0.176201299,
                    0.0110285459,
                    -0.246113792,
                    -0.0549644604,
                    0.364736617,
                    -0.026309317,
                    0.337499708,
                    0.375563055,
                    -0.262636423,
                    0.125048369,
                    -0.263466239,
                    0.577707529,
                    -0.188129902,
                    0.244872555,
                    -0.0161596518,
                    -0.487130493,
                    -0.0432621539,
                    -0.198773116,
                    -0.163671792,
                    -0.262054116,
                    0.117396027,
                    0.273717403,
                    0.411224842,
                    -0.0562708974,
                    0.115755528,
                    0.0145423682,
                    -0.30844906,
                    -0.239098892,
                    -0.0412683189,
                    -0.0362572931,
                    0.829413593,
                    -0.486067891,
                    0.0512067638,
                    -0.557845771,
                    -0.0114120524,
                    0.049220778,
                    -0.126976,
                    -0.0425597727,
                    0.123555236,
                    -0.330860674,
                    -0.05461156,
                    0.361177,
                    -0.556833684,
                    -0.648719966,
                    0.00481047481,
                    0.0661291629,
                    0.181606814,
                    -0.536771059,
                    0.428388357,
                    -0.113767222,
                    -0.12386696,
                    0.0835698768,
                    -0.125758678,
                    0.331074893,
                    0.36726591,
                    -0.432109356,
                    0.68623507,
                    0.124749787,
                    0.702337,
                    0.125976801,
                    -0.146311551,
                    -0.147992164,
                    -0.275510222,
                    0.0710500479,
                    -0.0441518724,
                    0.0318932422,
                    0.709678829,
                    0.256646812,
                    -0.206636414,
                    -0.00578543,
                    0.0566594303,
                    -0.0865289643,
                    -0.100610785,
                    0.093887873,
                    0.1148775,
                    -0.305904686,
                    0.0549737029,
                    -0.103870049,
                    -0.100236557,
                    0.0739285201,
                    -0.00355665921,
                    -0.298951566,
                    0.447814286,
                    0.488461077,
                    -0.00968002062,
                    0.14130424,
                    -0.359006703,
                    0.0612061173,
                    -0.0790608823,
                    0.0143142678,
                    -0.0261111539,
                    -0.0483203977,
                    -0.0259570349,
                    -0.040013358,
                    0.211764961,
                    0.474664032,
                    -0.332857698,
                    -0.0648358464,
                    -0.0644907206,
                    0.0206844285,
                    -0.161837623,
                    0.0236238874,
                    0.336579472,
                    0.32017079,
                    -0.0774923861,
                    0.0199354943,
                    -0.217689559,
                    0.599958539,
                    -0.0437687226,
                    -0.174674749,
                    0.134638488,
                    -0.450649381,
                    -0.291105896,
                    0.0161809623,
                    -0.0847774073,
                    -0.0035828813,
                    0.0103322472,
                    0.202271715,
                    -0.0124314884,
                    -0.0520558581,
                    0.00726851402,
                    -0.134408459,
                    -0.31040132,
                    -0.587017298,
                    -0.286720604,
                    -0.116916656,
                    0.0473146401,
                    0.0180525146,
                    0.36339,
                    0.0323242843,
                    -0.315844506,
                    0.0964540243,
                    0.14593327,
                    -0.118132077,
                    0.133072719,
                    0.119816154,
                    0.0821344852,
                    -0.0938039869,
                    -0.789956868,
                    -0.32508713,
                    -0.142573833,
                    0.160355166,
                    0.0829911456,
                    0.181795821,
                    -0.119178779,
                    0.677635431,
                    -0.149377525,
                    0.017659286,
                    -0.335934132,
                    0.0590947196,
                    0.66498071,
                    0.0876064897,
                    -0.0423932336,
                    -0.197366029,
                    0.173544407,
                    0.0852635726,
                    -0.0928549916,
                    -0.00537529448,
                    -0.238025203,
                    -0.233314306,
                    -0.604540646,
                    -0.493585467,
                    0.0496083498,
                    -0.00388060301,
                    0.0901271552,
                    0.159397811,
                    -0.418004066,
                    -0.297732741,
                    -0.0858431533,
                    0.0963586271,
                    -0.130183965,
                    -0.609759569,
                    -0.0804757774,
                    -0.144938469,
                    0.0265327878,
                    1.01132274,
                    -0.0354283564,
                    0.171425343,
                    -0.227369279,
                    0.0416425094,
                    -0.19737348,
                    -0.718403518,
                    0.199497446,
                    -0.291784257,
                    -0.190507203,
                    -0.116592005,
                    0.628304422,
                    -0.0181942973,
                    0.772006214,
                    -0.0388629958,
                    0.111684278,
                    -1.24964511,
                    -0.678766549,
                    0.122011736,
                    -0.135826066,
                    0.177333623,
                    -0.456189245,
                    -0.00724771619,
                    -0.0656346679,
                    -0.176713258,
                    -0.0379839651,
                    -0.00832589902,
                    0.00720857829,
                    -0.155142426,
                    0.106398366,
                    0.0103688668,
                    -0.0138264112,
                    -0.179324985,
                    -0.0264468156,
                    -0.203144222,
                    -0.437451959,
                    -0.0359369218,
                    0.00400021113,
                    0.0190628599,
                    -0.104520671,
                    -0.164484441,
                    -0.00645634579,
                    0.0208447464,
                    0.188672423,
                    0.0273583792,
                    0.0456900075,
                    -0.0182282254,
                    -0.0196368173,
                    -0.00421461929,
                    -0.0410249978,
                    0.0294845011,
                    -0.0243626311,
                    -0.0361959487,
                    0.00476333,
                    0.0123132961,
                    0.132070512,
                    0.0679911226,
                    -0.00150625734,
                    0.0279373955,
                    0.047418233,
                    -0.0454716794,
                    -0.0587563254,
                    -0.0822395384,
                    0.30700025,
                    -0.137237653,
                    0.0910169408,
                    0.0739952177,
                    0.0241661891,
                    -0.00262255245,
                    -0.0287536029,
                    -0.196509928,
                    -0.0642534047,
                    -0.122083828,
                    0.172834441,
                    0.0422802716,
                    0.170453578,
                    -0.316978395,
                    -0.234118417,
                    -0.0448421,
                    0.0387989655,
                    0.179309323,
                    0.0952652618,
                    -0.040642105,
                    0.0997538194,
                    0.0418154448,
                    -0.391731441,
                    -0.0352581292,
                    0.0460746959,
                    0.126661211,
                    0.00865110755,
                    0.0110621173,
                    0.132211775,
                    -0.468094289,
                    0.0542993955,
                    0.0700177,
                    0.0187365431,
                    -0.457873762,
                    0.023542339,
                    -0.41795978,
                    0.0453594737,
                    0.0323825628,
                    0.00542959338,
                    0.0143354451,
                    0.440555602,
                    -0.0199041646,
                    0.135011271,
                    -0.0805792212,
                    -0.113303885,
                    0.0116299978,
                    -0.0448042974,
                    -0.0641587526,
                    -0.139305726,
                    -0.26246497,
                    -0.484457165,
                    -0.053901732,
                    0.0449931845,
                    -0.0214861296,
                    0.00792525895,
                    0.0597664863,
                    -0.477801561,
                    0.199897185,
                    0.0187301971,
                    0.119561404,
                    -0.397003889,
                    -0.564081907,
                    0.0099288784,
                    -0.0995836481,
                    0.428568602,
                    -0.630651712,
                    0.152476147,
                    -0.304009736,
                    -0.0216375943,
                    0.0503824875,
                    0.127444893,
                    -0.664444089,
                    0.0477832071,
                    -0.370235801,
                    0.47329098,
                    0.0663355067,
                    0.492461294,
                    0.366657,
                    -0.328533202,
                    -0.329374611,
                    -0.114143409,
                    0.0422751643,
                    0.140336931,
                    -0.0209608041,
                    -0.558409,
                    0.0924199671,
                    -0.0237457529,
                    -0.000544919225,
                    0.164585426,
                    0.253822118,
                    -0.0564314499,
                    -0.183711693,
                    -0.575806499,
                    -0.283300877,
                    0.0323435813,
                    -0.000450312713,
                    0.0409522094,
                    -0.0251588076,
                    0.000200175913,
                    -0.0980664,
                    -0.422382385,
                    0.395781368,
                    0.0622333027,
                    0.0618943162,
                    -0.424792588,
                    0.219895825,
                    0.135073751,
                    -0.00583282765,
                    0.38057071,
                    -0.0399252847,
                    -0.0553604513,
                    0.0443019867,
                    -0.143574223,
                    -0.41208443,
                    0.173554063,
                    -0.170763329,
                    0.0346008614,
                    -0.0196308084,
                    0.00413898146,
                    -0.048365254,
                    0.266889095,
                    0.310745299,
                    -0.0238129869,
                    0.152792394,
                    0.430088937,
                    -0.112609282,
                    -0.031942796,
                    0.167546406,
                    0.136807576,
                    -0.570043445,
                    0.00621415395,
                    0.212473556,
                    -0.0403401,
                    0.0920318291,
                    0.0109621435,
                    -0.147251382,
                    0.19374235,
                    -0.351719528,
                    -0.26700142,
                    -0.067766726,
                    -0.216629341,
                    -0.923196197,
                    -0.692516744,
                    -0.131465301,
                    0.0286610164,
                    0.133666888,
                    0.112559542,
                    0.0664295629,
                    -0.146595269,
                    -1.38323009,
                    0.32403177,
                    -0.121450089,
                    0.00915703829,
                    0.531316757,
                    0.0867601633,
                    0.181602895,
                    -0.744694412,
                    0.11000403,
                    -0.233915627,
                    0.201376557,
                    0.10908898,
                    -0.0205122456,
                    -0.12070322,
                    0.0838419273,
                    0.289787024,
                    0.0332645476,
                    -0.0793728,
                    -0.0183772258,
                    1.00738621,
                    -0.043587286,
                    0.23309046,
                    0.0696197227,
                    0.227318257,
                    -0.186094299,
                    -0.0908221677,
                    0.0628570393,
                    -0.622275293,
                    -0.935745239,
                    0.427557588,
                    -0.158938676,
                    -0.0305044316,
                    0.00599604938,
                    -0.172155231,
                    -0.259112298,
                    -0.526789486,
                    -0.708915472,
                    0.0227633081,
                    0.203145,
                    -0.130314142,
                    -0.296534419,
                    0.178913668,
                    0.318324327,
                    0.443826705,
                    0.54661262,
                    0.641264617,
                    0.192110211,
                    -0.0297831483,
                    0.104195975,
                    0.130870104,
                    -0.156428576,
                    -0.00416573184,
                    -0.22781308,
                    0.076631695,
                    -0.314791471,
                    -0.242078245,
                    0.797525406,
                    0.439357728,
