{
 "irVersion": "6",
 "opsetImport": [],
 "producerName": "tenncor",
 "producerVersion": "1.0.0",
 "domain": "com.tenncor.eteq",
 "modelVersion": "6",
 "docString": "",
 "graph": {
  "node": [
   {
    "input": [
     "0"
    ],
    "output": [
     "116"
    ],
    "name": "116",
    "opType": "_LSTM_LAYER",
    "domain": "",
    "attribute": [
     {
      "name": "layer",
      "refAttrName": "",
      "docString": "",
      "type": "GRAPH",
      "f": 0,
      "i": "0",
      "s": "",
      "g": {
       "node": [
        {
         "input": [
          "0"
         ],
         "output": [
          "1"
         ],
         "name": "1",
         "opType": "SLICE",
         "domain": "",
         "attribute": [
          {
           "name": "dimension_pairs",
           "refAttrName": "",
           "docString": "",
           "type": "INTS",
           "f": 0,
           "i": "0",
           "s": "",
           "floats": [],
           "ints": [
            "0",
            "65535",
            "0",
            "1",
            "0",
            "65535",
            "0",
            "65535",
            "0",
            "65535",
            "0",
            "65535",
            "0",
            "65535",
            "0",
            "65535"
           ],
           "strings": [],
           "tensors": [],
           "graphs": [],
           "sparseTensors": []
          }
         ],
         "docString": ""
        },
        {
         "input": [
          "1",
          "2"
         ],
         "output": [
          "3"
         ],
         "name": "3",
         "opType": "CONCAT",
         "domain": "",
         "attribute": [
          {
           "name": "rank",
           "refAttrName": "",
           "docString": "",
           "type": "INT",
           "f": 0,
           "i": "0",
           "s": "",
           "floats": [],
           "ints": [],
           "strings": [],
           "tensors": [],
           "graphs": [],
           "sparseTensors": []
          }
         ],
         "docString": ""
        },
        {
         "input": [
          "3"
         ],
         "output": [
          "9"
         ],
         "name": "9",
         "opType": "_DENSE_LAYER",
         "domain": "",
         "attribute": [
          {
           "name": "layer",
           "refAttrName": "",
           "docString": "",
           "type": "GRAPH",
           "f": 0,
           "i": "0",
           "s": "",
           "g": {
            "node": [
             {
              "input": [
               "3",
               "4"
              ],
              "output": [
               "5"
              ],
              "name": "5",
              "opType": "MATMUL",
              "domain": "",
              "attribute": [
               {
                "name": "rank_pairs",
                "refAttrName": "",
                "docString": "",
                "type": "INTS",
                "f": 0,
                "i": "0",
                "s": "",
                "floats": [],
                "ints": [
                 "0",
                 "1"
                ],
                "strings": [],
                "tensors": [],
                "graphs": [],
                "sparseTensors": []
               }
              ],
              "docString": ""
             },
             {
              "input": [
               "6"
              ],
              "output": [
               "7"
              ],
              "name": "7",
              "opType": "EXTEND",
              "domain": "",
              "attribute": [
               {
                "name": "tensor",
                "refAttrName": "",
                "docString": "",
                "type": "TENSOR",
                "f": 0,
                "i": "0",
                "s": "",
                "t": {
                 "dims": [],
                 "dataType": 0,
                 "floatData": [],
                 "int32Data": [],
                 "stringData": [],
                 "int64Data": [],
                 "name": "5",
                 "docString": "",
                 "rawData": "",
                 "externalData": [],
                 "dataLocation": "DEFAULT",
                 "doubleData": [],
                 "uint64Data": []
                },
                "floats": [],
                "ints": [],
                "strings": [],
                "tensors": [],
                "graphs": [],
                "sparseTensors": []
               }
              ],
              "docString": ""
             },
             {
              "input": [
               "5",
               "7"
              ],
              "output": [
               "8"
              ],
              "name": "8",
              "opType": "ADD",
              "domain": "",
              "attribute": [],
              "docString": ""
             },
             {
              "input": [
               "8"
              ],
              "output": [
               "9"
              ],
              "name": "9",
              "opType": "IDENTITY",
              "domain": "",
              "attribute": [],
              "docString": ""
             }
            ],
            "name": "",
            "initializer": [
             {
              "dims": [
               "100",
               "150",
               "1",
               "1",
               "1",
               "1",
               "1",
               "1"
              ],
              "dataType": 1,
              "floatData": [
               -0.0336114205,
               -0.127741173,
               0.0321786292,
               0.121698916,
               0.144892678,
               -0.096884869,
               0.00642977841,
               -0.0349175669,
               -0.0733422637,
               0.0748553425,
               -0.130694479,
               0.0185242742,
               0.0219271295,
               0.0963605419,
               0.0276252944,
               0.00443167612,
               0.115634866,
               0.148901969,
               0.0728836656,
               0.141764238,
               -0.062638022,
               -0.0225248225,
               0.125452653,
               0.0515895672,
               0.122032151,
               0.143862814,
               -0.101758286,
               0.107587539,
               0.121352166,
               -0.0623025559,
               0.133610651,
               -0.0250034016,
               -0.0585613064,
               0.0072176,
               -0.0316432826,
               0.0867471099,
               0.0585371107,
               0.0161790606,
               0.0284820367,
               -0.127946809,
               0.0339896232,
               -0.023713043,
               0.0305193681,
               0.103057414,
               -0.0016434805,
               0.0847658217,
               -0.134147421,
               -0.0954843462,
               -0.0861546174,
               0.0864297077,
               -0.130228832,
               -0.101562075,
               0.0370250307,
               0.0208522,
               0.0731652826,
               -0.0559395887,
               -0.0213931501,
               -0.0271863509,
               0.128815487,
               0.153894797,
               0.0242841281,
               -0.104170866,
               0.0648836,
               -0.0507894047,
               -0.0142273372,
               -0.135520607,
               -0.113034248,
               -0.102158062,
               -0.019542532,
               -0.143894449,
               -0.000143522702,
               -0.0105658872,
               0.0278714821,
               0.0503355674,
               -0.126697451,
               -0.13207604,
               0.0992984548,
               -0.0347100832,
               -0.0959664,
               -0.103799239,
               0.142773032,
               0.149459749,
               -0.121393606,
               0.111439884,
               0.0370925702,
               0.0556606129,
               0.0353129655,
               0.0290816426,
               -0.104020305,
               -0.0788226575,
               0.0950879753,
               0.0280099381,
               0.126242042,
               -0.0689263716,
               -0.0938842,
               -0.0695519894,
               -0.0344516262,
               -0.125090182,
               0.0469217375,
               0.0410036,
               -0.285504252,
               -0.107958205,
               -0.127227306,
               0.140153468,
               0.0126148658,
               -0.142194822,
               0.0168979056,
               0.0703341,
               -0.00424094358,
               -0.0111964829,
               -0.156558156,
               -0.0859917924,
               -0.093403,
               0.0223090015,
               -0.120299019,
               0.0327278264,
               -0.103137098,
               0.0566310436,
               -0.0769941062,
               0.0494016781,
               -0.142002419,
               -0.100782521,
               -0.0409366488,
               0.0812026635,
               -0.0349918,
               0.100601375,
               0.0211413614,
               0.0761703104,
               0.0553289913,
               -0.0550647601,
               0.100017823,
               0.0108533921,
               0.0873846263,
               -0.107019745,
               0.0258321036,
               0.0881784856,
               0.140638843,
               0.129611701,
               0.0877714604,
               0.0903866366,
               0.0224495195,
               -0.153959394,
               -0.107660837,
               -0.000683368591,
               0.0815983787,
               -0.0634049401,
               0.0302649438,
               0.0184652917,
               0.107389115,
               0.000912645133,
               0.126476318,
               -0.0613589771,
               0.0909450874,
               0.148588896,
               -0.135349095,
               0.145134673,
               -0.0882558674,
               -0.0165834557,
               0.037156906,
               -0.0598700717,
               0.129903927,
               -0.135469466,
               -0.0782065764,
               0.0939238742,
               -0.0206255075,
               0.145798877,
               0.036906749,
               -0.140159622,
               0.10479445,
               -0.0807401687,
               0.014090511,
               -0.123719059,
               0.143092752,
               0.00584624195,
               -0.099770844,
               0.00901390146,
               0.100098453,
               -0.0532433614,
               -0.0187839083,
               -0.0567398109,
               0.0646856129,
               0.145611897,
               -0.0933021903,
               0.0697820038,
               -0.0418353379,
               0.142219052,
               -0.144242033,
               -0.139173567,
               0.120050296,
               0.018498851,
               0.152516067,
               -0.136758447,
               -0.130034119,
               0.0976770446,
               -0.11830128,
               0.149696946,
               -0.0614375137,
               -0.0848822,
               0.0988359377,
               -0.0296441149,
               0.336065918,
               0.0382861644,
               0.150939763,
               0.0803957805,
               -0.0970169,
               0.127714083,
               0.0547310077,
               -0.148473933,
               0.00514909066,
               0.102092996,
               0.0672922954,
               0.125209674,
               0.0704207569,
               -0.0993889198,
               -0.0569373742,
               0.0219196901,
               -0.102653056,
               -0.0602666289,
               0.0554012209,
               -0.0371949859,
               -0.0766728148,
               -0.0105269849,
               -0.0321703739,
               -0.0918825045,
               0.0106852641,
               -0.0736362636,
               0.0863387585,
               0.0295512546,
               0.0919552594,
               -0.0916239321,
               -0.0222992655,
               -0.108807132,
               -0.0499555729,
               0.0564024746,
               0.127781123,
               0.0890957192,
               -0.0617353879,
               -0.103060953,
               -0.0783941522,
               -0.0120253321,
               -0.0615287274,
               -0.0798276514,
               -0.0754460692,
               0.147577316,
               -0.0610256866,
               0.0624649934,
               0.125052586,
               0.107645005,
               -0.00747366855,
               -0.134099528,
               -0.124490008,
               -0.0996124372,
               0.0652197152,
               -0.156972453,
               -0.080297336,
               -0.0160969235,
               -0.00625696359,
               -0.0336363055,
               -0.145796612,
               -0.110592335,
               -0.0616192222,
               -0.0774421841,
               0.0480040051,
               -0.0116086463,
               0.105755553,
               0.0551955737,
               0.139933735,
               -0.0928909853,
               -0.101825893,
               -0.0993977785,
               0.139512345,
               -0.0338670574,
               0.0775262862,
               -0.116779588,
               0.0914383084,
               0.0697037429,
               -0.0942101851,
               -0.0091306949,
               0.140687883,
               -0.0433307067,
               0.0271019973,
               -0.159007356,
               0.141032234,
               0.142173797,
               0.047989469,
               -0.076369524,
               -0.0293711536,
               0.0505361781,
               0.0790314674,
               0.131955177,
               -0.0205516834,
               0.0285982173,
               0.135709405,
               0.12786603,
               -0.119285814,
               -0.0498269275,
               -0.047532361,
               -0.0606111661,
               -0.00623036548,
               0.0538401753,
               -0.184657916,
               -0.0150967157,
               0.0161294285,
               -0.0299620479,
               -0.0304406807,
               0.0363074318,
               -0.0901808664,
               0.0736725256,
               -0.147381485,
               -0.141490847,
               -0.0388281494,
               0.0536779575,
               0.139299095,
               -0.149501637,
               -0.0216001347,
               0.0112874554,
               -0.0657824427,
               0.1342628,
               0.0286955535,
               -0.0390968695,
               0.0263411067,
               -0.00197154097,
               -0.0531958677,
               0.0568336919,
               -0.103838488,
               0.0885249,
               0.0160530731,
               0.119464725,
               0.123601295,
               0.0710750371,
               0.0749832168,
               -0.0546138398,
               0.100062035,
               -0.108573638,
               0.07401032,
               -0.0833065808,
               -0.138878495,
               -0.0875937864,
               0.0733941048,
               -0.0894401893,
               0.0183746181,
               0.0227113031,
               -0.103056066,
               0.0761533752,
               -0.099632062,
               0.0892703831,
               -0.0234196074,
               -0.113602325,
               -0.0941030756,
               -0.0372374021,
               0.135643363,
               -0.0408518724,
               0.0352734216,
               -0.0650203153,
               0.0271768272,
               0.0456062034,
               -0.127173379,
               0.0996151343,
               -0.00749318907,
               0.0879801586,
               0.136746645,
               0.00608267915,
               -0.0321626775,
               -0.0895746946,
               -0.0412950926,
               0.039440386,
               -0.121058248,
               0.0426800624,
               0.0185651854,
               0.0738572106,
               0.0529636703,
               0.0567384623,
               -0.0339320563,
               -0.0312802345,
               0.0705538,
               -0.151183575,
               -0.147941604,
               -0.0737990588,
               -0.117464915,
               0.113231644,
               -0.0429555587,
               0.0438432656,
               -0.0855246708,
               0.035165444,
               -0.0405126661,
               0.0400504395,
               -0.0586014725,
               0.0295070037,
               0.147259578,
               0.143766537,
               -0.0998162627,
               0.0353344306,
               -0.141939551,
               -0.00873916131,
               -0.048473876,
               0.0383208245,
               -0.127676144,
               -0.105560154,
               -0.108300991,
               -0.109878123,
               -0.0318040028,
               0.113161899,
               0.129925445,
               -0.124671116,
               0.0682613,
               -0.0144421,
               -0.0210640598,
               -0.055414483,
               -0.101697475,
               0.00402840087,
               0.0402135216,
               -0.113645293,
               -0.0238646306,
               -0.133287713,
               0.0865394473,
               -0.145563155,
               0.0257400163,
               0.147409692,
               0.114749983,
               0.141247064,
               -0.0432429276,
               -0.154081196,
               -0.0545560755,
               -0.0355344266,
               0.138248578,
               -0.0292226411,
               -0.0265556537,
               -0.0940074772,
               -0.144481942,
               -0.0440262258,
               0.101051278,
               0.0731209368,
               -0.0688039809,
               0.0399816632,
               0.106483378,
               -0.0457729623,
               0.00671600318,
               -0.117592357,
               -0.108618617,
               0.0492068604,
               -0.109457672,
               0.108186215,
               -0.0723680928,
               -0.10334646,
               -0.136555165,
               -0.0993598625,
               0.114100076,
               0.04135767,
               -0.0136141703,
               -0.00632388331,
               0.0569631569,
               -0.0226717629,
               -0.120446004,
               0.0777456388,
               -0.0774911717,
               -0.145301163,
               0.0621426329,
               -0.12989758,
               -0.0289577,
               0.0339659378,
               0.0646215603,
               0.0476929,
               0.154909775,
               0.109964833,
               -0.0709334,
               -0.0713920444,
               -0.120281562,
               0.0462057218,
               -0.0958882,
               -0.132869646,
               -0.0991527885,
               -0.111297309,
               -0.0763404295,
               -0.118282326,
               -0.11566861,
               0.13945283,
               0.0711880177,
               0.134943768,
               -0.114645921,
               0.129617795,
               -0.013457722,
               -0.120796219,
               0.0946894214,
               0.0700530559,
               0.0259532873,
               0.0748693272,
               0.0791154876,
               -0.000173994194,
               -0.0829154179,
               0.0563462637,
               -0.0751230493,
               0.0709651038,
               -0.0511642396,
               0.126863196,
               0.131834045,
               0.119510293,
               -0.15170601,
               0.0945844725,
               0.11104019,
               0.113514408,
               -0.187994808,
               -0.0246110987,
               0.128541559,
               -0.0065836,
               0.13577053,
               0.0837922096,
               0.109057248,
               -0.0896109715,
               0.124211237,
               -0.151095569,
               -0.0596283749,
               0.122818395,
               0.0836835355,
               0.0286848098,
               0.0319610834,
               -0.128128767,
               0.058090698,
               -0.106161632,
               -0.0133357868,
               -0.066104196,
               -0.0705987066,
               0.151365876,
               0.0588023886,
               0.13402909,
               -0.00691402657,
               0.105016828,
               0.037805,
               0.100739621,
               0.0307025146,
               -0.097338967,
               0.0681026205,
               0.0491459854,
               -0.0584932901,
               -0.0846382231,
               0.0663937256,
               -0.0361183397,
               0.075645417,
               0.0636685267,
               -0.0710729137,
               -0.13867192,
               -0.0446054302,
               0.110341884,
               -0.0432020463,
               0.051818721,
               -0.0289994366,
               0.0523726828,
               -0.14852424,
               -0.151717231,
               0.0148959011,
               -0.140911743,
               -0.0581539497,
               0.0488364659,
               -0.0199864712,
               0.134315297,
               -0.0818925872,
               -0.0591783375,
               0.0350735597,
               0.13929835,
               0.0888133496,
               -0.120815188,
               -0.147383943,
               0.134691641,
               -0.0335204937,
               -0.0384225,
               0.0403901,
               -0.111462571,
               0.0842974186,
               -0.0801490545,
               0.0535031036,
               -0.0330258124,
               -0.145394146,
               -0.106551588,
               -0.00634569,
               -0.0379698388,
               -0.104722261,
               0.149114236,
               0.0659219846,
               0.1006267,
               0.104656644,
               -0.0558428355,
               -0.134447947,
               -0.0989251584,
               -0.0504048392,
               -0.0117159355,
               0.0284778047,
               0.107446685,
               -0.0644339621,
               -0.0474666022,
               -0.116656832,
               0.0490463562,
               -0.0376573242,
               -0.0207897257,
               -0.0782106519,
               -0.0322170928,
               0.143405646,
               0.0821934789,
               -0.0434401259,
               0.0911437944,
               0.0383159332,
               0.136855379,
               -0.142924502,
               0.00611968245,
               0.0525606945,
               0.144291878,
               -0.098572,
               -0.095683977,
               0.128477186,
               -0.056198936,
               -0.046814397,
               0.0122543899,
               0.0770154893,
               0.123870179,
               -0.0642135292,
               -0.0918331891,
               0.0228279568,
               -0.00563858915,
               0.0623344854,
               0.0892755538,
               -0.0323059931,
               0.0971513167,
               -0.147187829,
               -0.0649628416,
               0.111839101,
               0.14275381,
               -0.0700171,
               -0.111086175,
               -0.0629052073,
               0.0639481172,
               -0.0652630329,
               0.0843642354,
               0.146794558,
               -0.0852037221,
               -0.102825731,
               -0.102254778,
               -0.0386474431,
               -0.123377524,
               -0.0857120305,
               0.122970045,
               -0.148014486,
               0.0447713919,
               -0.0306326728,
               0.127403453,
               0.0903218314,
               0.129240215,
               -0.0526742488,
               -0.00396089815,
               0.0210776795,
               0.0213831756,
               -0.0123633165,
               -0.110008948,
               -0.0542131439,
               0.0711794198,
               -0.0556004234,
               0.117868163,
               -0.0558074862,
               -0.0341969654,
               0.107823141,
               -0.14262411,
               0.0182686057,
               -0.07520812,
               0.12634401,
               0.102413908,
               0.0542818382,
               0.0825304,
               0.148513779,
               -0.0133976135,
               -0.0443955697,
               0.129828095,
               0.133187622,
               -0.0302301887,
               0.12432944,
               0.12084721,
               -0.00683814473,
               0.0296726748,
               -0.140678376,
               -0.0600679144,
               -0.142573535,
               -0.0277040955,
               -0.140246451,
               0.0656827837,
               0.059704069,
               0.0306098331,
               0.115682878,
               -0.00929686613,
               -0.152343959,
               -0.0586574934,
               0.0866591409,
               -0.103010103,
               0.126664206,
               -0.0158597063,
               0.152490273,
               -0.0692689568,
               0.119329005,
               0.114848077,
               -0.0839714706,
               -0.0171456877,
               0.0415263176,
               0.0707210153,
               -0.108397797,
               0.101350255,
               -0.12459366,
               -0.146853417,
               -0.111994117,
               -0.0914534703,
               -0.0981874689,
               0.0224560928,
               0.118529513,
               -0.106756568,
               0.0262843091,
               -0.0304287858,
               -0.0229953974,
               -0.0823949873,
               -0.082479,
               -0.00479129376,
               -0.0573462434,
               0.0428826511,
               0.130073324,
               0.0641119555,
               -0.132907569,
               0.00937745534,
               -0.144121066,
               -0.126213208,
               -0.121123157,
               0.0441581868,
               0.0356947035,
               0.0478282,
               0.0625999421,
               -0.132113546,
               0.0238934215,
               -0.106517702,
               0.0206611492,
               0.0368877836,
               -0.0638064668,
               0.0129549261,
               -0.140172496,
               -0.0849674046,
               -0.0221921485,
               -0.0196767673,
               -0.0716747046,
               -0.0646022111,
               0.0599673204,
               0.132230476,
               0.034645725,
               0.0364460871,
               -0.129738644,
               0.00789905153,
               -0.118331559,
               0.0625316,
               0.113897286,
               -0.00208243821,
               0.100791588,
               0.127704233,
               -0.106736854,
               0.071762234,
               -0.00680090394,
               0.144500956,
               -0.109924383,
               0.101727486,
               0.121615671,
               -0.117789745,
               0.0961157084,
               0.017628165,
               0.0262525678,
               0.0494986922,
               0.0389037244,
               0.121218748,
               -0.0856982172,
               0.0815062076,
               0.0283812415,
               0.148637414,
               0.0876634344,
               -0.000381298,
               -0.10877075,
               -0.02248789,
               0.0977895409,
               0.119472899,
               0.0617430396,
               -0.143892646,
               -0.00720740156,
               -0.136760443,
               -0.00900765602,
               0.0161306038,
               0.106641203,
               -0.096901,
               0.00226813275,
               0.0157903563,
               -0.0699666888,
               0.0491683483,
               0.0616232716,
               -0.0977964923,
               0.0887821838,
               -0.0623032339,
               0.146096081,
               0.00677347509,
               -0.138929293,
               0.0685274079,
               0.00326886959,
               -0.0372513905,
               -0.000599590945,
               0.0356724262,
               0.000559953449,
               -0.0665976182,
               -0.123035051,
               0.078097418,
               0.0151361246,
               0.00322765973,
               -0.0870851502,
               0.0210073777,
               -0.0450112484,
               0.145245135,
               0.0962189212,
               0.143568799,
               0.118525319,
               0.0700114,
               -0.0786675066,
               -0.145919666,
               -0.100447588,
               0.0777656585,
               -0.047624819,
               0.0645019,
               -0.0490100347,
               -0.00570345623,
               -0.142296046,
               -0.0694293752,
               -0.0506649613,
               -0.0740618706,
               0.113026716,
               0.0393251106,
               -0.0554249,
               0.136838362,
               0.0198431537,
               0.0131609403,
               -0.0478261113,
               0.046193,
               0.10643407,
               -0.037581034,
               0.0567599051,
               -0.0879530907,
               -0.0554229803,
               0.138580129,
               0.0153983217,
               0.126112223,
               -0.135043934,
               -0.0509580709,
               0.0161370188,
               -0.0698224,
               0.0556341931,
               -0.142954081,
               0.152464315,
               0.0456621721,
               0.0706774518,
               0.0561114065,
               -0.0129987095,
               0.143054292,
               0.0374928825,
               0.0581034832,
               -0.0249371286,
               0.112558328,
               -0.0165499765,
               0.108751833,
               0.090714775,
               0.0868576914,
               0.158556312,
               -0.136637285,
               0.0722766668,
               -0.127540633,
               0.0763803273,
               -0.0291834213,
               0.0928834,
               0.0149318483,
               -0.135604382,
               0.107026264,
               0.0878666,
               -0.147011638,
               0.114516743,
               0.147453636,
               -0.158554018,
               0.0887899473,
               0.0265064966,
               0.0111482497,
               0.0314141586,
               -0.0608653463,
               0.038294442,
               -0.0417754687,
               0.0544716977,
               0.119397216,
               -0.140743434,
               0.145487413,
               -0.0958617628,
               0.0675159469,
               -0.0250250362,
               -0.155376703,
               0.071572043,
               -0.0122774318,
               -0.15056777,
               0.13723357,
               0.0580636784,
               -0.0298714899,
               0.0771232247,
               -0.048475,
               -0.000946889224,
               -0.0789285824,
               -0.132105872,
               0.0805230141,
               0.0803353041,
               0.0670105219,
               -0.0837273598,
               0.00273995241,
               -0.13783817,
               0.145300925,
               0.00188074599,
               0.112409048,
               -0.134497568,
               -0.0798477456,
               0.0463391505,
               0.0790263191,
               -0.153850988,
               -0.149188861,
               -0.107495494,
               0.140793532,
               -0.152673855,
               0.0463919714,
               -0.00861204,
               0.0302346405,
               -0.106773853,
               -0.0673432052,
               0.0874507353,
               -0.0211754981,
               0.0948605686,
               0.113653749,
               0.142501161,
               0.084228009,
               0.0739521906,
               -0.0692758262,
               0.101231337,
               -0.138693854,
               -0.0462511703,
               -0.0859134197,
               -0.149836868,
               0.0626049638,
               0.000125250663,
               -0.0659428,
               -0.0936966166,
               -0.0167383831,
               0.0223067906,
               -0.114866957,
               -0.0534328744,
               0.107965574,
               -0.0633510351,
               -0.0771744,
               -0.0640921593,
               -0.0669819,
               0.0446841717,
               -0.111305065,
               0.0918344259,
               -0.150042117,
               0.0892894641,
               0.0706354305,
               0.0144453244,
               -0.0373433456,
               -0.0891973,
               -0.12311995,
               0.0231473185,
               0.0306262225,
               -0.0155108077,
               0.00941447821,
               0.0147510916,
               0.0519620962,
               0.0681353211,
               -0.0109948386,
               0.0876854,
               -0.0458790138,
               -0.0653302,
               0.0389034,
               0.0164243486,
               0.0872038826,
               0.148583934,
               -0.0704595074,
               -0.135175213,
               0.115973845,
               -0.149910629,
               0.0856919438,
               -0.00309299515,
               0.00884344429,
               0.133190319,
               0.141150549,
               -0.131421179,
               -0.00674681924,
               0.156028479,
               0.0355475433,
               0.141541466,
               0.117992096,
               0.0440930687,
               -0.00556082744,
               -0.141613692,
               -0.135374397,
               0.0654469952,
               -0.0984156281,
               0.0826103762,
               -0.0921659768,
               -0.290652722,
               0.144459188,
               0.0562519543,
               0.0777300447,
               -0.129824087,
               0.0949444622,
               0.0319866687,
               -0.0714563057,
               0.0732116327,
               0.0776946321,
               -0.149244457,
               0.0547570586,
               0.0838966295,
               -0.123042174,
               -0.140389845,
               -0.0430121422,
               0.0105561446,
               -0.135202706,
               -0.0659374744,
               0.144791573,
               0.0387046561,
               0.0012438983,
               -0.129688814,
               0.0626228526,
               0.0153004425,
               -0.0815695599,
               0.0744719952,
               -0.0251845811,
               0.0918393731,
               -0.0993540585,
               0.062664561,
               0.061668817,
               -0.134038627,
               -0.0993565917,
               -0.0987235159,
               -0.13037318,
               -0.0065837279,
               0.115507789,
               0.101210177,
               -0.102066226,
               0.0551593117,
               -0.111662529,
               0.0710849836,
               0.0265409928,
               0.120471373,
               0.0984964371,
               -0.0189237036,
               -0.046299912,
               -0.104599304,
               0.03898504,
               -0.0836226791,
               0.0976793468,
               -0.109510265,
               -0.0021126261,
               -0.102989607,
               -0.10197562,
               -0.078021042,
               -0.129564479,
               0.016823817,
               -0.101755731,
               -0.113059483,
               -0.105478533,
               -0.118432857,
               0.105992749,
               -0.0891895443,
               -0.0755411908,
               -0.0791384876,
               -0.0181330405,
               0.04396905,
               0.0607477054,
               -0.0267432574,
               0.0964278,
               -0.135227844,
               -0.114746459,
               0.149974659,
               -0.0762463585,
               0.0225233603,
               -0.129633725,
               0.0932574943,
               0.138716,
               0.150625885,
               -0.0984102562,
               -0.0188088343,
               -0.00911891833,
               -0.128149569,
               -0.0665777326,
               -0.066244185,
               0.0504304506,
               -0.0489935391,
               0.117824845,
               0.144741595,
               -0.0484712943,
               0.141279399,
               -0.0451250114,
               0.116114147,
               -0.152337641,
               0.0890849605,
               -0.0804305151,
               0.0119866747,
               0.125381649,
               -0.157766849,
               -0.0887987316,
               0.0725581348,
               -0.132265031,
               0.0355405733,
               -0.152240098,
               0.112599939,
               0.0975619853,
               0.134065419,
               0.0648201853,
               -0.0322465934,
               0.0389133021,
               0.08457084,
               0.0296187364,
               0.010732282,
               -0.00684788777,
               -0.138831705,
               0.00599339604,
               0.138056979,
               -0.0380503871,
               0.0289259981,
               -0.131290451,
               -0.106790602,
               -0.0565267541,
               -0.103731841,
               0.132310584,
               0.00285755075,
               -0.0598491952,
               0.11257825,
               0.0760061443,
               -0.096095033,
               0.041752886,
               -0.0812631,
               -0.149361134,
               0.135411829,
               -0.100504801,
               -0.106991485,
               -0.0793061852,
               0.0437221415,
               0.117543839,
               -0.0965227038,
               -0.0344351716,
               -0.140478134,
               0.100297682,
               -0.142782077,
               0.149608895,
               -0.0968799591,
               -0.152868971,
               0.056566231,
               -0.0505539812,
               0.0740836412,
               -0.0381686315,
               -0.0500445366,
               0.0430417359,
               -0.103885628,
               -0.119083092,
               0.0545076467,
               -0.0952213705,
               0.154321045,
               -0.0525275357,
               -0.0388865061,
               0.0800760835,
               0.063343212,
               0.0813778192,
               -0.0580529049,
               0.0379780754,
               0.0154584982,
               0.15369615,
               0.116298325,
               0.102138318,
               0.114897966,
               -0.0203837082,
               0.0124679627,
               -0.144895017,
               -0.130981803,
               0.0228766929,
               0.152629197,
               -0.136197656,
               -0.14412646,
               0.149945244,
               0.146486714,
               -0.0187404,
               -0.153538272,
               -0.0290826373,
               -0.122424498,
               -0.126101032,
               -0.0587198138,
               0.034157712,
               0.120705575,
               0.0054677478,
               -0.139381722,
               0.00207332545,
               0.00231806,
               -0.132276833,
               -0.0958463624,
               -0.00871808734,
               0.131011695,
               -0.0920372382,
               0.00310931937,
               -0.118997559,
               0.0697976425,
               0.113999963,
               -0.137825623,
               -0.00894578,
               -0.115504585,
               0.133299917,
               -0.0630035475,
               -0.132566452,
               0.114996426,
               -0.0594427846,
               -0.0586084276,
               0.059815336,
               -0.0147838369,
               0.0671184584,
               0.103318945,
               -0.0245544035,
               0.0997252911,
               0.00879824627,
               0.0398104936,
               0.00491246581,
               0.132208869,
               0.00953595,
               0.0956483781,
               0.0971774533,
               -0.066280514,
               -0.151534945,
               0.0393706821,
               -0.149784118,
               0.0565680489,
               -0.078289181,
               0.109339848,
               0.131962568,
               0.00685446,
               -0.0237646978,
               0.0908603817,
               -0.0383610204,
               -0.144506216,
               0.0114032486,
               0.131612673,
               0.0749552622,
               -0.107839704,
               0.114946723,
               0.00372206466,
               0.140083283,
               -0.0507401042,
               0.0284969714,
               -0.00137359765,
               -0.0716714263,
               -0.0783710331,
               0.0300546754,
               -0.111070544,
               0.0815398395,
               0.121989362,
               -0.0905368328,
               -0.0697399825,
               -0.00965083204,
               0.000826835167,
               0.00737166405,
               0.140886739,
               0.144926503,
               -0.113431916,
               -0.102118269,
               0.131098434,
               -0.15421851,
               0.0307390019,
               -0.0994649,
               -0.111836545,
               0.0267238449,
               -0.0569716431,
               0.0594168305,
               -0.013280943,
               0.0929153264,
               0.140621424,
               0.0656702146,
               0.13678655,
               0.0571459718,
               -0.00927522872,
               -0.00258178171,
               0.141241446,
               0.0157249402,
               0.0647366941,
               -0.0655410439,
               -0.148239747,
               0.0988360047,
               -0.149274155,
               0.083870627,
               -0.100489683,
               -0.0746993,
               -0.0763226226,
               0.11495591,
               -0.0118229454,
               -0.0958039537,
               -0.0928589255,
               0.150117621,
               0.0545410924,
               -0.116594635,
               -0.0705468878,
               -0.00331257959,
               0.048976168,
               -0.0941699743,
               -0.236909106,
               0.0784276873,
               0.147578642,
               0.0993497819,
               0.0567501038,
               -0.089801304,
               0.121765852,
               0.00193678611,
               0.0847995728,
               0.0737177506,
               -0.148323417,
               -0.0530416518,
               -0.0255449414,
               -0.0199886207,
               0.0257209111,
               0.0483188294,
               0.099291414,
               0.122094229,
               -0.129388124,
               -0.0302635077,
               0.0451691374,
               -0.00658132602,
               -0.133584499,
               0.101843052,
               -0.089167513,
               -0.144678131,
               -0.0230855811,
               -0.143104061,
               -0.0845941231,
               -0.0929235294,
               -0.132073447,
               0.0924047902,
               0.119986475,
               -0.151821777,
               0.152737796,
               0.0606296249,
               0.0451717936,
               -0.0134694651,
               0.114273712,
               0.154756963,
               0.0436765812,
               -0.123835407,
               -0.0296875071,
               0.0297379103,
               -0.112937279,
               -0.082869485,
               -0.0015508323,
               -0.04490133,
               -0.0268319082,
               0.020894235,
               0.104343526,
               0.0128221931,
               -0.0147171309,
               -0.00249389652,
               -0.0515501238,
               -0.122596048,
               0.136792436,
               -0.122717179,
               -0.0459894724,
               -0.0470356159,
               0.0854829773,
               0.10275016,
               0.0865303874,
               0.120294258,
               -0.0832061097,
               0.0608930886,
               -0.0201956201,
               -0.099547796,
               0.0598678626,
               0.10837014,
               0.0259495098,
               -0.0818995759,
               0.120813206,
               0.116273247,
               -0.146605641,
               0.085586004,
               0.00108367205,
               0.139014468,
               -0.0608193539,
               0.00427643536,
               -0.101523615,
               -0.0249046497,
               -0.153452173,
               -0.0765417293,
               0.0991005749,
               -0.0472133346,
               0.00154356344,
               -0.0150126247,
               0.0283590164,
               -0.106697142,
               0.111540593,
               -0.124821804,
               0.0135626076,
               -0.0306997634,
               -0.120714501,
               -0.0607961901,
               0.0830065906,
               0.126468524,
               0.0898979306,
               -0.145339876,
               0.0619913787,
               -0.101578236,
               0.152519315,
               -0.0563798249,
               -0.120554052,
               -0.12889041,
               -0.0435979813,
               -0.104207844,
               0.0433871672,
               0.131722838,
               0.0116946967,
               -0.0416264795,
               0.0657819882,
               -0.063097544,
               -0.0319848098,
               0.0180155579,
               0.0551175103,
               0.0144249117,
               -0.0391315,
               -0.105593674,
               -0.0225285385,
               0.0541036911,
               -0.0660736784,
               -0.131481856,
               0.0968467295,
               0.00310278125,
               -0.149309263,
               0.142042637,
               -0.0299774166,
               0.0989740491,
               -0.0145054962,
               -0.0183112267,
               0.077072233,
               -0.079900153,
               -0.149518654,
               0.0137001825,
               0.0821299106,
               0.0353324376,
               0.0869437829,
               0.0746247098,
               -0.0667877197,
               0.0196144693,
               0.117053159,
               -0.0575114824,
               -0.13352482,
               -0.104023367,
               -0.138520345,
               0.0427191556,
               0.0549123399,
               -0.0872808844,
               0.108792916,
               -0.0912580267,
               0.0367434248,
               -0.0766578168,
               -0.0650562942,
               0.0814027414,
               -0.0240103565,
               -0.0714069679,
               -0.00314131146,
               0.0354542546,
               -0.127031937,
               -0.0147374338,
               0.0264621023,
               0.116598092,
               0.097347945,
               0.143061623,
               -0.117525108,
               0.0643766373,
               -0.00340646156,
               -0.145726815,
               0.0239769351,
               0.0791147649,
               -0.0943739489,
               0.125176832,
               0.100112,
               -0.13898997,
               0.103195049,
               0.125639141,
               -0.112408213,
               0.0370562673,
               -0.143391564,
               0.0790149048,
               0.100648396,
               0.0852311775,
               0.150034592,
               0.00386244105,
               -0.0493741073,
               0.105701983,
               -0.0276740212,
               0.0775565803,
               0.0343915112,
               0.0836264938,
               -0.0407435969,
               0.119171657,
               0.132796258,
               0.119736612,
               0.0030486146,
               0.0964698568,
               0.00394716207,
               0.150277421,
               0.0374573655,
               -0.0993466452,
               0.050858546,
               -0.00915878173,
               -0.10505265,
               0.0850639492,
               -0.0938243866,
               0.129179612,
               0.0297917463,
               0.0374609828,
               0.143084273,
               -0.0272284504,
               -0.0588149168,
               0.00695096795,
               0.132830516,
               0.0166755114,
               -0.0105027584,
               0.0874685124,
               -0.0748558193,
               -0.113937438,
               -0.118045934,
               -0.0164407659,
               0.15568161,
               -0.122070521,
               0.11706651,
               0.145776689,
               -0.151510805,
               -0.138986543,
               0.0511998758,
               -0.0998579189,
               0.041591391,
               -0.113275982,
               0.0182089638,
