{
 "irVersion": "6",
 "opsetImport": [],
 "producerName": "tenncor",
 "producerVersion": "1.0.0",
 "domain": "com.tenncor.eteq",
 "modelVersion": "6",
 "docString": "",
 "graph": {
  "node": [
   {
    "input": [
     "_i0"
    ],
    "output": [
     "_r0"
    ],
    "name": "_r0",
    "opType": "_LSTM_LAYER",
    "domain": "",
    "attribute": [
     {
      "name": "layer",
      "refAttrName": "",
      "docString": "",
      "type": "GRAPH",
      "f": 0,
      "i": "0",
      "s": "",
      "g": {
       "node": [
        {
         "input": [
          "_i0"
         ],
         "output": [
          "1"
         ],
         "name": "1",
         "opType": "SLICE",
         "domain": "",
         "attribute": [
          {
           "name": "dimension_pairs",
           "refAttrName": "",
           "docString": "",
           "type": "INTS",
           "f": 0,
           "i": "0",
           "s": "",
           "floats": [],
           "ints": [
            "0",
            "65535",
            "0",
            "1",
            "0",
            "65535",
            "0",
            "65535",
            "0",
            "65535",
            "0",
            "65535",
            "0",
            "65535",
            "0",
            "65535"
           ],
           "strings": [],
           "tensors": [],
           "graphs": [],
           "sparseTensors": []
          }
         ],
         "docString": ""
        },
        {
         "input": [
          "1",
          "2"
         ],
         "output": [
          "3"
         ],
         "name": "3",
         "opType": "CONCAT",
         "domain": "",
         "attribute": [
          {
           "name": "rank",
           "refAttrName": "",
           "docString": "",
           "type": "INT",
           "f": 0,
           "i": "0",
           "s": "",
           "floats": [],
           "ints": [],
           "strings": [],
           "tensors": [],
           "graphs": [],
           "sparseTensors": []
          }
         ],
         "docString": ""
        },
        {
         "input": [
          "3"
         ],
         "output": [
          "8"
         ],
         "name": "8",
         "opType": "_DENSE_LAYER",
         "domain": "",
         "attribute": [
          {
           "name": "layer",
           "refAttrName": "",
           "docString": "",
           "type": "GRAPH",
           "f": 0,
           "i": "0",
           "s": "",
           "g": {
            "node": [
             {
              "input": [
               "3",
               "4"
              ],
              "output": [
               "5"
              ],
              "name": "5",
              "opType": "MATMUL",
              "domain": "",
              "attribute": [
               {
                "name": "rank_pairs",
                "refAttrName": "",
                "docString": "",
                "type": "INTS",
                "f": 0,
                "i": "0",
                "s": "",
                "floats": [],
                "ints": [
                 "0",
                 "1"
                ],
                "strings": [],
                "tensors": [],
                "graphs": [],
                "sparseTensors": []
               }
              ],
              "docString": ""
             },
             {
              "input": [
               "6"
              ],
              "output": [
               "7"
              ],
              "name": "7",
              "opType": "EXTEND",
              "domain": "",
              "attribute": [
               {
                "name": "tensor",
                "refAttrName": "",
                "docString": "",
                "type": "TENSOR",
                "f": 0,
                "i": "0",
                "s": "",
                "t": {
                 "dims": [],
                 "dataType": 0,
                 "floatData": [],
                 "int32Data": [],
                 "stringData": [],
                 "int64Data": [],
                 "name": "5",
                 "docString": "",
                 "rawData": "",
                 "externalData": [],
                 "dataLocation": "DEFAULT",
                 "doubleData": [],
                 "uint64Data": []
                },
                "floats": [],
                "ints": [],
                "strings": [],
                "tensors": [],
                "graphs": [],
                "sparseTensors": []
               }
              ],
              "docString": ""
             },
             {
              "input": [
               "5",
               "7"
              ],
              "output": [
               "8"
              ],
              "name": "8",
              "opType": "ADD",
              "domain": "",
              "attribute": [],
              "docString": ""
             }
            ],
            "name": "",
            "initializer": [
             {
              "dims": [
               "100",
               "150",
               "1",
               "1",
               "1",
               "1",
               "1",
               "1"
              ],
              "dataType": 1,
              "floatData": [
               -0.0448692441,
               -0.127804175,
               0.0319831185,
               0.12153393,
               0.144828871,
               -0.0967742652,
               0.00604610518,
               -0.0342421047,
               -0.0733992606,
               0.0750834122,
               -0.129280508,
               0.0185871329,
               0.0228364207,
               0.0964296609,
               0.0279118828,
               0.00429062685,
               0.115694597,
               0.150161266,
               0.0721156299,
               0.142492011,
               -0.0626939759,
               -0.0226680785,
               0.125027418,
               0.0506424494,
               0.122866563,
               0.143872738,
               -0.102252305,
               0.108573452,
               0.122750252,
               -0.0626754835,
               0.134121135,
               -0.0252533685,
               -0.0588140301,
               0.00657730736,
               -0.0316406116,
               0.0874236375,
               0.058348719,
               0.015326554,
               0.0285132397,
               -0.12757045,
               0.0339883044,
               -0.0230652429,
               0.0305562094,
               0.104384027,
               -0.00174479384,
               0.0848490149,
               -0.133865327,
               -0.0953901708,
               -0.086169295,
               0.0864876658,
               -0.129793823,
               -0.100838497,
               0.0370420553,
               0.0215823594,
               0.073394917,
               -0.0563446209,
               -0.0207901262,
               -0.0269217957,
               0.128290743,
               0.153452352,
               0.0240515769,
               -0.104403712,
               0.0637303814,
               -0.0509870537,
               -0.0139154382,
               -0.134176224,
               -0.113435455,
               -0.101777844,
               -0.0193319675,
               -0.143829107,
               0.000383897685,
               -0.010472578,
               0.0271049906,
               0.0518144593,
               -0.126554266,
               -0.132806882,
               0.100364208,
               -0.0345858373,
               -0.0959894,
               -0.10364344,
               0.142478839,
               0.150181711,
               -0.121185556,
               0.112513453,
               0.0370768271,
               0.0550441071,
               0.0351362228,
               0.0286258,
               -0.104965717,
               -0.0776397288,
               0.0943406,
               0.028238764,
               0.125695497,
               -0.0694665164,
               -0.0938021243,
               -0.0699441433,
               -0.0339296,
               -0.125121519,
               0.0465586595,
               0.0409551449,
               -0.273201227,
               -0.107796133,
               -0.127267659,
               0.140076146,
               0.0125139989,
               -0.142213598,
               0.0168257281,
               0.0706976205,
               -0.00441762293,
               -0.010982248,
               -0.15546678,
               -0.0859488621,
               -0.0929536894,
               0.0225063134,
               -0.119986802,
               0.0327634476,
               -0.103198454,
               0.0575639904,
               -0.0775019154,
               0.0495035797,
               -0.1420293,
               -0.100876577,
               -0.0410976075,
               0.080686368,
               -0.0344392695,
               0.100791514,
               0.0208979547,
               0.0767605603,
               0.0563015863,
               -0.0552241616,
               0.100423649,
               0.0108927293,
               0.0872654617,
               -0.10744635,
               0.026169043,
               0.0885848254,
               0.140252307,
               0.129057586,
               0.0877498761,
               0.0903767273,
               0.0224120263,
               -0.153605521,
               -0.107713044,
               0.000272840029,
               0.0816504881,
               -0.0631601959,
               0.0304396506,
               0.0185355488,
               0.107225358,
               0.000911309849,
               0.126683921,
               -0.0608303584,
               0.0910684541,
               0.148625,
               -0.135385439,
               0.144947648,
               -0.0878945,
               -0.0161486845,
               0.0370383374,
               -0.0600603707,
               0.129651725,
               -0.135973305,
               -0.0791172609,
               0.0937073305,
               -0.0203114469,
               0.146769345,
               0.036663048,
               -0.139959708,
               0.104834944,
               -0.0808266476,
               0.0145244598,
               -0.123576552,
               0.142468274,
               0.00715604099,
               -0.0998485461,
               0.00836865325,
               0.100791,
               -0.0531405099,
               -0.0187922176,
               -0.05667153,
               0.0644923076,
               0.145980656,
               -0.0932041258,
               0.0707847625,
               -0.0422617383,
               0.141863391,
               -0.144426927,
               -0.139195129,
               0.119568042,
               0.0195402037,
               0.152028948,
               -0.136602625,
               -0.130366042,
               0.0975010097,
               -0.118246309,
               0.149465859,
               -0.0612228252,
               -0.084899433,
               0.0986375287,
               -0.0296108574,
               0.316842467,
               0.0381921493,
               0.150646821,
               0.0800451338,
               -0.0970751271,
               0.127894342,
               0.0540879816,
               -0.147476017,
               0.00510890828,
               0.102348782,
               0.069312878,
               0.12525107,
               0.0717144534,
               -0.0993430316,
               -0.056552235,
               0.0217153113,
               -0.102534555,
               -0.0583701544,
               0.0542810559,
               -0.0360728912,
               -0.0767478049,
               -0.0107114669,
               -0.0327265337,
               -0.0932597816,
               0.0118841454,
               -0.0736695677,
               0.0856236517,
               0.0309637897,
               0.0939792767,
               -0.0921843126,
               -0.0216319095,
               -0.109189,
               -0.0503018498,
               0.0554742888,
               0.127776757,
               0.0900939181,
               -0.0619462095,
               -0.104267456,
               -0.0783338249,
               -0.0114587769,
               -0.0615265407,
               -0.078880772,
               -0.075370796,
               0.149474129,
               -0.0612230189,
               0.0625061,
               0.125519082,
               0.107775338,
               -0.00743975071,
               -0.133995965,
               -0.12387798,
               -0.0985691771,
               0.0652341,
               -0.156023741,
               -0.0799299479,
               -0.0167113282,
               -0.00538444379,
               -0.0333367661,
               -0.146634936,
               -0.111237332,
               -0.0619241931,
               -0.0777972192,
               0.0463315398,
               -0.0118617984,
               0.106172048,
               0.0570927225,
               0.139315382,
               -0.0923348144,
               -0.101503767,
               -0.0992872119,
               0.140261441,
               -0.0336737595,
               0.0763739944,
               -0.114607602,
               0.091663681,
               0.0686970055,
               -0.092724435,
               -0.00894959643,
               0.140644789,
               -0.0431030393,
               0.0266679674,
               -0.157965198,
               0.141347036,
               0.143616095,
               0.048015058,
               -0.0772831216,
               -0.0296286121,
               0.0498782732,
               0.0776327625,
               0.133626506,
               -0.0217322409,
               0.0289254971,
               0.134820059,
               0.127088681,
               -0.119164445,
               -0.0504056588,
               -0.0467642657,
               -0.0606444627,
               -0.0067699803,
               0.0538318567,
               -0.182161495,
               -0.0152273038,
               0.0159691796,
               -0.0299066026,
               -0.0305158757,
               0.0363927335,
               -0.0903855935,
               0.0741495341,
               -0.147429362,
               -0.141235992,
               -0.037863832,
               0.0538036786,
               0.140041456,
               -0.14943102,
               -0.0214048009,
               0.0111313676,
               -0.0657484457,
               0.134978876,
               0.0281712264,
               -0.0385309346,
               0.0262872279,
               -0.00211015623,
               -0.0536459535,
               0.0561312437,
               -0.103239313,
               0.0885291,
               0.0156697948,
               0.120207489,
               0.124559142,
               0.0708089545,
               0.0754288435,
               -0.054847315,
               0.0998311043,
               -0.109018609,
               0.0738761276,
               -0.0828453824,
               -0.138996035,
               -0.088241227,
               0.0734096318,
               -0.0890969336,
               0.0183832198,
               0.0231833607,
               -0.103032388,
               0.0770867616,
               -0.0996722728,
               0.089375332,
               -0.0233128518,
               -0.113529965,
               -0.094135873,
               -0.0372115523,
               0.136013255,
               -0.0403600521,
               0.035252288,
               -0.0641296655,
               0.0273636859,
               0.0453328304,
               -0.126733422,
               0.0998226628,
               -0.0078322161,
               0.087631993,
               0.136575133,
               0.00610535359,
               -0.032899607,
               -0.0897294655,
               -0.0410667174,
               0.0404269658,
               -0.121286802,
               0.0429599322,
               0.0187281221,
               0.0739343911,
               0.053319227,
               0.0566713177,
               -0.0343457572,
               -0.030443592,
               0.070701316,
               -0.151707679,
               -0.14709489,
               -0.0737233162,
               -0.117467843,
               0.113352798,
               -0.0431489423,
               0.0444027744,
               -0.0853837952,
               0.0359723456,
               -0.0404179804,
               0.0396303795,
               -0.0586922877,
               0.0290593151,
               0.1465832,
               0.144547716,
               -0.100179583,
               0.0354992859,
               -0.14217338,
               -0.00920613389,
               -0.0484209023,
               0.0380516648,
               -0.127272666,
               -0.105603561,
               -0.108550876,
               -0.110043593,
               -0.0320917591,
               0.113229886,
               0.129891559,
               -0.12469244,
               0.0682009757,
               -0.0144454986,
               -0.0211096536,
               -0.0551926903,
               -0.101793528,
               0.00416564802,
               0.0408447348,
               -0.113607183,
               -0.023571264,
               -0.13317807,
               0.0867147669,
               -0.145560071,
               0.0257096123,
               0.147929147,
               0.114451312,
               0.141343147,
               -0.0432619117,
               -0.154142991,
               -0.0546837226,
               -0.0358540528,
               0.138578072,
               -0.0291235074,
               -0.0267115161,
               -0.093645364,
               -0.143912703,
               -0.0441275686,
               0.101300515,
               0.0731206164,
               -0.0688864589,
               0.0397297665,
               0.10663794,
               -0.0455314294,
               0.00650789123,
               -0.117929,
               -0.108629361,
               0.0492318235,
               -0.109475777,
               0.108403966,
               -0.0723939314,
               -0.102785215,
               -0.13652803,
               -0.0992211103,
               0.114190191,
               0.0413997471,
               -0.0137037458,
               -0.00632417342,
               0.0571018979,
               -0.0223646257,
               -0.120386101,
               0.0778579712,
               -0.0774952322,
               -0.145416111,
               0.0623620898,
               -0.129655033,
               -0.02903964,
               0.0338400044,
               0.064477846,
               0.0474483669,
               0.154392019,
               0.109840088,
               -0.0707535371,
               -0.070816122,
               -0.120419212,
               0.0463299043,
               -0.0958548486,
               -0.13290675,
               -0.098904,
               -0.111239381,
               -0.076682657,
               -0.117561355,
               -0.115695059,
               0.139080316,
               0.0716146305,
               0.135001466,
               -0.114649236,
               0.129662499,
               -0.0135703012,
               -0.120561704,
               0.0947494954,
               0.0706346706,
               0.0257467814,
               0.0746568739,
               0.0790159628,
               -0.000226714124,
               -0.0832133368,
               0.0569371618,
               -0.0753870159,
               0.0710578,
               -0.0513395444,
               0.126732156,
               0.131865919,
               0.119372316,
               -0.151563704,
               0.0945706218,
               0.110920437,
               0.11350888,
               -0.175774828,
               -0.0245660171,
               0.128477782,
               -0.00654107518,
               0.135675684,
               0.0837968588,
               0.109008893,
               -0.089290373,
               0.124081045,
               -0.150864154,
               -0.0587577969,
               0.12290781,
               0.0841541663,
               0.0288394876,
               0.0321985446,
               -0.128157914,
               0.0580508858,
               -0.105506524,
               -0.0137518849,
               -0.0659191683,
               -0.0706325844,
               0.151261955,
               0.0585476533,
               0.133552894,
               -0.00644195359,
               0.105143748,
               0.037562985,
               0.101278208,
               0.0314945392,
               -0.0974900275,
               0.0684889331,
               0.0491066165,
               -0.0586364865,
               -0.084992528,
               0.0665307194,
               -0.0357797667,
               0.0753745958,
               0.0631700382,
               -0.0710881203,
               -0.138584897,
               -0.0446244739,
               0.110662475,
               -0.0432345234,
               0.0526087433,
               -0.0289553218,
               0.0525768436,
               -0.148435801,
               -0.15165554,
               0.0147694945,
               -0.140916,
               -0.0579241142,
               0.0492607169,
               -0.0199235547,
               0.134668916,
               -0.0818747804,
               -0.0593414679,
               0.035393808,
               0.139633834,
               0.0886949822,
               -0.121016599,
               -0.147584274,
               0.134449989,
               -0.0342116132,
               -0.0386002958,
               0.0406416543,
               -0.110634163,
               0.0841243714,
               -0.0799642727,
               0.0535634942,
               -0.0330560021,
               -0.145054132,
               -0.106532887,
               -0.00676788716,
               -0.0370595269,
               -0.104727715,
               0.14859283,
               0.0665696114,
               0.100701883,
               0.104657255,
               -0.0557720661,
               -0.134601623,
               -0.0985630155,
               -0.0503194034,
               -0.0108889583,
               0.028259268,
               0.107148081,
               -0.0645557418,
               -0.0476154909,
               -0.117093422,
               0.0498439558,
               -0.0379609056,
               -0.0206569508,
               -0.0783953369,
               -0.0324526876,
               0.143448576,
               0.0819991454,
               -0.0432139561,
               0.0911145881,
               0.0381459519,
               0.136785895,
               -0.143518269,
               0.00603546295,
               0.0523483865,
               0.144067958,
               -0.0986156762,
               -0.0955532938,
               0.128027707,
               -0.0554924905,
               -0.0468399115,
               0.0124463057,
               0.0784318149,
               0.123910844,
               -0.0632823,
               -0.0918020308,
               0.0230951831,
               -0.00579438498,
               0.0624197498,
               0.0905862153,
               -0.0330937542,
               0.0979609787,
               -0.147243097,
               -0.0650982559,
               0.111422122,
               0.141774237,
               -0.0691698939,
               -0.111115269,
               -0.063416943,
               0.064953,
               -0.0638405234,
               0.0839659721,
               0.147275493,
               -0.0854869708,
               -0.103078835,
               -0.102908552,
               -0.0386791714,
               -0.122674517,
               -0.0858512074,
               0.122112162,
               -0.147971541,
               0.0451893359,
               -0.0306287576,
               0.128075674,
               0.0903767869,
               0.130575716,
               -0.0528124087,
               -0.00393069256,
               0.0213940497,
               0.0214757901,
               -0.0123382276,
               -0.109936945,
               -0.053770259,
               0.071911335,
               -0.0555981286,
               0.118603013,
               -0.0555394627,
               -0.0346309207,
               0.108441755,
               -0.142417133,
               0.0176751912,
               -0.075671114,
               0.126130387,
               0.102199763,
               0.0531169735,
               0.0823520869,
               0.148805708,
               -0.0120561551,
               -0.0448246635,
               0.130223587,
               0.133419752,
               -0.0301441643,
               0.124853119,
               0.120962545,
               -0.00762978522,
               0.0311663169,
               -0.140508011,
               -0.0607747473,
               -0.14151153,
               -0.0275785979,
               -0.140275314,
               0.0658459142,
               0.0593998469,
               0.0313551389,
               0.115905188,
               -0.00828068331,
               -0.152299389,
               -0.0593013838,
               0.086484246,
               -0.103499882,
               0.125672072,
               -0.0146954944,
               0.151680321,
               -0.0690377653,
               0.118722193,
               0.114282422,
               -0.0838865563,
               -0.0175536834,
               0.0420768075,
               0.0706943944,
               -0.10877876,
               0.10132397,
               -0.116505861,
               -0.146713257,
               -0.112035736,
               -0.0914108,
               -0.0983201191,
               0.0224267524,
               0.118530586,
               -0.106400236,
               0.0260765,
               -0.0301370248,
               -0.0218821112,
               -0.0822961107,
               -0.0819789097,
               -0.00455094129,
               -0.0570132211,
               0.0429018661,
               0.129988924,
               0.0649607405,
               -0.133412212,
               0.00945413671,
               -0.144156471,
               -0.126334116,
               -0.121368408,
               0.0436280966,
               0.0362638682,
               0.0480498224,
               0.0623425804,
               -0.131491661,
               0.0248711333,
               -0.106667481,
               0.0211428776,
               0.0369228721,
               -0.0639553741,
               0.0125250975,
               -0.139866725,
               -0.0845718086,
               -0.0226180349,
               -0.0202697013,
               -0.0717079788,
               -0.0646022484,
               0.0599296428,
               0.132588297,
               0.034578383,
               0.0374296792,
               -0.129644915,
               0.00821038522,
               -0.118218206,
               0.0626083612,
               0.113690235,
               -0.00210051588,
               0.101031981,
               0.128237352,
               -0.106615469,
               0.0719792098,
               -0.00685198093,
               0.144332469,
               -0.109553121,
               0.102226414,
               0.121553704,
               -0.117990777,
               0.0958380848,
               0.017184576,
               0.0253539644,
               0.0492539927,
               0.0392464586,
               0.122244857,
               -0.0859056711,
               0.0817089155,
               0.0284158755,
               0.148549229,
               0.0881075114,
               -0.000312976423,
               -0.109339245,
               -0.0212410279,
               0.0977136046,
               0.118784264,
               0.0625093132,
               -0.143792748,
               -0.00720571773,
               -0.136689171,
               -0.00919443183,
               0.0165217575,
               0.106730513,
               -0.0957996547,
               0.0018375424,
               0.0154472142,
               -0.0701429769,
               0.0491072237,
               0.0611501,
               -0.0967310295,
               0.0883987,
               -0.0621415637,
               0.145866096,
               0.00656626699,
               -0.138876557,
               0.0683023259,
               0.003489475,
               -0.0372827463,
               -0.00079016923,
               0.0356282666,
               0.00717598759,
               -0.0663188845,
               -0.123028241,
               0.0780504495,
               0.0149943298,
               0.00315575884,
               -0.0870501548,
               0.0213392172,
               -0.045276396,
               0.145513713,
               0.0974457264,
               0.143621773,
               0.118916169,
               0.0703065842,
               -0.0782715678,
               -0.145813391,
               -0.100570388,
               0.0787819251,
               -0.0481534787,
               0.064394854,
               -0.0490337089,
               -0.0058046733,
               -0.14240849,
               -0.0699082911,
               -0.0500866398,
               -0.0737580582,
               0.112817302,
               0.0399102755,
               -0.0543841794,
               0.13672182,
               0.020313995,
               0.0133145703,
               -0.0479277819,
               0.0457463376,
               0.106966473,
               -0.0371818244,
               0.0562069193,
               -0.0885302871,
               -0.0554704033,
               0.138427913,
               0.0153389946,
               0.126440182,
               -0.135142639,
               -0.0499143898,
               0.0162627418,
               -0.0694535598,
               0.0558014549,
               -0.142875582,
               0.152202696,
               0.0456365794,
               0.0708537921,
               0.0566905029,
               -0.0128084943,
               0.142868862,
               0.0373489708,
               0.0579558,
               -0.0245798454,
               0.113163717,
               -0.0165395904,
               0.108608641,
               0.0903941616,
               0.0861472562,
               0.157527208,
               -0.136914194,
               0.0726673529,
               -0.126476943,
               0.0761431605,
               -0.0290031824,
               0.0928701386,
               0.0147698475,
               -0.135103792,
               0.107209504,
               0.0871583372,
               -0.145471677,
               0.114340685,
               0.146685854,
               -0.157829508,
               0.088908188,
               0.0265029725,
               0.0112005435,
               0.0312143341,
               -0.0605380498,
               0.0383736119,
               -0.040555533,
               0.0537966751,
               0.119056992,
               -0.140972391,
               0.14561449,
               -0.0962840095,
               0.0687475801,
               -0.025514897,
               -0.155210972,
               0.0712562576,
               -0.0123647405,
               -0.150510386,
               0.137009352,
               0.0582159348,
               -0.0298893824,
               0.0769406557,
               -0.0484145544,
               -0.0131519577,
               -0.0791330561,
               -0.132322878,
               0.0804835111,
               0.0802915171,
               0.0671497956,
               -0.0840859413,
               0.00333358254,
               -0.137823686,
               0.145518228,
               0.00294366921,
               0.112512365,
               -0.133614659,
               -0.0798493177,
               0.0465111025,
               0.0788126811,
               -0.153758943,
               -0.148315504,
               -0.108113773,
               0.141604885,
               -0.152733922,
               0.0462500267,
               -0.00911477115,
               0.0293837078,
               -0.106083453,
               -0.067424424,
               0.0869836211,
               -0.0203074683,
               0.0959652588,
               0.113304496,
               0.142942026,
               0.083888635,
               0.0736882389,
               -0.0697949082,
               0.100985788,
               -0.138130188,
               -0.0462707318,
               -0.0866464227,
               -0.149795368,
               0.0630871058,
               0.00014777077,
               -0.0653665438,
               -0.0936313421,
               -0.0156903248,
               0.0221870709,
               -0.114859477,
               -0.0532554686,
               0.108042829,
               -0.0633039698,
               -0.0771177039,
               -0.0636567846,
               -0.0664247051,
               0.0446232781,
               -0.110251196,
               0.0921284929,
               -0.150404647,
               0.0898108333,
               0.0707417727,
               0.0139263459,
               -0.0377780274,
               -0.0893456712,
               -0.123023361,
               0.0223221146,
               0.0304953,
               -0.0153012043,
               0.0105021168,
               0.0144470809,
               0.0523058251,
               0.0683642626,
               -0.0108593758,
               0.088066414,
               -0.0459268205,
               -0.0658204332,
               0.0398239791,
               0.0166539717,
               0.0866767094,
               0.149524704,
               -0.0703752488,
               -0.135188699,
               0.11612539,
               -0.150143281,
               0.0863679275,
               -0.00290741236,
               0.00961565226,
               0.133444265,
               0.140629992,
               -0.131511778,
               -0.00733533874,
               0.155179247,
               0.0363591798,
               0.141031221,
               0.118179634,
               0.04372878,
               -0.00614545448,
               -0.141549796,
               -0.135704562,
               0.0659599081,
               -0.098456718,
               0.0822969228,
               -0.0923215747,
               -0.277757496,
               0.144610628,
               0.056244228,
               0.0777983218,
               -0.129944757,
               0.0948962644,
               0.0320522599,
               -0.0712169558,
               0.0730146319,
               0.0779447258,
               -0.14837724,
               0.0548435897,
               0.0842377841,
               -0.122815043,
               -0.140107185,
               -0.0429681502,
               0.0104619497,
               -0.13457045,
               -0.0663088039,
               0.144742891,
               0.0386790968,
               0.00114852877,
               -0.12985827,
               0.0622574352,
               0.015724333,
               -0.081350632,
               0.074300684,
               -0.0247344542,
               0.0925742537,
               -0.0994395,
               0.0630557537,
               0.0617471784,
               -0.134142965,
               -0.0996751636,
               -0.0984176695,
               -0.130094662,
               -0.00697565498,
               0.115063779,
               0.101171814,
               -0.102131613,
               0.0551218837,
               -0.111417219,
               0.0710117072,
               0.0272936113,
               0.120581493,
               0.0987915,
               -0.0188577548,
               -0.0462396629,
               -0.104802594,
               0.0389573388,
               -0.0834585428,
               0.0980867073,
               -0.109391786,
               -0.00202653604,
               -0.103080019,
               -0.102074392,
               -0.0777547,
               -0.129113272,
               0.0168512668,
               -0.101879835,
               -0.11329601,
               -0.105882905,
               -0.119131498,
               0.105783179,
               -0.0889017656,
               -0.0747499093,
               -0.0792772621,
               -0.0179963335,
               0.0439673662,
               0.0606483519,
               -0.0263910275,
               0.0964817479,
               -0.135664761,
               -0.113754995,
               0.149873883,
               -0.0768069625,
               0.0231028199,
               -0.129555285,
               0.0932629257,
               0.138760179,
               0.150490105,
               -0.0981448218,
               -0.0187554304,
               -0.00820671767,
               -0.128576964,
               -0.0668142065,
               -0.0663899332,
               0.0504491851,
               -0.0493029952,
               0.118684269,
               0.144485295,
               -0.0483494774,
               0.141141579,
               -0.0452378765,
               0.116152696,
               -0.152494937,
               0.0892149,
               -0.08045616,
               0.0118588721,
               0.125347719,
               -0.157049388,
               -0.0888948217,
               0.0724209547,
               -0.132217124,
               0.0354668796,
               -0.152171537,
               0.112428226,
               0.0979906395,
               0.134007841,
               0.0650567487,
               -0.0313462093,
               0.0390256941,
               0.0852321908,
               0.0296978876,
               0.0109237926,
               -0.00697594834,
               -0.138810501,
               0.00666569825,
               0.137575969,
               -0.0375717878,
               0.0288781729,
               -0.131416067,
               -0.107185543,
               -0.0571581125,
               -0.103183143,
               0.132332921,
               0.0025159861,
               -0.0591765493,
               0.113461643,
               0.0757712424,
               -0.0956830233,
               0.0415615216,
               -0.0814679489,
               -0.14976947,
               0.135327324,
               -0.100085802,
               -0.107126065,
               -0.0798966289,
               0.0437323973,
               0.117829621,
               -0.0965188369,
               -0.0340106636,
               -0.140464038,
               0.10116078,
               -0.142808169,
               0.149722427,
               -0.0967800468,
               -0.152802,
               0.0565215275,
               -0.0505337678,
               0.0744122416,
               -0.0377123393,
               -0.0500514694,
               0.043799568,
               -0.103734232,
               -0.119325899,
               0.0549064167,
               -0.0950059891,
               0.154032201,
               -0.0528349467,
               -0.0390532054,
               0.0800551549,
               0.0626504943,
               0.0812279582,
               -0.0578331277,
               0.038888786,
               0.0152493194,
               0.153947026,
               0.116437204,
               0.102194972,
               0.11523287,
               -0.0204323959,
               0.0120725967,
               -0.144087836,
               -0.130865589,
               0.0223805606,
               0.153400362,
               -0.136125833,
               -0.144128904,
               0.150052398,
               0.146309152,
               -0.0182404276,
               -0.153412983,
               -0.0283157751,
               -0.122383185,
               -0.126481265,
               -0.0588110536,
               0.0337800756,
               0.120100617,
               0.00621138792,
               -0.13971962,
               0.00222469447,
               0.00210137526,
               -0.13268359,
               -0.0957976207,
               -0.00896210223,
               0.131367,
               -0.0920759365,
               0.0028843896,
               -0.119137898,
               0.0675471649,
               0.11393033,
               -0.138042256,
               -0.00914750341,
               -0.115568466,
               0.133425087,
               -0.0634409934,
               -0.131820664,
               0.114941448,
               -0.0592057854,
               -0.0570597462,
               0.0598753,
               -0.0137891136,
               0.0671845898,
               0.103628419,
               -0.0247093216,
               0.0997967795,
               0.0101953372,
               0.0389651842,
               0.00572437793,
               0.13214846,
               0.00938276481,
               0.0951921791,
               0.0961359143,
               -0.0653654709,
               -0.151532605,
               0.038828,
               -0.148703724,
               0.0581040792,
               -0.0787024945,
               0.109887488,
               0.131684497,
               0.00658042822,
               -0.0244683679,
               0.0908620059,
               -0.0376143456,
               -0.144701988,
               0.0104717268,
               0.131649733,
               0.0753725469,
               -0.107840456,
               0.115660027,
               0.00376651785,
               0.141536474,
               -0.0508606248,
               0.0285739582,
               -0.00105301384,
               -0.0715689212,
               -0.0783771574,
               0.0301219523,
               -0.110595971,
               0.0823340714,
               0.122006252,
               -0.0897547752,
               -0.0694813952,
               -0.0101009021,
               0.00148922962,
               0.00764718466,
               0.140295982,
               0.144439682,
               -0.113681667,
               -0.102377586,
               0.129830867,
               -0.154429704,
               0.0310753044,
               -0.0979968831,
               -0.112284139,
               0.0271425918,
               -0.0567372069,
               0.0594914369,
               -0.0127041042,
               0.0930285603,
               0.139771461,
               0.0673008636,
               0.136947125,
               0.0563524887,
               -0.00811479148,
               -0.00244504563,
               0.141214296,
               0.0158964619,
               0.0644119307,
               -0.0647484735,
               -0.148008659,
               0.0999951586,
               -0.149282798,
               0.08318948,
               -0.100684203,
               -0.0751995444,
               -0.0773667544,
               0.116248108,
               -0.0126620885,
               -0.0955532938,
               -0.0934773237,
               0.14952521,
               0.0546317473,
               -0.117027432,
               -0.069971174,
               -0.00334476447,
               0.0485747233,
               -0.094211854,
               -0.216840565,
               0.0786894858,
               0.147633985,
               0.0994501486,
               0.0566046461,
               -0.0899067819,
               0.121959791,
               0.00207298342,
               0.0845358744,
               0.0739807859,
               -0.147501782,
               -0.0529595539,
               -0.0253627524,
               -0.019689288,
               0.0260413233,
               0.0484416224,
               0.0991397128,
               0.122664943,
               -0.12969093,
               -0.0305726379,
               0.045153711,
               -0.00666378951,
               -0.133654729,
               0.101618655,
               -0.0888175741,
               -0.144365221,
               -0.0231700484,
               -0.142773554,
               -0.0839592,
               -0.0929306895,
               -0.131692097,
               0.0926107541,
               0.119929098,
               -0.152084932,
               0.153215706,
               0.0608264729,
               0.0446615107,
               -0.013832733,
               0.11421077,
               0.154524833,
               0.0436204523,
               -0.123686247,
               -0.0298035834,
               0.0304130036,
               -0.112756491,
               -0.0824836791,
               -0.00151669269,
               -0.044845365,
               -0.0271135587,
               0.0208408106,
               0.104427911,
               0.0131908,
               -0.0145425601,
               -0.00270142732,
               -0.0517579839,
               -0.122616857,
               0.136985824,
               -0.122155331,
               -0.0457971208,
               -0.0470676422,
               0.0852162242,
               0.10218697,
               0.0858585685,
               0.120057859,
               -0.0828904733,
               0.0616068579,
               -0.0202871803,
               -0.0994715,
               0.0597965084,
               0.108198196,
               0.0262986124,
               -0.0818129852,
               0.120384738,
               0.117303044,
               -0.14680782,
               0.0850068405,
               0.00156230608,
               0.13909249,
               -0.0608082451,
               0.00428886153,
               -0.101632535,
               -0.0247594044,
               -0.153437778,
               -0.0755737051,
               0.0984604061,
               -0.0473679677,
               0.00137865287,
               -0.0148094976,
               0.0282075908,
               -0.105809681,
               0.111355424,
               -0.124718055,
               0.0134897316,
               -0.0306713618,
               -0.120683,
               -0.0609038,
               0.0830228776,
               0.126447424,
               0.089824073,
               -0.14533639,
               0.0660585091,
               -0.101857051,
               0.152293071,
               -0.0564530566,
               -0.120549269,
               -0.128722772,
               -0.044006262,
               -0.103679746,
               0.0434854925,
               0.131846517,
               0.0124564804,
               -0.041554641,
               0.0665721521,
               -0.0631948858,
               -0.0319213904,
               0.0177717116,
               0.0552545376,
               0.0150867673,
               -0.0396305248,
               -0.104714677,
               -0.0225810949,
               0.0539939664,
               -0.0665325895,
               -0.132228911,
               0.0973996371,
               0.00292481552,
               -0.149731413,
               0.142772034,
               -0.0291159078,
               0.0986401886,
               -0.0142042544,
               -0.0187027194,
               0.0768373683,
               -0.0803159773,
               -0.149904966,
               0.0141804395,
               0.0822736472,
               0.0347434022,
               0.0870040208,
               0.0751616359,
               -0.0667483,
               0.0201214217,
               0.117153019,
               -0.056717772,
               -0.133698314,
               -0.10414017,
               -0.138358787,
               0.0427755937,
               0.0550478697,
               -0.0872089341,
               0.109184012,
               -0.0908388272,
               0.0366296656,
               -0.0755835772,
               -0.064707309,
               0.0810601,
               -0.0235702749,
               -0.0714842454,
               -0.00370290573,
               0.0350466222,
               -0.127089649,
               -0.0144680198,
               0.0258806031,
               0.116547741,
               0.0974488705,
               0.143880472,
               -0.117789544,
               0.0646829829,
               -0.00316345738,
               -0.14554204,
               0.02423268,
               0.0790434703,
               -0.0947115,
               0.125738323,
               0.100396797,
               -0.13931264,
               0.103946306,
               0.125695631,
               -0.112425067,
               0.0371979959,
               -0.143580988,
               0.0796185285,
               0.100822628,
               0.0856649205,
               0.150481388,
               0.0034103347,
               -0.0494093113,
               0.105072789,
               -0.0284431,
               0.0780557841,
               0.0339563675,
               0.0837739,
               -0.0410737954,
               0.118601315,
               0.132847697,
               0.119452953,
               0.00353661622,
               0.0964373797,
               0.00366881699,
               0.150128931,
               0.0419346616,
               -0.0994821936,
               0.0506966226,
               -0.00931286439,
               -0.10504996,
               0.0851807371,
               -0.0941706151,
               0.129627258,
               0.0298397485,
               0.0375387,
               0.14383854,
               -0.0272100717,
               -0.058211524,
               0.00689981086,
               0.132931009,
               0.0165303685,
               -0.0104074646,
               0.0881945565,
               -0.0753143951,
               -0.113299809,
               -0.118081667,
               -0.016517628,
               0.155393913,
               -0.122686908,
               0.117557675,
               0.145677611,
               -0.151843458,
               -0.138377786,
               0.0520061553,
               -0.100128226,
               0.0418352373,
               -0.113529138,
               0.0180434436,
               0.0449029766,
               -0.0543508157,
               -0.0401418023,
               0.042728655,
               -0.132879212,
               0.134396419,
               -0.0760942,
               -0.109158926,
               -0.0944012,
               -0.104229532,
