{
 "irVersion": "6",
 "opsetImport": [],
 "producerName": "tenncor",
 "producerVersion": "1.0.0",
 "domain": "com.tenncor.eteq",
 "modelVersion": "6",
 "docString": "",
 "graph": {
  "node": [
   {
    "input": [
     "_i0"
    ],
    "output": [
     "_r0"
    ],
    "name": "_r0",
    "opType": "_LSTM_LAYER",
    "domain": "",
    "attribute": [
     {
      "name": "layer",
      "refAttrName": "",
      "docString": "",
      "type": "GRAPH",
      "f": 0,
      "i": "0",
      "s": "",
      "g": {
       "node": [
        {
         "input": [
          "_i0"
         ],
         "output": [
          "1"
         ],
         "name": "1",
         "opType": "SLICE",
         "domain": "",
         "attribute": [
          {
           "name": "dimension_pairs",
           "refAttrName": "",
           "docString": "",
           "type": "INTS",
           "f": 0,
           "i": "0",
           "s": "",
           "floats": [],
           "ints": [
            "0",
            "65535",
            "0",
            "1",
            "0",
            "65535",
            "0",
            "65535",
            "0",
            "65535",
            "0",
            "65535",
            "0",
            "65535",
            "0",
            "65535"
           ],
           "strings": [],
           "tensors": [],
           "graphs": [],
           "sparseTensors": []
          }
         ],
         "docString": ""
        },
        {
         "input": [
          "1",
          "2"
         ],
         "output": [
          "3"
         ],
         "name": "3",
         "opType": "CONCAT",
         "domain": "",
         "attribute": [
          {
           "name": "rank",
           "refAttrName": "",
           "docString": "",
           "type": "INT",
           "f": 0,
           "i": "0",
           "s": "",
           "floats": [],
           "ints": [],
           "strings": [],
           "tensors": [],
           "graphs": [],
           "sparseTensors": []
          }
         ],
         "docString": ""
        },
        {
         "input": [
          "3"
         ],
         "output": [
          "8"
         ],
         "name": "8",
         "opType": "_DENSE_LAYER",
         "domain": "",
         "attribute": [
          {
           "name": "layer",
           "refAttrName": "",
           "docString": "",
           "type": "GRAPH",
           "f": 0,
           "i": "0",
           "s": "",
           "g": {
            "node": [
             {
              "input": [
               "3",
               "4"
              ],
              "output": [
               "5"
              ],
              "name": "5",
              "opType": "MATMUL",
              "domain": "",
              "attribute": [
               {
                "name": "rank_pairs",
                "refAttrName": "",
                "docString": "",
                "type": "INTS",
                "f": 0,
                "i": "0",
                "s": "",
                "floats": [],
                "ints": [
                 "0",
                 "1"
                ],
                "strings": [],
                "tensors": [],
                "graphs": [],
                "sparseTensors": []
               }
              ],
              "docString": ""
             },
             {
              "input": [
               "6"
              ],
              "output": [
               "7"
              ],
              "name": "7",
              "opType": "EXTEND",
              "domain": "",
              "attribute": [
               {
                "name": "tensor",
                "refAttrName": "",
                "docString": "",
                "type": "TENSOR",
                "f": 0,
                "i": "0",
                "s": "",
                "t": {
                 "dims": [],
                 "dataType": 0,
                 "floatData": [],
                 "int32Data": [],
                 "stringData": [],
                 "int64Data": [],
                 "name": "5",
                 "docString": "",
                 "rawData": "",
                 "externalData": [],
                 "dataLocation": "DEFAULT",
                 "doubleData": [],
                 "uint64Data": []
                },
                "floats": [],
                "ints": [],
                "strings": [],
                "tensors": [],
                "graphs": [],
                "sparseTensors": []
               }
              ],
              "docString": ""
             },
             {
              "input": [
               "5",
               "7"
              ],
              "output": [
               "8"
              ],
              "name": "8",
              "opType": "ADD",
              "domain": "",
              "attribute": [
               {
                "name": "commutative",
                "refAttrName": "",
                "docString": "",
                "type": "STRING",
                "f": 0,
                "i": "0",
                "s": "",
                "floats": [],
                "ints": [],
                "strings": [],
                "tensors": [],
                "graphs": [],
                "sparseTensors": []
               }
              ],
              "docString": ""
             }
            ],
            "name": "",
            "initializer": [
             {
              "dims": [
               "100",
               "150",
               "1",
               "1",
               "1",
               "1",
               "1",
               "1"
              ],
              "dataType": 1,
              "floatData": [
               -0.0328720771,
               -0.127741262,
               0.0321766473,
               0.12170589,
               0.144888535,
               -0.0968930796,
               0.00644625537,
               -0.0349485353,
               -0.0733441263,
               0.0748451278,
               -0.130729303,
               0.018517511,
               0.0219021328,
               0.0963747427,
               0.0276224185,
               0.00444045896,
               0.115624204,
               0.14883627,
               0.072893694,
               0.141729578,
               -0.0626341328,
               -0.0225220583,
               0.125453487,
               0.0516165942,
               0.122024909,
               0.14384295,
               -0.101740859,
               0.107565373,
               0.121310726,
               -0.0622982085,
               0.133570805,
               -0.0249884166,
               -0.0585513115,
               0.00723346183,
               -0.0316528305,
               0.086729981,
               0.0585480221,
               0.0161912534,
               0.0284828208,
               -0.12797226,
               0.0340055861,
               -0.0237370692,
               0.0305161458,
               0.103016719,
               -0.00162815861,
               0.0847405195,
               -0.134152263,
               -0.0954826102,
               -0.0861671194,
               0.0864238515,
               -0.130264223,
               -0.101584718,
               0.0370078199,
               0.0208530109,
               0.0731526837,
               -0.0559251383,
               -0.021409845,
               -0.0271960385,
               0.128848344,
               0.153906479,
               0.0242895633,
               -0.104160599,
               0.0649231,
               -0.0507903248,
               -0.0142476056,
               -0.135554284,
               -0.113017038,
               -0.102168612,
               -0.019573234,
               -0.143905476,
               -0.00018042259,
               -0.0105832247,
               0.027914213,
               0.0502787754,
               -0.126714364,
               -0.132060722,
               0.0992650613,
               -0.0347160511,
               -0.095967494,
               -0.103803389,
               0.142762,
               0.149435312,
               -0.12139567,
               0.111417696,
               0.0371009223,
               0.0556679182,
               0.0353219584,
               0.0290844794,
               -0.104002856,
               -0.0788747519,
               0.095124051,
               0.0280062947,
               0.12627691,
               -0.0689206272,
               -0.0938872918,
               -0.0695429817,
               -0.0344786346,
               -0.125085071,
               0.0469216295,
               0.0409954898,
               -0.287434638,
               -0.107958347,
               -0.127228692,
               0.140163958,
               0.0126092751,
               -0.142201155,
               0.0169265661,
               0.0703039244,
               -0.00424161227,
               -0.0112038907,
               -0.156604677,
               -0.0859980956,
               -0.0934389308,
               0.022326773,
               -0.120300353,
               0.0327345915,
               -0.103148475,
               0.0565411858,
               -0.0769820958,
               0.0493490919,
               -0.14199923,
               -0.100778557,
               -0.0409373567,
               0.0812222883,
               -0.0349993818,
               0.100572243,
               0.021157831,
               0.0761368275,
               0.0552662797,
               -0.055058863,
               0.099971354,
               0.0108662006,
               0.0873945728,
               -0.106999815,
               0.02581916,
               0.0881652683,
               0.140646726,
               0.129627928,
               0.0877714,
               0.0903603658,
               0.022467114,
               -0.153982535,
               -0.107665665,
               -0.00075078354,
               0.0816183463,
               -0.0634377301,
               0.0302573461,
               0.0184650421,
               0.107374072,
               0.000903624808,
               0.126428276,
               -0.0613782182,
               0.0909187943,
               0.148593083,
               -0.135367,
               0.145152882,
               -0.0882719085,
               -0.0165920611,
               0.0371872596,
               -0.059853591,
               0.129910171,
               -0.135454863,
               -0.0781670511,
               0.0939219519,
               -0.0206481125,
               0.145760328,
               0.036930725,
               -0.140171051,
               0.104752868,
               -0.0807512626,
               0.014045286,
               -0.123741023,
               0.143142715,
               0.00577567099,
               -0.0997892618,
               0.00902743824,
               0.100058876,
               -0.0532502,
               -0.0187844895,
               -0.0567458943,
               0.0646708384,
               0.145582125,
               -0.0933029,
               0.0697571784,
               -0.0418312959,
               0.1422171,
               -0.144233838,
               -0.139174253,
               0.12005163,
               0.0184302218,
               0.15255551,
               -0.136761338,
               -0.12999393,
               0.0976881385,
               -0.118305415,
               0.14970988,
               -0.0614683777,
               -0.0848750323,
               0.0988287479,
               -0.0296515282,
               0.336560935,
               0.0382784791,
               0.150932491,
               0.0804132894,
               -0.0970217139,
               0.1277055,
               0.0547423847,
               -0.148502856,
               0.00514813839,
               0.102084897,
               0.0672489181,
               0.125207484,
               0.0703999251,
               -0.0993725657,
               -0.05694291,
               0.0219261926,
               -0.102664933,
               -0.0603492372,
               0.0554079041,
               -0.037222866,
               -0.0766685903,
               -0.0105255758,
               -0.0321797542,
               -0.091858536,
               0.0106867049,
               -0.0736655816,
               0.0863564685,
               0.0295333862,
               0.0919077322,
               -0.0916231647,
               -0.0223434307,
               -0.10879565,
               -0.0499473326,
               0.0564204082,
               0.127756149,
               0.0890824944,
               -0.061712686,
               -0.103053771,
               -0.0783924833,
               -0.01204703,
               -0.0615036152,
               -0.0798516273,
               -0.0754475817,
               0.147533387,
               -0.0610085838,
               0.0624317341,
               0.125051573,
               0.107649527,
               -0.00748481648,
               -0.13410385,
               -0.124526501,
               -0.0996380448,
               0.065196082,
               -0.156938106,
               -0.0803037956,
               -0.0160853229,
               -0.00627281563,
               -0.0336494595,
               -0.145761445,
               -0.110585,
               -0.0616128147,
               -0.0774116144,
               0.0480536856,
               -0.0116103664,
               0.105729103,
               0.0551601276,
               0.139948472,
               -0.0929007605,
               -0.101860508,
               -0.0994097367,
               0.139467433,
               -0.0338978283,
               0.0775847137,
               -0.116862901,
               0.0914227515,
               0.0697221,
               -0.0942427367,
               -0.0091370428,
               0.140685648,
               -0.0433379374,
               0.0270885434,
               -0.159031257,
               0.141032875,
               0.142150417,
               0.048017215,
               -0.0763650239,
               -0.0293566287,
               0.050523296,
               0.0790393651,
               0.131888747,
               -0.0204968471,
               0.028594818,
               0.13575612,
               0.127862245,
               -0.119289294,
               -0.0498188585,
               -0.0475603491,
               -0.0606072284,
               -0.00623358833,
               0.053820692,
               -0.183418557,
               -0.0150843291,
               0.0161354076,
               -0.0299721621,
               -0.0304441452,
               0.0362965353,
               -0.0901566073,
               0.0736287907,
               -0.147385925,
               -0.141508847,
               -0.0388542935,
               0.0536617525,
               0.139264762,
               -0.149488315,
               -0.0216001105,
               0.0113034751,
               -0.0657939166,
               0.13421692,
               0.0287132673,
               -0.039145004,
               0.0263455622,
               -0.00196628366,
               -0.0531770103,
               0.0568768904,
               -0.103862166,
               0.0885190368,
               0.0160755068,
               0.119434066,
               0.123567283,
               0.0710859448,
               0.0749421343,
               -0.0545877591,
               0.100077838,
               -0.108558401,
               0.0740250349,
               -0.0833367705,
               -0.138882488,
               -0.0875716284,
               0.0733940229,
               -0.0894788057,
               0.0183792319,
               0.0226797666,
               -0.103062332,
               0.0761181116,
               -0.0996173248,
               0.0892542079,
               -0.0234310497,
               -0.113603868,
               -0.0941203684,
               -0.0372460373,
               0.135605142,
               -0.0408777073,
               0.035265848,
               -0.0650763288,
               0.0271525923,
               0.0456279814,
               -0.12719664,
               0.0996079,
               -0.00745369354,
               0.0880002,
               0.136751682,
               0.00606050808,
               -0.0321284495,
               -0.089574106,
               -0.0413099676,
               0.0394017,
               -0.121034831,
               0.0426657163,
               0.0185369123,
               0.0738446265,
               0.0529330298,
               0.0567404591,
               -0.033906091,
               -0.0313034132,
               0.0705305,
               -0.151167884,
               -0.147983328,
               -0.073805742,
               -0.117464751,
               0.113232307,
               -0.042964451,
               0.0438128859,
               -0.0855322629,
               0.0351400822,
               -0.0405321047,
               0.0400687046,
               -0.0585987121,
               0.0295382738,
               0.14730528,
               0.143730298,
               -0.0998021662,
               0.0353289358,
               -0.141916677,
               -0.00871819258,
               -0.0484769,
               0.0383323096,
               -0.127707675,
               -0.105552986,
               -0.10829287,
               -0.109870031,
               -0.0319499038,
               0.113163762,
               0.129925802,
               -0.124667697,
               0.0682580769,
               -0.0144465836,
               -0.0210463572,
               -0.0554350801,
               -0.101698413,
               0.00402237382,
               0.0401874371,
               -0.113650724,
               -0.0238871779,
               -0.133277118,
               0.0865389407,
               -0.145557553,
               0.025732981,
               0.147359729,
               0.11475832,
               0.141214326,
               -0.0432408,
               -0.154078573,
               -0.0545535423,
               -0.0355190933,
               0.138241351,
               -0.0292375218,
               -0.0265446585,
               -0.0940282717,
               -0.144517362,
               -0.044021707,
               0.10102313,
               0.0731307715,
               -0.0687969849,
               0.0399934314,
               0.106479585,
               -0.0457835123,
               0.00671874965,
               -0.117581151,
               -0.108618729,
               0.0491887368,
               -0.109448783,
               0.108170718,
               -0.0723713934,
               -0.103384651,
               -0.136543408,
               -0.0993779153,
               0.114094645,
               0.0413572,
               -0.0136239184,
               -0.00632957,
               0.0569343418,
               -0.0226844233,
               -0.120459832,
               0.0777390674,
               -0.0775033906,
               -0.145289257,
               0.062131688,
               -0.129902601,
               -0.0289377384,
               0.0339769423,
               0.0646252856,
               0.0476963781,
               0.154933214,
               0.109963916,
               -0.0709462762,
               -0.0714160353,
               -0.120266475,
               0.0461981818,
               -0.0959124193,
               -0.132876739,
               -0.0991788581,
               -0.111307405,
               -0.0763129666,
               -0.118319206,
               -0.115680836,
               0.139461428,
               0.0711629,
               0.134939581,
               -0.114646144,
               0.129614949,
               -0.013466116,
               -0.120814912,
               0.0946879461,
               0.0700374544,
               0.0259518418,
               0.0748707354,
               0.0791196823,
               -0.000169639752,
               -0.0829087049,
               0.0563080907,
               -0.0751026049,
               0.0709629431,
               -0.0511418507,
               0.12687172,
               0.131831691,
               0.119518287,
               -0.151725322,
               0.0945889279,
               0.111037731,
               0.11351233,
               -0.188585639,
               -0.0246029943,
               0.128545359,
               -0.00658566831,
               0.135766,
               0.0837837085,
               0.109086603,
               -0.0896491334,
               0.12420851,
               -0.151108742,
               -0.0596644171,
               0.122805879,
               0.0836456418,
               0.0287004262,
               0.0319612473,
               -0.128116712,
               0.0580793023,
               -0.106229119,
               -0.0133196274,
               -0.0661589578,
               -0.0705950111,
               0.151371047,
               0.0588140562,
               0.134061113,
               -0.00693211472,
               0.105000377,
               0.0378246903,
               0.100704782,
               0.0306526329,
               -0.0973293632,
               0.0680583715,
               0.0491664559,
               -0.0584797561,
               -0.0846203938,
               0.0663981,
               -0.0361410603,
               0.0756441057,
               0.0636898279,
               -0.0710732564,
               -0.138705954,
               -0.0445961878,
               0.110314086,
               -0.0432082973,
               0.0517645814,
               -0.0289817,
               0.0523488671,
               -0.148535207,
               -0.151719078,
               0.0148788365,
               -0.140921533,
               -0.0581989475,
               0.0488144979,
               -0.0200031046,
               0.134281009,
               -0.0819161087,
               -0.0591568649,
               0.0350533724,
               0.139291212,
               0.0888481736,
               -0.120795056,
               -0.147378311,
               0.134683192,
               -0.0334853046,
               -0.0384231,
               0.0403722785,
               -0.111501984,
               0.0843228474,
               -0.0801624507,
               0.0534673855,
               -0.0330376662,
               -0.145431742,
               -0.106558949,
               -0.00631004153,
               -0.0380125307,
               -0.104744,
               0.149128273,
               0.0658796504,
               0.100619793,
               0.104656734,
               -0.0558451153,
               -0.134459838,
               -0.0989564732,
               -0.0504096,
               -0.0117415022,
               0.0284648016,
               0.107454792,
               -0.06442976,
               -0.0474475101,
               -0.116632022,
               0.0489947535,
               -0.0376343,
               -0.0207939725,
               -0.0781809,
               -0.0321978591,
               0.14340204,
               0.0822066441,
               -0.0434721336,
               0.0911515057,
               0.0383165665,
               0.136858582,
               -0.14350763,
               0.00611601677,
               0.0525566041,
               0.144301921,
               -0.098575376,
               -0.0956907272,
               0.128486529,
               -0.0562221296,
               -0.046815522,
               0.0122471778,
               0.0769853741,
               0.12386699,
               -0.0642300248,
               -0.0918214396,
               0.0228242949,
               -0.00563263847,
               0.0623256676,
               0.0892186239,
               -0.0322999358,
               0.0971291214,
               -0.14718467,
               -0.0649614632,
               0.11183507,
               0.142774224,
               -0.0700186267,
               -0.111105286,
               -0.0628914088,
               0.063933894,
               -0.0652961656,
               0.0843657628,
               0.146762148,
               -0.0851935446,
               -0.10281875,
               -0.102241769,
               -0.0386618376,
               -0.123389453,
               -0.0856976584,
               0.122976743,
               -0.148013383,
               0.0447534472,
               -0.0306161046,
               0.127384678,
               0.0903202519,
               0.12920934,
               -0.0526619144,
               -0.00398365688,
               0.0210759249,
               0.0213860609,
               -0.0123721864,
               -0.110012494,
               -0.0542400777,
               0.071160078,
               -0.0556160212,
               0.117884226,
               -0.0558138974,
               -0.0341873653,
               0.10781043,
               -0.142633304,
               0.0182954725,
               -0.075201489,
               0.126348525,
               0.102431163,
               0.0543173961,
               0.0825294107,
               0.148495272,
               -0.0134242726,
               -0.0443839468,
               0.129820362,
               0.133162931,
               -0.0302391872,
               0.124297664,
               0.120827861,
               -0.00679813698,
               0.0296171866,
               -0.140690759,
               -0.0600543283,
               -0.142598525,
               -0.0277088284,
               -0.140248,
               0.0656782612,
               0.0596946515,
               0.0305915717,
               0.115682378,
               -0.00931452587,
               -0.152328,
               -0.0586522408,
               0.0866688266,
               -0.103015013,
               0.126674727,
               -0.0159055572,
               0.15252687,
               -0.0692717433,
               0.119361252,
               0.114847526,
               -0.083974,
               -0.0171394795,
               0.0415051766,
               0.0707241818,
               -0.108398728,
               0.101338528,
               -0.125123441,
               -0.146845102,
               -0.111990586,
               -0.0914519727,
               -0.0981940404,
               0.0224460755,
               0.118570127,
               -0.106803544,
               0.0262815785,
               -0.0304436814,
               -0.0230473951,
               -0.082409434,
               -0.0825300068,
               -0.00476969313,
               -0.0573461242,
               0.0428963266,
               0.130058467,
               0.0640132651,
               -0.132887334,
               0.00930314884,
               -0.144116491,
               -0.126206577,
               -0.121111706,
               0.0441947542,
               0.0356740616,
               0.0478014424,
               0.0626243204,
               -0.132160872,
               0.0238206647,
               -0.106505893,
               0.0206018109,
               0.0369117595,
               -0.0637899637,
               0.0129794925,
               -0.140172288,
               -0.0849934,
               -0.0221920777,
               -0.0196496118,
               -0.0716752782,
               -0.0646444112,
               0.0599819347,
               0.132195935,
               0.0346376225,
               0.0363664702,
               -0.129714042,
               0.00786413532,
               -0.11834538,
               0.062529251,
               0.113875173,
               -0.00209551491,
               0.100729696,
               0.127677232,
               -0.106763035,
               0.071729064,
               -0.00683092745,
               0.144528747,
               -0.109949209,
               0.101718016,
               0.121659011,
               -0.117763594,
               0.0961233526,
               0.0176243838,
               0.026299281,
               0.0494973473,
               0.0388788506,
               0.121166974,
               -0.085664168,
               0.0814892128,
               0.028331019,
               0.148622319,
               0.0876109377,
               -0.000395808223,
               -0.10871911,
               -0.022553673,
               0.0977619961,
               0.119490474,
               0.0616875887,
               -0.14390184,
               -0.0072073848,
               -0.136764854,
               -0.0090246005,
               0.0160893779,
               0.106636383,
               -0.0969344527,
               0.00225489167,
               0.0157960933,
               -0.0699603,
               0.0491870083,
               0.0616454594,
               -0.0978715494,
               0.088817142,
               -0.0623081587,
               0.146138683,
               0.00679738866,
               -0.138934314,
               0.0685452893,
               0.0032268872,
               -0.0372410119,
               -0.000602432061,
               0.0356738493,
               -0.00108828326,
               -0.0665966794,
               -0.123035938,
               0.0781103596,
               0.0151285753,
               0.00322007271,
               -0.0870438516,
               0.0209684055,
               -0.045011919,
               0.145235956,
               0.0961569399,
               0.143560126,
               0.118475065,
               0.0700350627,
               -0.0786683783,
               -0.145911247,
               -0.100462236,
               0.0776451305,
               -0.0476082973,
               0.0644278154,
               -0.0490062,
               -0.00569774443,
               -0.142295867,
               -0.0694056749,
               -0.0506761558,
               -0.0741007775,
               0.113047659,
               0.0392780229,
               -0.0555111319,
               0.136846945,
               0.0197818931,
               0.0131773781,
               -0.0478130803,
               0.0462197103,
               0.106418692,
               -0.0375975668,
               0.0567673109,
               -0.0879300758,
               -0.0554234274,
               0.138545305,
               0.0154201742,
               0.126082465,
               -0.135050863,
               -0.0510523394,
               0.0161638726,
               -0.0698658079,
               0.0556230173,
               -0.142955408,
               0.152443901,
               0.0456493795,
               0.0706119612,
               0.056087967,
               -0.0130343828,
               0.143055886,
               0.0374674574,
               0.0581285171,
               -0.024957791,
               0.112548076,
               -0.0165117849,
               0.108775161,
               0.090722993,
               0.0868747756,
               0.158605918,
               -0.136639938,
               0.0722477,
               -0.12759155,
               0.0764136,
               -0.0291985031,
               0.0928272083,
               0.0149176531,
               -0.135663986,
               0.106998511,
               0.087930955,
               -0.147102803,
               0.114492327,
               0.147470146,
               -0.158607125,
               0.0887808576,
               0.0265060328,
               0.0111402385,
               0.0313943513,
               -0.0609052368,
               0.0382934399,
               -0.0418082029,
               0.0544727854,
               0.119392402,
               -0.140733734,
               0.14548786,
               -0.0958633572,
               0.0674247295,
               -0.0249760095,
               -0.155380279,
               0.0716238394,
               -0.0122601138,
               -0.150573239,
               0.137251794,
               0.0580228306,
               -0.0298614819,
               0.0771124437,
               -0.0484827,
               0.00130255672,
               -0.0789206699,
               -0.132102638,
               0.080516234,
               0.0803329349,
               0.067000933,
               -0.0837142,
               0.00270504295,
               -0.137842029,
               0.145285919,
               0.001862259,
               0.112396926,
               -0.134519562,
               -0.0798380896,
               0.0463378504,
               0.0790394247,
               -0.153860122,
               -0.149220213,
               -0.10748294,
               0.140763953,
               -0.152669951,
               0.0463953502,
               -0.00859895255,
               0.0302714929,
               -0.106790431,
               -0.0673466325,
               0.0874691829,
               -0.0211943742,
               0.0948403478,
               0.113660894,
               0.142469838,
               0.0842489153,
               0.0739644244,
               -0.0692648292,
               0.101240493,
               -0.138718739,
               -0.0462500453,
               -0.0858985409,
               -0.149836436,
               0.0625752956,
               0.000130659202,
               -0.0659684762,
               -0.0937005356,
               -0.0167566556,
               0.0223172102,
               -0.114878975,
               -0.0534399487,
               0.107965857,
               -0.0633634329,
               -0.0771796182,
               -0.0641180426,
               -0.06700477,
               0.0446801223,
               -0.111342683,
               0.0918187,
               -0.150026903,
               0.0892707333,
               0.0706282929,
               0.0144786136,
               -0.0373303629,
               -0.0891933069,
               -0.123134248,
               0.0231774244,
               0.0306268837,
               -0.0155233899,
               0.00938494131,
               0.0147664882,
               0.0519511141,
               0.068116,
               -0.0110051483,
               0.0876621455,
               -0.0458790101,
               -0.0653082505,
               0.0388834886,
               0.0164066777,
               0.087218,
               0.148553267,
               -0.0704644918,
               -0.135175645,
               0.115974329,
               -0.149916872,
               0.085669823,
               -0.00309889973,
               0.00882386789,
               0.133181542,
               0.141168222,
               -0.131417274,
               -0.0067244065,
               0.156069189,
               0.0355214812,
               0.141556352,
               0.117987439,
               0.0441123284,
               -0.00554869,
               -0.141615838,
               -0.13536711,
               0.065423,
               -0.0984110087,
               0.0826189518,
               -0.0921627656,
               -0.291596949,
               0.144467264,
               0.0562557057,
               0.0777305588,
               -0.129829884,
               0.0949359536,
               0.0320241,
               -0.0714975446,
               0.0732093081,
               0.0776816756,
               -0.149290189,
               0.054743968,
               0.0838503093,
               -0.123023145,
               -0.140389279,
               -0.0430001877,
               0.0105431816,
               -0.135289669,
               -0.0659192055,
               0.144723833,
               0.0387084857,
               0.00124999718,
               -0.129677862,
               0.0626543686,
               0.0152813643,
               -0.0815928802,
               0.0744931772,
               -0.0252276342,
               0.0917740539,
               -0.0993432105,
               0.0626125,
               0.0616898872,
               -0.134024,
               -0.0993348658,
               -0.098721914,
               -0.130395845,
               -0.00658533489,
               0.115532547,
               0.101209462,
               -0.102103621,
               0.0551711842,
               -0.111692645,
               0.0710775554,
               0.0264687911,
               0.120493196,
               0.0984659865,
               -0.0189365465,
               -0.0463025,
               -0.104619049,
               0.0389730632,
               -0.0836780518,
               0.0976565331,
               -0.109533384,
               -0.00214499608,
               -0.103017114,
               -0.101950631,
               -0.0780427828,
               -0.129572108,
               0.0168611687,
               -0.101731822,
               -0.113052838,
               -0.105483651,
               -0.118393227,
               0.105991572,
               -0.089210853,
               -0.0755868182,
               -0.0791077,
               -0.0181480628,
               0.0439243913,
               0.06073457,
               -0.0267891865,
               0.0964161158,
               -0.135183722,
               -0.114802495,
               0.149950147,
               -0.0762315914,
               0.0224741194,
               -0.129641712,
               0.0932577103,
               0.138712242,
               0.150611013,
               -0.0984469056,
               -0.0188131854,
               -0.00914833695,
               -0.128163889,
               -0.0665734485,
               -0.0662393123,
               0.0504481457,
               -0.0489749238,
               0.117759064,
               0.144770443,
               -0.0484755635,
               0.141315937,
               -0.0451024361,
               0.116109699,
               -0.152321547,
               0.0890479088,
               -0.0804211646,
               0.011983756,
               0.125384256,
               -0.156609014,
               -0.0887878314,
               0.0725632757,
               -0.132273138,
               0.0355371311,
               -0.152249947,
               0.112623446,
               0.0975217149,
               0.134061545,
               0.0648040548,
               -0.0322728157,
               0.0388986506,
               0.0845380798,
               0.0296315569,
               0.0107323006,
               -0.00683346437,
               -0.138842583,
               0.0059467135,
               0.13807328,
               -0.0380966403,
               0.0289300885,
               -0.131285608,
               -0.106774092,
               -0.0564878844,
               -0.103753112,
               0.132303223,
               0.00287825055,
               -0.0598786399,
               0.112543769,
               0.0760162175,
               -0.096134223,
               0.0417764969,
               -0.0812486261,
               -0.149346441,
               0.135423928,
               -0.100532,
               -0.106994674,
               -0.0792853609,
               0.0437220447,
               0.117508262,
               -0.0965175703,
               -0.0344642736,
               -0.140483961,
               0.100261569,
               -0.142767787,
               0.149592459,
               -0.096890606,
               -0.152870387,
               0.0565500259,
               -0.0505622588,
               0.0740466118,
               -0.0381923765,
               -0.0500531793,
               0.0429928489,
               -0.1039083,
               -0.119062714,
               0.0544862263,
               -0.0952282473,
               0.154357523,
               -0.0525087491,
               -0.0388817303,
               0.0800576136,
               0.063375704,
               0.081378147,
               -0.0580674149,
               0.0379415527,
               0.0154808117,
               0.153682783,
               0.116270542,
               0.102126576,
               0.114867948,
               -0.0203834493,
               0.0124940732,
               -0.144920185,
               -0.131003484,
               0.0228912402,
               0.152589917,
               -0.136203974,
               -0.14412643,
               0.149945423,
               0.146477893,
               -0.0187691208,
               -0.153544918,
               -0.0291065183,
               -0.122441508,
               -0.126085401,
               -0.0587169454,
               0.0341850594,
               0.120745212,
               0.00543113193,
               -0.139366761,
               0.00206836313,
               0.0023407808,
               -0.132257596,
               -0.0958493501,
               -0.00870703626,
               0.130981937,
               -0.0920304209,
               0.00311577809,
               -0.118990816,
               0.0695299506,
               0.11399848,
               -0.137828633,
               -0.00893679634,
               -0.115508884,
               0.133291483,
               -0.0629877225,
               -0.132597476,
               0.114994697,
               -0.0594527759,
               -0.0586455464,
               0.0598092712,
               -0.0148085188,
               0.0671333671,
               0.103315517,
               -0.0245458912,
               0.0997142568,
               0.00872835424,
               0.039820075,
               0.00487840269,
               0.132212758,
               0.00953850709,
               0.0956473798,
               0.097204417,
               -0.0662863,
               -0.151556849,
               0.0393884517,
               -0.149805859,
               0.0565248057,
               -0.0782853588,
               0.10929855,
               0.131977201,
               0.00686429162,
               -0.0237481855,
               0.0908478722,
               -0.0383777469,
               -0.144492924,
               0.0114147384,
               0.131613657,
               0.0749301314,
               -0.107821852,
               0.114922285,
               0.00371909351,
               0.140041187,
               -0.0507242195,
               0.0284697749,
               -0.00137786032,
               -0.0716690943,
               -0.0783834681,
               0.0300490186,
               -0.111106783,
               0.0815162584,
               0.121970683,
               -0.0905298889,
               -0.0697516426,
               -0.00963663496,
               0.000810011872,
               0.00736118061,
               0.140920475,
               0.14493762,
               -0.113426201,
               -0.102104083,
               0.1311405,
               -0.154219583,
               0.0307172444,
               -0.0994995609,
               -0.111819454,
               0.0267132744,
               -0.0570035912,
               0.0594054721,
               -0.0133199394,
               0.0928952694,
               0.140667766,
               0.0656075627,
               0.136769697,
               0.0571621768,
               -0.00930902082,
               -0.00258791586,
               0.141240075,
               0.015720157,
               0.0647249296,
               -0.0655658841,
               -0.148241356,
               0.0988131687,
               -0.1492621,
               0.0838776,
               -0.100479536,
               -0.0746992603,
               -0.0763066411,
               0.114900239,
               -0.0117827803,
               -0.0958075747,
               -0.0928212628,
               0.150121823,
               0.0545378961,
               -0.11658559,
               -0.0705745369,
               -0.00330769154,
               0.0489754714,
               -0.0941803232,
               -0.238790661,
               0.0784358159,
               0.147582561,
               0.0993526056,
               0.0567431897,
               -0.0898095369,
               0.121811047,
               0.00189322303,
               0.0847976953,
               0.0737053156,
               -0.148378059,
               -0.0530551262,
               -0.0255991165,
               -0.0199665166,
               0.0257220417,
               0.0483305417,
               0.0992771238,
               0.121989109,
               -0.129367933,
               -0.0303435512,
               0.0451729447,
               -0.00657433691,
               -0.133574128,
               0.1018731,
               -0.089187488,
               -0.144707859,
               -0.0230633467,
               -0.143154949,
               -0.0846739784,
               -0.0929114074,
               -0.132132515,
               0.0924261287,
               0.120001972,
               -0.151796594,
               0.152736992,
               0.0606073625,
               0.0451694541,
               -0.0134414639,
               0.114272699,
               0.154716849,
               0.0436906703,
               -0.123867221,
               -0.0296960566,
               0.029648412,
               -0.112911776,
               -0.082905978,
               -0.00156553066,
               -0.0449048132,
               -0.0268540792,
               0.0208801087,
               0.104278564,
               0.0127991363,
               -0.0147464313,
               -0.00252470188,
               -0.0515814945,
               -0.122567818,
               0.136769548,
               -0.122725166,
               -0.0459504686,
               -0.047008168,
               0.085490495,
               0.10274794,
               0.0865734816,
               0.120292462,
               -0.0832303837,
               0.0608420447,
               -0.0201598313,
               -0.0995641947,
               0.0598149262,
               0.108355992,
               0.0258960929,
               -0.0819150805,
               0.120864727,
               0.116205327,
               -0.146632433,
               0.085601218,
               0.00102825952,
               0.139005437,
               -0.060819,
               0.00427136943,
               -0.101541422,
               -0.0249461606,
               -0.153456092,
               -0.0765744075,
               0.0990846679,
               -0.047213167,
               0.00154880714,
               -0.0149963461,
               0.0283709504,
               -0.106775828,
               0.111574076,
               -0.124826036,
               0.013604857,
               -0.0306738243,
               -0.120719753,
               -0.0607771836,
               0.0829652771,
               0.126479566,
               0.0898914188,
               -0.145337507,
               0.0626958534,
               -0.101573378,
               0.152521044,
               -0.0563870147,
               -0.120554067,
               -0.128896967,
               -0.0435999371,
               -0.104227178,
               0.0433841236,
               0.131712645,
               0.0116943689,
               -0.0416335873,
               0.0657784343,
               -0.063095212,
               -0.0319864862,
               0.0180242471,
               0.055113256,
               0.0144282607,
               -0.0391260646,
               -0.105596162,
               -0.0225259624,
               0.0541046038,
               -0.0660646707,
               -0.131456465,
               0.0968374908,
               0.00310886861,
               -0.149298832,
               0.142040953,
               -0.0299712624,
               0.0989769548,
               -0.0145166516,
               -0.0182981975,
               0.0770789459,
               -0.0798975825,
               -0.149509847,
               0.0136836991,
               0.082131952,
               0.0353375673,
               0.0869446471,
               0.074609369,
               -0.0667868853,
               0.0196001809,
               0.117052183,
               -0.0575004108,
               -0.133522958,
               -0.104023322,
               -0.138522282,
               0.0427206345,
               0.0549075343,
               -0.0872813389,
               0.108788945,
               -0.091272518,
               0.0367488042,
               -0.0766831562,
               -0.0650612,
               0.0814081505,
               -0.0240208302,
               -0.0714113,
               -0.00312199816,
               0.035457775,
               -0.127030611,
               -0.01474992,
               0.0264772344,
               0.116599306,
               0.0973435268,
               0.143049702,
               -0.117521867,
               0.0643713623,
               -0.00340803456,
               -0.145732149,
               0.023971647,
               0.0791195109,
               -0.0943691954,
               0.125179082,
               0.100103751,
               -0.138981342,
               0.103183471,
               0.125637263,
               -0.112408713,
               0.0370582938,
               -0.143391833,
               0.0790071189,
               0.100644082,
               0.0852229297,
               0.150031641,
               0.00387920043,
               -0.0493719019,
               0.105717845,
               -0.0276391748,
               0.0775565431,
               0.034395352,
               0.0836233795,
               -0.0407385342,
               0.119174786,
               0.13279587,
               0.119737595,
               0.00303893443,
               0.0964707211,
               0.00395734189,
               0.150279641,
               0.0368586108,
               -0.0993494913,
               0.0508558154,
               -0.00915473234,
               -0.105053268,
               0.0850607157,
               -0.0938276276,
               0.129171774,
               0.0297910143,
               0.0374576896,
               0.143077299,
               -0.0272288434,
               -0.0588148125,
               0.00695384713,
               0.132828027,
               0.0166779906,
               -0.0105057145,
               0.0874562263,
               -0.0748553053,
               -0.113935664,
               -0.118044473,
               -0.0164411087,
               0.155678809,
               -0.12206091,
               0.117067859,
               0.145772278,
               -0.151505575,
               -0.138985425,
