{
 "irVersion": "6",
 "opsetImport": [],
 "producerName": "tenncor",
 "producerVersion": "1.0.0",
 "domain": "com.tenncor.eteq",
 "modelVersion": "6",
 "docString": "",
 "graph": {
  "node": [
   {
    "input": [
     "_i0"
    ],
    "output": [
     "_r0"
    ],
    "name": "_r0",
    "opType": "_DENSE_LAYER",
    "domain": "",
    "attribute": [
     {
      "name": "layer",
      "refAttrName": "",
      "docString": "",
      "type": "GRAPH",
      "f": 0,
      "i": "0",
      "s": "",
      "g": {
       "node": [
        {
         "input": [
          "_i0",
          "1"
         ],
         "output": [
          "2"
         ],
         "name": "2",
         "opType": "MATMUL",
         "domain": "",
         "attribute": [
          {
           "name": "rank_pairs",
           "refAttrName": "",
           "docString": "",
           "type": "INTS",
           "f": 0,
           "i": "0",
           "s": "",
           "floats": [],
           "ints": [
            "0",
            "1"
           ],
           "strings": [],
           "tensors": [],
           "graphs": [],
           "sparseTensors": []
          }
         ],
         "docString": ""
        },
        {
         "input": [
          "3"
         ],
         "output": [
          "4"
         ],
         "name": "4",
         "opType": "EXTEND",
         "domain": "",
         "attribute": [
          {
           "name": "tensor",
           "refAttrName": "",
           "docString": "",
           "type": "TENSOR",
           "f": 0,
           "i": "0",
           "s": "",
           "t": {
            "dims": [],
            "dataType": 0,
            "floatData": [],
            "int32Data": [],
            "stringData": [],
            "int64Data": [],
            "name": "2",
            "docString": "",
            "rawData": "",
            "externalData": [],
            "dataLocation": "DEFAULT",
            "doubleData": [],
            "uint64Data": []
           },
           "floats": [],
           "ints": [],
           "strings": [],
           "tensors": [],
           "graphs": [],
           "sparseTensors": []
          }
         ],
         "docString": ""
        },
        {
         "input": [
          "2",
          "4"
         ],
         "output": [
          "_r0"
         ],
         "name": "_r0",
         "opType": "ADD",
         "domain": "",
         "attribute": [
          {
           "name": "commutative",
           "refAttrName": "",
           "docString": "",
           "type": "STRING",
           "f": 0,
           "i": "0",
           "s": "",
           "floats": [],
           "ints": [],
           "strings": [],
           "tensors": [],
           "graphs": [],
           "sparseTensors": []
          }
         ],
         "docString": ""
        }
       ],
       "name": "",
       "initializer": [
        {
         "dims": [
          "64",
          "784",
          "1",
          "1",
          "1",
          "1",
          "1",
          "1"
         ],
         "dataType": 1,
         "floatData": [
          -0.00346235931,
          -0.0233066566,
          0.00881679542,
          0.0198023021,
          0.0105072474,
          -0.00859145168,
          -0.00741272187,
          -0.00879923441,
          -0.00641901419,
          -0.00151232106,
          -0.0061203856,
          -0.0117727472,
          0.00613315543,
          0.0101533514,
          0.0036390645,
          0.00260896096,
          0.010400583,
          -0.000846845214,
          0.00122815196,
          0.0244036429,
          -0.0170689113,
          -0.00259704655,
          0.00805191,
          -0.00753315631,
          0.00766297337,
          0.0164892953,
          -0.00537007861,
          0.0167013258,
          0.0338099711,
          0.0031532126,
          0.0221763924,
          0.000246541575,
          -0.0181785803,
          -0.00527180312,
          0.0130843669,
          0.0123777669,
          0.00224692933,
          -0.0104894871,
          0.00130456418,
          -0.02159293,
          -0.00179958181,
          -0.00740928622,
          0.00501010334,
          0.0121962801,
          -0.012779518,
          -0.00491994107,
          -0.0168599095,
          -0.0126620317,
          -0.00938156061,
          -0.00026858761,
          -0.0123332161,
          -0.00186556322,
          -0.00903087,
          -0.00273584179,
          0.000684016617,
          -0.0137151657,
          0.0114887487,
          -0.00151105376,
          0.0105165569,
          0.00833534822,
          -0.00120993087,
          0.00707551232,
          0.00966072269,
          -0.014082348,
          0.00397996511,
          -0.00370683824,
          -0.0145169524,
          0.000630593859,
          0.00771625852,
          0.0037087563,
          0.0124381548,
          -0.00209851982,
          0.00488264393,
          0.0130141042,
          -0.0115709612,
          -0.0225993134,
          0.0139410673,
          -0.00730121369,
          -0.0100965546,
          -0.00777272927,
          0.00709960703,
          0.00732135493,
          -0.0110532651,
          0.0103985956,
          -0.00557593,
          -0.000474653905,
          0.00246142829,
          0.0135292951,
          -0.0218448527,
          0.00226629013,
          -0.0027695233,
          0.00503008533,
          0.0134486556,
          -0.00256634061,
          -0.00118282961,
          -0.00167078781,
          0.00229060906,
          0.00239132415,
          0.0151568092,
          0.00108877756,
          -0.00467350287,
          -0.00216928497,
          -0.00597717147,
          -0.00216265535,
          0.0152190365,
          -0.0191421844,
          -0.000726547791,
          0.0116729932,
          -0.00111381314,
          -0.00204545213,
          -0.0141624073,
          -0.0120066823,
          -0.00626845704,
          0.00693477923,
          -0.00331612257,
          -0.000511681079,
          -0.00635293499,
          0.00622923952,
          0.00947912131,
          -0.00361462566,
          0.00627253624,
          -0.00900148414,
          -0.00679645268,
          0.00656000199,
          -0.00378914876,
          0.00857341103,
          0.00424497155,
          0.00809292402,
          0.00985825621,
          0.00108974788,
          -0.000343909691,
          0.000538365275,
          0.0118069788,
          -0.00940072257,
          0.00788027048,
          0.00608763751,
          0.0155638168,
          0.0128364181,
          0.0126294401,
          0.0134450532,
          -0.00370663917,
          -0.0209649727,
          0.0079560075,
          -0.00549763,
          0.0160285383,
          -0.00487713842,
          -0.00161954761,
          -1.80842308e-05,
          0.0166748259,
          0.00623628823,
          0.0108810039,
          -0.0020137527,
          0.0175167434,
          0.026733825,
          -0.00890958,
          0.00638728961,
          -0.0010847596,
          0.0105480123,
          -0.00482648285,
          -0.00894546602,
          0.00465304917,
          -0.01162301,
          -0.0155876772,
          0.0107682226,
          0.00658222614,
          0.00877666473,
          -0.00632203138,
          -0.0221180618,
          -0.00391634367,
          -0.00867807213,
          0.00989420433,
          -0.0224368423,
          0.00223166845,
          0.00277878414,
          -0.0112894867,
          -0.00571494317,
          -0.00457279431,
          -0.00829981919,
          -0.0112590054,
          -0.00578118,
          -0.00112435769,
          0.00928498432,
          -0.0157403275,
          -0.00956990663,
          0.00124957121,
          -0.00505546527,
          -0.00520320889,
          -0.0233229548,
          0.00563903712,
          0.0102231577,
          -0.00247130287,
          -0.00944106,
          0.00269820029,
          0.00473155593,
          -0.0137644922,
          0.00141502451,
          0.00514997309,
          -0.00382378604,
          0.011312441,
          0.00646924134,
          0.0176368263,
          -0.00371691445,
          0.0152579593,
          0.0042447662,
          -0.000615141587,
          0.0066062361,
          0.00369408517,
          -0.00859522447,
          0.00269977935,
          0.00389638706,
          -0.00557888066,
          0.00977469888,
          0.0144539038,
          -0.00597011251,
          -0.0133903548,
          0.00182414369,
          -0.00221335771,
          -0.0188238602,
          0.00142219558,
          -0.00701283943,
          0.00733899418,
          0.0110500585,
          0.00439646095,
          -0.0102189733,
          0.0122002009,
          -0.00810309779,
          0.00424715923,
          -0.00320260669,
          0.0161885712,
          -0.00944722444,
          -0.00280942,
          -0.0129756648,
          0.00149548426,
          0.00451732893,
          0.000803828181,
          0.00382539351,
          -0.00484651,
          -0.014922075,
          -0.00858657621,
          -0.000747436192,
          0.00475887535,
          -0.00622535171,
          -0.0107817054,
          0.000355845754,
          0.00205251761,
          0.00809369702,
          0.0164471436,
          0.0174083877,
          0.00919466466,
          -0.019674167,
          -0.015634099,
          0.00175500254,
          -0.0010881488,
          -0.0206484776,
          -0.0073792669,
          0.00283469399,
          0.0014762386,
          -0.00640332652,
          -0.0107371276,
          -0.00115198665,
          -0.0025902451,
          -0.00898290705,
          -0.00262735528,
          0.00106248166,
          0.00365014514,
          0.012853126,
          0.01108,
          -0.0123184491,
          0.00192032091,
          -0.0115533704,
          0.008712966,
          0.00295704347,
          0.00527153304,
          -0.00318693952,
          0.00765675399,
          0.00565437553,
          -0.00970812701,
          -0.0135593032,
          0.00635317201,
          0.00186347205,
          0.0125115085,
          -0.0123230517,
          0.00318853045,
          0.0132936537,
          0.00489287451,
          -0.00287138019,
          -0.00725849206,
          0.00451987935,
          0.0122433575,
          0.00396908261,
          0.0118603,
          0.00460197218,
          0.00854465272,
          0.0144922156,
          -0.0218947232,
          -0.00611685263,
          0.00826547761,
          0.00190457108,
          -0.00217779912,
          -0.00953208,
          -0.000364804495,
          -0.0044443747,
          -0.010051704,
          -0.00106989162,
          -0.000434019166,
          0.00300671696,
          -0.00681339856,
          0.0030304261,
          -0.0014757365,
          -0.00404026359,
          0.000908411515,
          0.0134530151,
          0.00481989374,
          -0.011109231,
          0.00199265825,
          -0.00598156871,
          -0.00951415673,
          0.0130378986,
          0.000172907457,
          -0.0161037203,
          0.00801410154,
          -0.000832316291,
          -0.00665485533,
          -0.00151834241,
          -0.00976396259,
          0.0157238934,
          0.0156561825,
          0.00509463809,
          0.014418059,
          0.0100861285,
          0.000231277751,
          -0.0134406006,
          0.0144384317,
          -0.0166354142,
          0.0030621239,
          -0.0141175231,
          -0.0115683917,
          -0.00391890761,
          0.00609238725,
          -0.00541016366,
          0.0113518592,
          0.0144960778,
          -0.00986511,
          0.0122222006,
          -0.00471240794,
          0.00759696681,
          0.00269653485,
          -0.0276315603,
          -0.00109022285,
          -0.00796364527,
          0.011627093,
          -0.0143606,
          0.00450219633,
          -0.00644593732,
          -0.00494110724,
          -0.00281014224,
          -0.0114287753,
          0.012506837,
          0.00737105822,
          0.00721231895,
          0.00809924,
          -0.0131237572,
          0.00749114528,
          -0.012697963,
          0.00259012077,
          0.00500519946,
          -0.00412567332,
          -0.00354415295,
          0.00802655332,
          0.00221543387,
          0.00428638933,
          -0.00129892398,
          -0.000515589723,
          -0.0143416775,
          0.0128653143,
          -0.00892368611,
          -0.0120474361,
          -0.0179967508,
          -0.00332162669,
          0.0168161057,
          0.00347903348,
          0.00952472,
          -0.001376217,
          -0.000913902069,
          0.00334078143,
          0.000610451563,
          -0.0102172298,
          0.0044595,
          0.0114066927,
          0.0124478759,
          -0.00591745786,
          -5.25924406e-06,
          -0.00672670733,
          0.00142441376,
          -0.00577369379,
          0.00153297326,
          -0.014194089,
          -0.00943153724,
          -0.00365025108,
          -0.0030353,
          0.00774322916,
          0.0116377389,
          0.00921388529,
          -0.0217474326,
          0.00853504054,
          -0.000403455371,
          0.00862050243,
          -0.00973759592,
          -0.0153181748,
          -0.0102399141,
          0.00281745428,
          -0.0126948673,
          0.0104016289,
          -0.00877287611,
          0.0122512132,
          -0.00611414574,
          0.00758286472,
          0.0167948455,
          0.00911184307,
          0.0177037,
          0.00446937932,
          -0.0135732712,
          -0.0101663191,
          0.014594811,
          0.0185999442,
          -6.01378815e-06,
          -0.00208345428,
          -0.0226553679,
          -0.00645929575,
          0.00294058677,
          0.0190266091,
          0.00823238306,
          -0.0167519823,
          -6.20790252e-06,
          0.0179972518,
          -0.00381903932,
          0.00326583791,
          -0.00525100715,
          -0.0107938927,
          0.00497086858,
          -0.00959023088,
          0.00909709185,
          -0.0106678335,
          -0.0106469598,
          -0.0164410267,
          -0.015144892,
          0.0148009546,
          0.0156168109,
          -0.00793666393,
          0.000362545776,
          0.00850814488,
          -0.00226834673,
          -0.00422007963,
          0.00591693074,
          -0.0122373262,
          -0.00818519,
          0.000240928042,
          -0.0155892326,
          -0.00639376882,
          0.00739664398,
          0.00389667903,
          0.0113316542,
          0.00984948594,
          0.0178448129,
          -0.00765198749,
          0.00798458327,
          -0.00698810164,
          -0.00713249715,
          -0.0184641667,
          -0.0148784705,
          -0.0159072075,
          -0.0161864888,
          0.00804138184,
          -0.0114823487,
          0.00102760363,
          0.018440865,
          -0.00146972924,
          -0.000842980109,
          -0.0147296824,
          0.00442018081,
          -0.00900892,
          -0.0172605235,
          -0.00106259971,
          0.00454262411,
          -0.0107596368,
          0.00564916432,
          0.00438996125,
          -0.00753222452,
          -0.0191342495,
          0.0110107269,
          0.000833873462,
          0.0176820233,
          -0.0149229132,
          0.00120038795,
          0.0165120792,
          0.00791592151,
          -0.0107655758,
          0.0135517698,
          0.012950168,
          0.00575143239,
          0.00478537,
          -0.00531731779,
          0.00523749087,
          0.0104949865,
          0.00820527878,
          0.023056997,
          0.0133882277,
          -0.00106952467,
          0.00182373868,
          -0.00693837833,
          -0.00513869431,
          0.011545362,
          -0.00241628219,
          -0.000117932555,
          0.00619820785,
          -0.00966672134,
          -0.00586213917,
          -0.0105655976,
          -0.00723637734,
          0.00790384598,
          -0.00969859399,
          0.0220090616,
          0.00513116736,
          0.0198861491,
          0.00434256298,
          -0.00270675,
          -0.00707766693,
          0.0113544203,
          0.0114462739,
          -0.0194854401,
          -0.0018179859,
          0.000364577834,
          0.00393400667,
          -0.00647223927,
          0.00574347517,
          -0.00482197339,
          -0.00231118221,
          0.00992636289,
          0.0034344322,
          -0.00662896223,
          -0.0085579576,
          0.00337021402,
          -0.0100106318,
          0.00535491,
          -0.00212242617,
          0.00839671865,
          -0.0136967553,
          -0.0104633942,
          0.00566978194,
          -0.00523340236,
          -0.0115122758,
          0.00110369548,
          0.00369854667,
          0.0328672677,
          -0.0131209232,
          -0.00464362698,
          0.00733798416,
          -0.00238544238,
          0.00454919832,
          0.000261245703,
          -0.0131318709,
          -0.00120185327,
          0.00301407441,
          -0.00120729906,
          0.0104807867,
          -0.00154550793,
          -0.00583606306,
          0.00333307334,
          0.00620856741,
          0.00433838461,
          -0.00729696732,
          -0.020675391,
          0.000635203556,
          -0.00204556389,
          0.00269832253,
          0.0174269117,
          0.00542863039,
          0.000576676044,
          0.0212547928,
          -0.0090012867,
          -0.0170346554,
          -0.00380365318,
          -0.00138075917,
          0.00305608823,
          -0.00456575677,
          -0.00130837748,
          -0.00779236061,
          0.0048073763,
          -0.0120470896,
          0.00561651448,
          -0.000722343801,
          0.000779806403,
          -0.00361322565,
          -0.00655461662,
          0.0100933062,
          0.0145843653,
          0.000644599262,
          -0.000974462,
          -0.00166516786,
          0.010113908,
          -0.00933658,
          0.000114258779,
          0.00838880334,
          0.0164065864,
          -0.010427257,
          -0.0049666,
          0.0156107694,
          0.00434825337,
          -0.0060847667,
          -0.00070555351,
          0.000371050293,
          0.00469632866,
          -0.00509689376,
          -0.012556836,
          0.00251469249,
          0.00715726893,
          0.0149286082,
          -0.00989837572,
          -0.00833969377,
          0.00176192145,
          -0.00602595927,
          -0.00539144222,
          0.0121907331,
          0.000427490799,
          0.0081767831,
          -0.0115772849,
          -0.0187871195,
          -0.0054704505,
          -0.00376915676,
          0.00972898211,
          0.0113098193,
          -0.00178433023,
          -0.00852025766,
          -0.00896842685,
          0.00518346298,
          -0.00774222333,
          -0.00155763444,
          0.0106757032,
          -0.0104368059,
          0.017157387,
          -0.00904510822,
          0.0185780469,
          0.00445080735,
          0.0151088536,
          -0.00740894,
          -0.00116254168,
          0.000253519975,
          -0.00610929169,
          -0.00368283363,
          -0.0101041561,
          -0.00473347353,
          0.0147661818,
          -0.0248903316,
          0.0210117754,
          -0.00742775714,
          -0.00961727,
          0.000769430539,
          -0.00515706791,
          0.0038508554,
          -0.00086662767,
          0.00925819,
          0.00430640625,
          -0.00340215373,
          -0.00193877367,
          0.0115102772,
          1.98343769e-05,
          0.00314223045,
          0.0161866434,
          0.0128319478,
          0.00860730745,
          0.00549066672,
          0.00268113543,
          -0.00563361263,
          0.00506251957,
          -0.0165519714,
          0.0156241823,
          -0.01115904,
          -0.0131864212,
          -0.00462438166,
          0.0106335394,
          -0.00532423472,
          -0.00769624114,
          0.00503686,
          0.000931072223,
          -0.00868107844,
          0.000934924174,
          0.00130782148,
          0.00205313205,
          0.0112661123,
          -0.00505814841,
          0.00626613805,
          -0.00291526085,
          0.004733535,
          0.00908535346,
          -0.00809717737,
          -0.00782089774,
          0.00720839947,
          0.00990000274,
          -0.0102598555,
          0.00949609187,
          -5.57963904e-05,
          -0.0174879376,
          -0.0240447558,
          -0.00418578507,
          -0.0170613453,
          0.00312529062,
          0.0243532471,
          -0.00647554966,
          -0.00340387551,
          0.00343628926,
          0.00859702658,
          0.0064595025,
          -0.017535992,
          -0.00977025181,
          -0.00270536402,
          0.00540996948,
          0.0034547979,
          0.0100423899,
          -0.0162635557,
          0.00596404728,
          -0.0102149546,
          -0.00925409235,
          -0.0060966122,
          0.00966936629,
          -0.00105723448,
          0.000377031276,
          0.00164581498,
          -0.00450616376,
          0.0111479582,
          -0.00293589849,
          -0.00830497593,
          -0.000532571285,
          -0.0186544769,
          0.00142962823,
          -0.0201223157,
          0.00188271957,
          -0.00445283903,
          -0.00628615776,
          -0.0053693396,
          -0.0146028399,
          0.00458331546,
          0.00779789872,
          -0.00343325851,
          -0.00483341,
          -0.0150839044,
          -0.0027456223,
          -0.0198736712,
          0.0172959473,
          0.00802394189,
          -0.00346672512,
          0.0090775108,
          0.00893632416,
          0.00136254402,
          0.00819035061,
          0.00795270782,
          0.00556717953,
          -0.0111819347,
          0.012571292,
          0.0105619235,
          -0.00259089,
          0.00517931348,
          0.00821843091,
          0.00077205553,
          0.00978203863,
          0.00566642499,
          0.0165055264,
          -0.0104942685,
          0.0139803961,
          -0.00608151453,
          0.0126640368,
          0.0145072,
          -0.00388930598,
          0.000107272848,
          -0.00668581622,
          0.00264581922,
          0.0170329213,
          0.00472143432,
          -0.0139019582,
          0.00893515628,
          -0.0139322542,
          0.000975212315,
          0.00219927635,
          0.0115650566,
          -0.0105504785,
          -0.0111420378,
          0.00410590926,
          -0.0112954779,
          0.00961053558,
          -0.0117401322,
          -0.00328574562,
          -0.00401850464,
          0.00113278837,
          0.0228448547,
          0.00123105268,
          -0.0106766792,
          0.00809820928,
          -0.00106933492,
          0.0115669258,
          -0.00737686502,
          -0.000383830571,
          0.00755791506,
          0.00145628548,
          -0.0224158708,
          0.0156445019,
          -0.00227383664,
          -0.0024146447,
          0.00150150456,
          -0.0107410084,
          -0.00629013777,
          -0.00443722447,
          0.000560053275,
          0.0106977774,
          0.0124609284,
          -0.00205377652,
          -0.0075752777,
          -0.0120165311,
          -0.0103193931,
          -0.00102460955,
          0.00440630456,
          0.010612756,
          0.00365354726,
          -0.00386909395,
          -0.0146657079,
          0.00143644097,
          -0.00483411783,
          -0.00344740134,
          0.00926986709,
          0.0011574853,
          -0.000636804034,
          0.014882002,
          -0.000784745615,
          -0.00195512013,
          -0.00919287,
          0.0197536927,
          0.0157216806,
          -0.0025226078,
          0.0205668304,
          0.000592251658,
          -0.00417970447,
          0.00487498892,
          -0.0031349475,
          0.0106001934,
          -0.0115529811,
          -0.00475193514,
          -0.00183029438,
          -0.0203546192,
          0.00646842504,
          -0.0194136761,
          0.0210542958,
          -0.00179684453,
          0.00457373913,
          -0.00161307876,
          -0.00796801,
          0.00433451403,
          0.000692845,
          -0.00715311198,
          -0.0099242935,
          0.00873898249,
          0.000227868804,
          0.000987222069,
          0.018033348,
          0.0186665561,
          0.0285663791,
          -0.0218629278,
          0.0063449014,
          -0.0179298744,
          -0.00209006481,
          -0.00641275896,
          -0.000393486524,
          -0.00158110727,
          -0.00827563088,
          0.00839640666,
          0.00795687921,
          -0.014155712,
          0.00440758187,
          0.0231321231,
          -0.0196484104,
          0.0116967773,
          -0.00313459709,
          -0.00622904347,
          0.00125039357,
          -0.0119201364,
          -0.0123833511,
          -0.00163485948,
          0.000287014031,
          0.0184919927,
          -0.0123329554,
          0.00663313,
          0.00707487529,
          0.00253172871,
          -0.0024123122,
          -0.0298789274,
          0.00499113929,
          0.00501491269,
          -0.0206498373,
          0.0169981476,
          0.00927434117,
          -0.0117866276,
          0.0180913247,
          -0.0131342169,
          -0.0108359633,
          -0.016071368,
          -0.0151593564,
          0.000342401909,
          -0.000541320245,
          0.0017605226,
          -0.00893168617,
          -0.00113359885,
          -0.0064470442,
          0.0182795785,
          0.004727358,
          0.0125110596,
          -9.39400852e-05,
          -0.00473567285,
          -0.000522198388,
          0.0143337436,
          -0.00506747,
          -0.00671610888,
          -0.00203314237,
          0.0183146726,
          0.00287905824,
          -0.0021374335,
          -0.00801773183,
          0.0114360116,
          -0.0117085353,
          -0.0170244519,
          0.0132588614,
          0.00881345756,
          0.00193772558,
          0.0109764375,
          0.0240862314,
          -0.00187908,
          -0.00159281946,
          -0.00678782957,
          0.0143761411,
          -0.00371890306,
          -3.10260748e-06,
          0.00233440939,
          -0.0182152633,
          -0.00610798784,
          0.00807771087,
          -0.00562067376,
          -0.00781063968,
          -0.0077390587,
          0.000817618275,
          -0.0106433006,
          -0.0120543959,
          0.00979473908,
          0.00345556601,
          -0.00395330647,
          -0.00457234075,
          -0.000288603973,
          0.00184940326,
          -0.0223566163,
          0.0157462861,
          -0.0046498538,
          0.0114147747,
          0.0176976118,
          0.00612221425,
          -0.0051068305,
          -0.0168294273,
          -0.0159981716,
          0.00670958962,
          0.0105054481,
          -0.000123121135,
          -0.00365566695,
          0.00338217453,
          0.00215210044,
          0.000613233831,
          0.00837951247,
          0.00487451069,
          -0.00419484824,
          0.00129205163,
          0.00933022611,
          0.0011649247,
          0.00169106759,
          0.00907114893,
          -0.00980136,
          -0.016858086,
          0.0185307302,
          -0.0192698818,
          0.00631909957,
          -0.00826267432,
          -0.0128834434,
          0.00700159837,
          0.0248823352,
          -0.00678622257,
          -0.00684537133,
          0.0128126545,
          -0.00211482332,
          0.0213554092,
          0.00251479913,
          0.00733430916,
          0.00192617951,
          -0.01268862,
          -0.00451772613,
          0.00399665674,
          -0.019053502,
          0.0209498424,
          -0.0246454179,
          -0.0164997205,
          0.0219666399,
          0.0049597607,
          0.0112963179,
          -0.0127919242,
          0.0105287246,
          -0.006250381,
          -0.00260534603,
          0.00691487454,
          0.00119223283,
          -0.00409104908,
          0.00534912292,
          0.0113105271,
          0.00469071418,
          -0.0185311083,
          -0.00905176066,
          0.00581679,
          -0.0183268934,
          -0.00317616179,
          0.00565503584,
          0.0143875433,
          0.00379519211,
          -0.00865987688,
          -0.00376122864,
          -0.00276864949,
          0.000343088032,
          -0.00346044428,
          -0.00505205803,
          0.00488713337,
          0.0105941175,
          0.0100538814,
          0.0244608968,
          -0.00574873574,
          -0.00544160698,
          -0.0167928822,
          0.00471129082,
          0.00756970281,
          0.00598827284,
          0.00345502514,
          -0.000487169891,
          -2.23961506e-05,
          -0.0102882562,
          0.0114434622,
          -0.00332208537,
          0.0112297088,
          0.00704996474,
          0.00105570524,
          -0.00398639077,
          -0.0191174056,
          0.00882727839,
          0.00605581375,
          0.0118525578,
          -0.00727131171,
          -0.00266328,
          0.000980434124,
          -0.00408093585,
          -0.00467537204,
          -0.0170801431,
          -0.00965759158,
          -0.0105826985,
          0.000235369531,
          -0.00359278591,
          -0.031030003,
          0.0145183923,
          -0.00940432213,
          -0.00215740106,
          -0.0141408788,
          0.00417593727,
          0.0178429224,
          -0.0146711189,
          -0.00222735293,
          0.0264631119,
          -0.014295388,
          -0.0011413286,
          0.0100483447,
          0.000103930877,
          0.00862582214,
          -0.00864009652,
          0.016167419,
          0.0128195817,
          0.0189565606,
          0.000833650236,
          -0.00670899497,
          -0.00385589851,
          -0.0094447555,
          0.000585345377,
          -0.00779398391,
          -0.00324996701,
          0.00461473595,
          0.00627484545,
          0.0126300678,
          -0.0118479971,
          0.0142940599,
          -0.00356284948,
          0.00250298716,
          -0.00870168209,
          0.00169718906,
          -0.0109801907,
          0.0047763912,
          0.0287305322,
          -0.0192300156,
          -0.00868505239,
          0.0150622576,
          -0.00779905869,
          0.00411563087,
          -0.0105812252,
          0.00823650882,
          0.00258198613,
          0.0132919038,
          0.00921694748,
          -0.0185440294,
          -0.00161218166,
          0.0120503707,
          -0.00462172693,
          -0.00378180924,
          -0.00830401853,
          -0.014572517,
          0.0274283458,
          0.0240439568,
          -0.0143730687,
          0.00525038876,
          -0.017147528,
          -0.0118402634,
          0.00537034,
          -0.00598926749,
          0.0202453472,
          -0.00475893728,
          0.0120208114,
          0.00520527503,
          0.00589738134,
          -0.00508977519,
          0.00128937117,
          0.00317416666,
          -0.0131940236,
          0.0130354166,
          -0.00668911124,
          -0.0156105226,
          -0.013513267,
          -0.00544831529,
          0.00509271864,
          -0.0120446878,
          -0.00417176029,
          -0.0160951298,
          0.00684349565,
          -0.00760317035,
          0.0127190184,
          0.00708506908,
          -0.0176550783,
          0.00319444179,
          0.0103072412,
          -0.00439216383,
          0.0032712575,
          -0.00246203365,
          -0.000802707102,
          0.00174803729,
          -0.00874524843,
          -0.00230130693,
          -0.0150914015,
          0.0243136305,
          -0.0177849941,
          -0.00419103215,
          0.0112017337,
          0.0113146314,
          0.00978689641,
          -0.00589483278,
          0.00341809727,
          0.00753829768,
          0.0088998368,
          0.00993338693,
          0.0079020625,
          0.0133319637,
          0.00591388159,
          0.00326728378,
          -0.0129010007,
          -0.0114089716,
          0.00497875595,
          0.0161744077,
          -0.00727067702,
          -0.0289058965,
          0.0301453751,
          0.0137436157,
          -0.00387905305,
          -0.034819,
          -0.00326035428,
          -0.0126232198,
          -0.0110544991,
          0.00940445,
          0.0157473832,
          0.0127493301,
          0.00353081524,
          -0.0154061178,
          -0.00639074575,
          0.0147947781,
          -0.0228600483,
          -0.00869146828,
          -0.0105871679,
          0.006618076,
          -0.0339187942,
          -0.00334944879,
          0.00481445109,
          0.00276841759,
          0.00827765465,
          -0.00194835023,
          0.0037689507,
          -0.0139061557,
          0.0148434285,
          -0.00957852416,
          -0.0107998373,
          0.0203896742,
          0.00222842884,
          -0.00444992073,
          0.00871186,
          -0.00423637405,
          0.0102518713,
          0.00362868,
          -0.0010783379,
          0.00539141847,
          -0.00282828789,
          0.0125452904,
          -0.00756474165,
          0.00929190218,
          -0.00724656507,
          -0.00165718026,
          0.00763919624,
          -0.00679738866,
          -0.0195199419,
          0.00992915127,
          -0.018427914,
          0.0181910917,
          -0.00527047738,
          0.0158154462,
          0.00941897929,
          -3.9760962e-06,
          0.00590268476,
          0.00663888827,
          0.0103752268,
          -0.0295881312,
          -0.00212251442,
          0.0141065279,
          -0.00290797581,
          -0.0155558018,
          0.00384214357,
          -0.00455998676,
          0.0189975742,
          -0.00316263828,
          0.0112725822,
          0.00202038884,
          -0.00410813186,
          -0.0174142309,
          -0.0055574025,
          -0.00320286513,
          0.00382870482,
          0.00116121757,
          -0.0162577312,
          -0.0139950858,
          0.000843728718,
          0.0121618975,
          -0.00890308246,
          0.0146251274,
          0.0174007155,
          -0.00312313694,
          -0.0125510525,
          0.00828072522,
          -0.00434290944,
          -0.00514689088,
          -0.00626344886,
          -0.0220372155,
          0.00179978926,
          -0.00374245271,
          0.0142592434,
          0.00267911772,
          0.00742850406,
          -0.000853268895,
          0.0134695014,
          0.0140248109,
          -0.0140815089,
          -0.00301420968,
          -0.00720080221,
          0.012797147,
          -0.000482195435,
          0.0133051286,
          -0.00535912113,
          -0.0190047473,
          0.0126699666,
          -0.0146523677,
          -0.000328129157,
          -0.00521951308,
          -0.0092993509,
          -0.0141644599,
          0.0139992721,
          0.000449110114,
          -0.00749482214,
          -0.0110130031,
          0.00972171,
          -0.00253293826,
          -0.00633970369,
          -0.019144265,
          -0.0130009744,
          -0.00180605543,
          0.00148382632,
          0.0102260094,
          -0.00900264177,
          0.00803274848,
          0.011449906,
          0.00702948309,
          -0.0194066297,
          0.0172863901,
          -0.00326384977,
          0.0185676012,
          0.00937941,
          -0.00522751966,
          -0.00027060532,
          -0.00375676272,
          -0.00925288256,
          0.0212809648,
          0.00518155,
          -0.00216972665,
          0.00690074777,
          -0.0292818863,
          0.0020927838,
          0.0150385965,
          0.000130792076,
          -0.00952728279,
          0.01907539,
          -0.00029953738,
          -0.010876039,
          -0.00981587078,
          -0.0133446716,
          0.00438539824,
          -0.0066055404,
          -0.0100650201,
          0.00727062579,
          0.0153562296,
          -0.0210860278,
          0.0300992317,
          0.00525549473,
          0.00639371667,
          0.00640267925,
          0.0163940061,
          0.0133058708,
          -0.00841319561,
          -0.0136425458,
          0.00957954861,
          0.000754966051,
          -0.00817334745,
          -0.0138818631,
          -0.00341805327,
          0.00355358142,
          -0.000864131318,
          -0.00563139049,
          0.0141588971,
          0.00767949084,
          0.014497838,
          0.00756537495,
          0.00418457808,
          -0.0234418,
          0.0215032175,
          -0.0136258379,
          -0.00758434273,
          -0.00323760952,
          0.00701273372,
          -0.00174869131,
          0.0213855859,
          0.0178315975,
          -0.013036089,
          0.0088065071,
          0.00381059642,
          -0.0171157569,
          -0.00291493908,
          0.0172954053,
          -0.00179721974,
          0.00659170607,
          0.00482745888,
          0.00996445,
          -0.0178311653,
          0.00442063762,
          -0.0229390617,
          0.0160148814,
          -0.00332409563,
          0.0070039737,
          -0.00976652931,
          -0.0106578218,
          -0.0272979,
          -0.013430832,
          0.0105354348,
          -0.00355218467,
          0.00224943412,
          0.00906578638,
          0.00678928,
          -0.008385689,
          0.012083862,
          -0.00780749088,
          0.00693477085,
          -0.0016666532,
          -0.0112126665,
          0.00427539507,
          0.00856434181,
          0.0151549643,
          0.00738488184,
          -0.00975343492,
          0.0125486,
          -0.00617421698,
          0.016683165,
          -0.00111932063,
          -0.0105303358,
          -0.0126520125,
          -0.0083799623,
          -0.00706465496,
          0.00258846232,
          0.0177527629,
          -0.0165334381,
          -0.00407097,
          0.0116940588,
          -0.000768236583,
          -0.00247475551,
          0.00481408974,
          -0.00299325213,
          -0.00634727255,
          -0.00932095107,
          -0.0112209478,
          0.000171973545,
          0.00257855561,
          -0.00189254317,
          -0.0100461217,
          0.00982883852,
          0.00359464181,
          -0.00881151296,
          0.0155644342,
          0.0069434694,
          0.00350603508,
          0.00513187842,
          0.00915386621,
          0.00567208836,
          -0.00446872739,
          -0.00980197266,
          -0.00755024562,
          0.0041393037,
          0.00517117092,
          0.0117672402,
          0.00315544754,
          -0.00705479505,
          0.00617614714,
          0.00898190122,
          0.0136622954,
          0.00269546593,
          -0.00842503,
          -0.0113368183,
          -0.00125772262,
          0.00891405,
          -0.0139662167,
          0.00620102556,
          -0.00244429032,
          0.00782997813,
          -0.0116360877,
          -0.00944412686,
          -0.00299714319,
          -0.0082248,
          -0.00912944134,
          0.00253091147,
          0.00302346819,
          -0.0140013695,
          -0.00268410356,
          0.00224501616,
          0.00153285556,
          0.0220179949,
          0.0106536718,
          -0.0169947762,
          0.0152659519,
          -0.00143126782,
          -0.0228081923,
          -0.0031999636,
          0.00778336916,
          -0.00996330287,
          0.0147509817,
          0.0233210474,
          -0.00541633554,
          0.00309636141,
          0.00251045171,
          -0.00820215698,
          0.00347144669,
          -0.0129294479,
          0.00299693528,
          0.0111060338,
          0.00304770935,
          0.0129653905,
          0.00243665185,
          0.00257725408,
          0.00784831308,
          0.00993618928,
          0.000177286929,
          -0.013265159,
          0.00653177407,
          -0.0122097628,
          0.00296660652,
          0.00754730636,
          -0.00386912189,
          0.00431953883,
          0.0271282103,
          -0.00550080184,
          0.0142625533,
          0.0139085269,
          -0.00795040093,
          0.0106912935,
          0.00468970183,
          -0.0139802285,
          0.00825144164,
          -0.013819159,
          0.016482072,
          -0.00467700511,
          -0.00652349694,
          0.01669994,
          -0.00456656,
          -0.00687550101,
          -0.00905617792,
          0.00789913,
          0.00587241817,
          -0.00604883535,
          0.0143819395,
          -0.0179039538,
          -0.0188710559,
          -0.00509904511,
          -0.00590757,
          0.000553429301,
          -0.0135402111,
          -0.00309212133,
          0.0132882772,
          -0.0357610583,
          -0.00651818886,
          -0.00192504248,
          -0.00149950082,
          -0.00788529404,
          -0.0217702556,
          0.00605470268,
          0.00478067202,
          -0.00299744355,
          0.00537724793,
          -0.00318668596,
          0.00260371133,
          0.0213118438,
          -0.00982062,
          -0.010125787,
          -0.00391318975,
          -0.0279990435,
          0.0110671371,
          -0.017109789,
          0.000208242796,
          -0.0150060691,
          0.00594459428,
          0.00239050784,
          0.0156495105,
          0.00440472178,
          0.0228446834,
          0.004216081,
          -0.0134492898,
          -0.000257227308,
          0.0069972151,
          -0.0158762485,
          -0.00476486282,
          0.0121331187,
          -0.00444300659,
          0.0129562067,
          -0.00522364397,
          0.00562039297,
          0.0124692572,
          -0.0247902852,
          -0.000408301421,
          0.000557237654,
          0.0212923884,
          -0.00924742874,
          0.0150607899,
          -0.00343876705,
          0.0116231935,
          -0.00987201836,
          0.00317951431,
          0.000170708474,
          -0.000807221688,
          0.0055081821,
          0.0080591524,
          -0.000524805626,
          0.00166066026,
          0.00727966661,
          0.012268234,
          0.00122799876,
          -0.00713041285,
          -0.0146800531,
          -0.0104463091,
          -0.00246747979,
          -0.00187485316,
          -0.000322305918,
          -0.017150417,
          -0.0196393393,
          0.00327954441,
          0.00134985347,
          0.0143302279,
          0.0109004658,
          -0.0121698603,
          0.00574016804,
          0.0167827308,
          -0.00569470879,
          -0.010882034,
          0.00892492663,
          0.0134269753,
          -0.0181028061,
          -0.0106608141,
          -0.00740020629,
          0.0103827128,
          0.00975192524,
          -0.0121242134,
          -0.00145676301,
          0.0101604937,
          0.00870796666,
          -0.0114611704,
          -0.00734208757,
          -0.0148533173,
          -0.0116782654,
          0.00232546474,
          0.0057077161,
          -0.00438400824,
          -0.00890780892,
          0.00723232701,
          0.0146249784,
          -0.0244133361,
          0.0232787281,
          0.00424704794,
          0.00953188725,
          -0.00194574741,
          -0.00801044051,
          0.000775795314,
          -0.00246412819,
          0.0172129553,
          -0.005184134,
          -0.00995241292,
          -0.00130905129,
          0.00934755895,
          0.0171818826,
          0.0154909724,
          0.00470438972,
          0.00554996543,
          0.0090585649,
          0.00409799069,
          0.0117218141,
          -0.0314623676,
          0.0138388509,
          -0.0130789904,
          0.000164610901,
          -0.00236409763,
          0.00107224134,
          -0.0188801084,
          -0.00255422131,
          -0.0105653843,
          0.00102286774,
          -0.00458793761,
          0.000286351,
          0.00777952373,
          -0.00265261065,
          -0.0208818875,
          -0.0181764141,
          0.0148505047,
          -0.00582404528,
          0.00784291141,
          -0.00843673199,
          -0.000344046653,
          0.00668740412,
          0.0225593261,
          -0.0272419434,
          0.0185606238,
          -0.00686589908,
          -0.0111872815,
          0.00263974373,
          0.00597591558,
          -0.00480277,
          0.00741303107,
          -0.0181783698,
          0.00617331732,
          -0.0111697642,
          0.0088549424,
          -0.00495940773,
          0.0100766188,
          -0.0254124161,
          0.0103104282,
          -0.00233459473,
          -0.0144321332,
          -0.0134858005,
          -0.0230424218,
          -0.00359618594,
          0.0120706121,
          0.0208307412,
          0.0111496774,
          0.00433775876,
          0.0226927772,
          -0.0026352182,
          -0.0118878009,
          -0.0178833865,
          0.00221226551,
          -0.0108924732,
          0.0219870284,
          0.00375047536,
          -0.0123973461,
          -0.00909127668,
          0.00571128959,
          -0.0101865595,
          -0.00147499691,
          0.00355962641,
          0.00687209936,
          -0.00374042545,
          -0.0063945069,
          -0.00598996412,
          0.020790197,
          0.00360769825,
          -0.000973095885,
          -0.00191899913,
          0.0178544149,
          -0.00553925335,
          0.0161274448,
          0.0183836948,
          -0.0195958335,
          -0.00925377849,
          -0.0020070984,
          -0.0166401025,
          -0.00104602624,
          0.0165067166,
          -0.00246864115,
          -0.0264411792,
          -0.00973659102,
          0.0159847438,
          0.0130379563,
          0.0165937915,
          0.0258863289,
          -0.00157090288,
          -0.011611429,
          -0.0267703217,
          0.00136656966,
          0.00948893465,
          0.00189588009,
          0.00681737,
          -0.00653356,
          -0.0208147652,
          -0.00793985277,
          -0.0185239948,
          0.00540635176,
          -0.0236988384,
          0.0198502727,
          0.00897072162,
          -0.014177612,
          0.00130342692,
          0.00429514283,
          -0.0178524964,
          0.00453806715,
          -0.00669776229,
          0.0104785245,
          -0.0066278954,
          -0.00250364188,
          -0.0130081214,
          -0.00741025107,
          0.00150545151,
          -0.00201120158,
          0.0106841819,
          0.0135010136,
          0.0179493837,
          0.00828449056,
          0.0206365045,
          0.00289810216,
          -0.00100131519,
          0.00513382442,
          -0.0069817286,
          -0.0138021428,
          0.0154524948,
          -0.00409124605,
          0.00535898516,
          0.0107656419,
          -6.88513828e-05,
          0.0182066988,
          0.00282505178,
          0.00444129296,
          0.00735050859,
          -0.00139103399,
          -0.00997943524,
          -0.00247102394,
          0.00741221709,
          0.0117146987,
          -0.00678501185,
          -0.00341998646,
          -0.0141297197,
          -0.00721816393,
          -0.00572520727,
          0.0231465288,
          0.00204602582,
          0.0140646081,
          -0.00630013645,
          0.000548739743,
          0.00377468741,
          -0.00199388107,
          -0.000815587526,
          -0.0144043081,
          0.0101855686,
          0.0194969065,
          -0.00661183335,
          0.00978525821,
          0.0120791439,
          -0.00702070491,
          0.013379788,
          -0.00121846085,
          0.000786315184,
          0.000512463099,
          -0.0125570865,
          0.00987944566,
          -0.0186590161,
          0.0130660292,
          -0.00817799382,
          0.00453272089,
          0.00112074404,
          0.0225843787,
          0.00224022544,
          0.0139377993,
          0.00214182422,
          -0.00466681831,
          -6.74721523e-05,
          -0.0128172347,
          -0.00626848452,
          -0.00519470172,
          -0.0262728,
          -0.0154953329,
          -0.00554207852,
          -0.00241784705,
          0.00586785097,
          0.00845035538,
          -0.000289222022,
          -0.0112464419,
          0.0145723354,
          -0.0100629143,
          0.00204893807,
          0.00213515759,
          0.0079396423,
          -0.00652941875,
          -0.00467226701,
          -0.0124889538,
          -0.0129050231,
          0.0172904208,
          0.00067825272,
          0.00212494517,
          0.0241030511,
          0.000811719277,
          -0.0151719,
          0.00220216159,
          0.00319342106,
          0.0139075322,
          0.00969646126,
          -0.0058465316,
          -0.00898857694,
          -0.0195891336,
          0.0118664205,
          0.0100083528,
          0.00388521352,
          0.0116521325,
          -0.0136803854,
          -0.0217558853,
          0.0058548646,
          0.00825582538,
          -0.00214302889,
          -0.00600669207,
          -0.000762648066,
          0.000158819821,
          0.00555583881,
          -0.00335451099,
          -0.012714739,
          0.00919385254,
          0.00357745751,
          -0.0063357926,
          0.0036442359,
          -0.0105359452,
          0.00714778155,
          -0.0022157731,
          -0.00158669811,
          -0.00739858,
          -0.00670038816,
          0.0159215908,
