{
 "irVersion": "6",
 "opsetImport": [],
 "producerName": "tenncor",
 "producerVersion": "1.0.0",
 "domain": "com.tenncor.eteq",
 "modelVersion": "6",
 "docString": "",
 "graph": {
  "node": [
   {
    "input": [
     "i0"
    ],
    "output": [
     "r0_layer"
    ],
    "name": "r0_layer",
    "opType": "_DENSE_LAYER",
    "domain": "",
    "attribute": [
     {
      "name": "layer",
      "refAttrName": "",
      "docString": "",
      "type": "GRAPH",
      "f": 0,
      "i": "0",
      "s": "",
      "g": {
       "node": [
        {
         "input": [
          "i0",
          "r0::1"
         ],
         "output": [
          "r0::1"
         ],
         "name": "r0::1",
         "opType": "MATMUL",
         "domain": "",
         "attribute": [
          {
           "name": "rank_pairs",
           "refAttrName": "",
           "docString": "",
           "type": "INTS",
           "f": 0,
           "i": "0",
           "s": "",
           "floats": [],
           "ints": [
            "0",
            "1"
           ],
           "strings": [],
           "tensors": [],
           "graphs": [],
           "sparseTensors": []
          }
         ],
         "docString": ""
        },
        {
         "input": [
          "r0::3"
         ],
         "output": [
          "r0::3"
         ],
         "name": "r0::3",
         "opType": "EXTEND",
         "domain": "",
         "attribute": [
          {
           "name": "tensor",
           "refAttrName": "",
           "docString": "",
           "type": "TENSOR",
           "f": 0,
           "i": "0",
           "s": "",
           "t": {
            "dims": [],
            "dataType": 0,
            "floatData": [],
            "int32Data": [],
            "stringData": [],
            "int64Data": [],
            "name": "r0::1",
            "docString": "",
            "rawData": "",
            "externalData": [],
            "dataLocation": "DEFAULT",
            "doubleData": [],
            "uint64Data": []
           },
           "floats": [],
           "ints": [],
           "strings": [],
           "tensors": [],
           "graphs": [],
           "sparseTensors": []
          }
         ],
         "docString": ""
        },
        {
         "input": [
          "r0::1",
          "r0::3"
         ],
         "output": [
          "r0"
         ],
         "name": "r0",
         "opType": "ADD",
         "domain": "",
         "attribute": [
          {
           "name": "commutative",
           "refAttrName": "",
           "docString": "",
           "type": "STRING",
           "f": 0,
           "i": "0",
           "s": "",
           "floats": [],
           "ints": [],
           "strings": [],
           "tensors": [],
           "graphs": [],
           "sparseTensors": []
          }
         ],
         "docString": ""
        }
       ],
       "name": "",
       "initializer": [
        {
         "dims": [
          "64",
          "784",
          "1",
          "1",
          "1",
          "1",
          "1",
          "1"
         ],
         "dataType": 1,
         "floatData": [
          -0.0808047727,
          -0.0731359124,
          0.0149755841,
          0.0535024554,
          0.0583432913,
          -0.051440794,
          -0.00981016178,
          -0.0213583726,
          -0.0388227776,
          0.0229125228,
          -0.0581066273,
          0.00132758135,
          0.00689932238,
          0.0457692221,
          0.0073651569,
          -0.00434230547,
          0.0503438301,
          0.0627552941,
          0.0276119057,
          0.0650214553,
          -0.0373105519,
          -0.0190875102,
          0.049139,
          0.0112665836,
          0.0530039482,
          0.0617728159,
          -0.0434573554,
          0.0485308655,
          0.0562101342,
          -0.0279448815,
          0.0625231788,
          -0.0174423177,
          -0.0323155,
          -0.0112713631,
          -0.0185701158,
          0.0362798609,
          0.0207215939,
          -0.00267918315,
          0.00316948,
          -0.061565727,
          0.016375782,
          -0.00986637175,
          0.00908055529,
          0.0494522937,
          -0.0104129007,
          0.0310455654,
          -0.0646758452,
          -0.0586167611,
          -0.0417655632,
          0.0319686309,
          -0.0645123348,
          -0.0480916686,
          0.00429558801,
          0.00546562,
          0.0231340509,
          -0.0406857468,
          -0.00929486938,
          -0.0188386496,
          0.0502390675,
          0.0650421605,
          0.00509800669,
          -0.0503310598,
          0.0284783095,
          -0.0321092,
          0.0137683991,
          -0.0402237587,
          -0.0535063259,
          -0.0401908271,
          -0.00247604493,
          -0.0335685648,
          0.00802171696,
          0.00616459036,
          0.023503894,
          0.0467243567,
          -0.0505258106,
          -0.0580927059,
          0.0540257804,
          -0.0174330138,
          -0.0477905609,
          -0.0219570678,
          0.0582685024,
          0.0651624575,
          -0.0299351588,
          0.0473295301,
          0.0182504077,
          0.0275401194,
          0.0176956356,
          0.0390450954,
          -0.0512577482,
          -0.0216542799,
          0.0415896438,
          0.0213592537,
          0.0520047247,
          -0.0312092304,
          -0.0210294332,
          -0.0230629239,
          -0.00639359467,
          -0.0324348956,
          0.0266404226,
          0.0218183175,
          -0.0303347912,
          -0.0339617059,
          -0.0564795323,
          0.0488399453,
          0.00114171044,
          -0.0624679215,
          0.0106979934,
          0.0439306907,
          0.0169916134,
          0.000157485993,
          -0.0633684769,
          -0.0241192263,
          -0.0170172621,
          0.0294629429,
          -0.0374690928,
          0.0258294642,
          -0.0366866551,
          0.0352754407,
          -0.0336264968,
          0.0487205051,
          -0.0516218878,
          -0.0216609463,
          -0.0156199289,
          0.062222641,
          -0.012123758,
          0.0592226312,
          0.013418152,
          0.047849495,
          0.0221675131,
          -0.0309780408,
          0.0297795963,
          0.0100817122,
          0.035926614,
          -0.0643541589,
          0.0136214187,
          0.0306714363,
          0.0517029651,
          0.0354831554,
          0.0372477807,
          0.0331969634,
          -0.0141483061,
          -0.0626446083,
          -0.0270128213,
          -0.0193167552,
          0.0449980274,
          -0.0284689013,
          0.00371485227,
          0.00477942126,
          0.057219252,
          -0.00702165114,
          0.0376548767,
          -0.0387121476,
          0.044948779,
          0.0769053474,
          -0.0640805438,
          0.0384884477,
          -0.0381374881,
          0.00337705878,
          -0.00116577803,
          -0.0376117788,
          0.0554698184,
          -0.0582228452,
          -0.0457712561,
          0.0453532822,
          -0.00849726424,
          0.0466576852,
          0.00255958177,
          -0.0738185272,
          0.0353844501,
          -0.0433289222,
          0.0190924108,
          -0.0542990565,
          0.0439771637,
          0.00909856427,
          -0.0495840907,
          -0.0168806259,
          0.0327011645,
          -0.042352993,
          -0.0253416486,
          -0.0297511816,
          0.0141778905,
          0.0484875366,
          -0.0334903412,
          0.0188366231,
          -0.0228455439,
          0.0379648022,
          -0.0596135892,
          -0.0813764,
          0.0527598709,
          0.00662548887,
          0.0513696596,
          -0.0633739233,
          -0.0534305237,
          0.0466976911,
          -0.0528609678,
          0.056627512,
          -0.0182850435,
          -0.0330363363,
          0.0427321047,
          -0.00747038657,
          0.055491332,
          0.0285052899,
          0.0665140599,
          0.0351565257,
          -0.0254729912,
          0.0506277531,
          0.00657454645,
          -0.0619077533,
          -0.0066906279,
          0.0419486314,
          0.0456965454,
          0.0555472784,
          0.0375217609,
          -0.035461612,
          -0.0187053755,
          0.0132976277,
          -0.0373918898,
          -0.0365061127,
          0.019513173,
          -0.00163659675,
          -0.0370882936,
          -0.0191805791,
          -0.00175388611,
          -0.0449076332,
          0.0082400851,
          -0.0336251371,
          0.033796072,
          0.00753056305,
          0.0448750556,
          -0.0306147877,
          -0.00118747377,
          -0.0527604222,
          -0.0117622092,
          0.0297572371,
          0.050024353,
          0.0406838506,
          -0.0173916966,
          -0.0538300723,
          -0.0318603441,
          0.00223498023,
          -0.0138089936,
          -0.0221114233,
          -0.0245441981,
          0.0640371665,
          -0.0129183372,
          0.0351127312,
          0.0512564667,
          0.0619977601,
          0.00127013889,
          -0.0516353026,
          -0.0652947426,
          -0.0323364064,
          0.0223779567,
          -0.0639200211,
          -0.0246994328,
          -0.00771419425,
          -0.00166966754,
          -0.0122740623,
          -0.0593148209,
          -0.0527384728,
          -0.0273707882,
          -0.0412028097,
          0.0232397281,
          -0.00706529524,
          0.0517490096,
          0.0348247923,
          0.0576582476,
          -0.0403332822,
          -0.0393303484,
          -0.0500154682,
          0.061225079,
          -0.0145743852,
          0.0308700465,
          -0.0448280312,
          0.0455905721,
          0.0380453952,
          -0.0357150845,
          -0.000147762708,
          0.0720035881,
          -0.018245792,
          0.0140047697,
          -0.0762305632,
          0.061198242,
          0.071579,
          0.0254751686,
          -0.0401212387,
          -0.0155939516,
          0.0222435389,
          0.038420707,
          0.0596709475,
          -0.00311973039,
          0.0116636595,
          0.0567007251,
          0.0624165237,
          -0.0477351844,
          -0.0234994926,
          -0.0131519558,
          -0.0242235251,
          -0.00507857231,
          0.0200884063,
          -0.0524214134,
          -0.00802189764,
          0.013182397,
          -0.00809393357,
          -0.0160750281,
          0.0144511759,
          -0.0402635671,
          0.0327754468,
          -0.0627332553,
          -0.0576969124,
          -0.0170140304,
          0.0296301562,
          0.064392671,
          -0.06838727,
          -0.00603874,
          0.0036138487,
          -0.0290008318,
          0.0588243455,
          0.0168184172,
          -0.0233699847,
          0.0113353608,
          0.00418839464,
          -0.0226738043,
          0.0232916716,
          -0.0418553688,
          0.0398856848,
          0.0177219212,
          0.0548422709,
          0.0571735762,
          0.0329012,
          0.0335508771,
          -0.0257193279,
          0.0436620526,
          -0.0492393672,
          0.0358017348,
          -0.0407761261,
          -0.0583058,
          -0.0383240022,
          0.0310519878,
          -0.0341286734,
          0.0136119844,
          0.0161100123,
          -0.0492885746,
          0.0385834947,
          -0.0437725745,
          0.0424317308,
          -0.0139681175,
          -0.056476295,
          -0.0352471173,
          -0.0136191165,
          0.0544714555,
          -0.0164551325,
          0.0192697234,
          -0.0283065122,
          0.0189153366,
          0.0179937035,
          -0.064090848,
          0.0447057709,
          -0.000795769913,
          0.0409164466,
          0.0632835329,
          0.00547067914,
          -0.00899830274,
          -0.046022404,
          -0.0168919917,
          0.0231636893,
          -0.0508630872,
          0.0149817895,
          0.00565091101,
          0.0327277109,
          0.0275033768,
          0.0230888203,
          -0.0166006293,
          -0.0138301272,
          0.0394380465,
          -0.0742099211,
          -0.0658946335,
          -0.0394882746,
          -0.048134096,
          0.0538119189,
          -0.0144431284,
          0.0173644908,
          -0.0362050869,
          0.0148014883,
          -0.0105516231,
          0.0212249681,
          -0.0263280235,
          0.0192948505,
          0.0639709309,
          0.0770291761,
          -0.0397864468,
          0.0241853967,
          -0.0575795881,
          0.0116019705,
          -0.0156873129,
          0.0212429557,
          -0.0548929162,
          -0.0435508303,
          -0.0455512404,
          -0.0344150811,
          -0.00623877766,
          0.0602149256,
          0.0711233318,
          -0.0561944768,
          0.0305354632,
          -0.00379577372,
          0.00349911745,
          -0.0145319914,
          -0.050375957,
          0.00811532605,
          0.0227582678,
          -0.0451211594,
          0.000545487448,
          -0.0497096889,
          0.04008127,
          -0.0528390855,
          0.0150867011,
          0.0738472864,
          0.0564501137,
          0.0733323619,
          -0.00606258959,
          -0.0584731549,
          -0.023954859,
          -0.0060136239,
          0.063273482,
          -0.0104012415,
          -0.0135551067,
          -0.0525478572,
          -0.0528962649,
          -0.0219644848,
          0.0491818562,
          0.0495538749,
          -0.0270621758,
          0.015894521,
          0.0592762679,
          -0.00606945809,
          0.0131943896,
          -0.0411723927,
          -0.0442203917,
          0.0383249186,
          -0.0490926765,
          0.0584860817,
          -0.0234904885,
          -0.0396008193,
          -0.0536000058,
          -0.0369764268,
          0.05502,
          0.0286366679,
          -0.00418404629,
          -0.00901796296,
          0.0126242898,
          -0.0118383914,
          -0.0496213101,
          0.042022,
          -0.0420732126,
          -0.0681436062,
          0.0253585353,
          -0.0694684312,
          -0.0119766332,
          0.0112458766,
          0.0312901959,
          0.0230002366,
          0.0650403053,
          0.0505360104,
          -0.0357257463,
          -0.0314568281,
          -0.056355767,
          0.0105518019,
          -0.0485326834,
          -0.0594076551,
          -0.051728189,
          -0.0526019894,
          -0.0228245705,
          -0.0565244704,
          -0.0480343401,
          0.0578044951,
          0.0282945354,
          0.0478610359,
          -0.0456137732,
          0.0520697,
          -0.0198127963,
          -0.0553915389,
          0.0229181889,
          0.0246130899,
          0.0106120277,
          0.0302409232,
          0.0294701979,
          -0.00500191189,
          -0.0380597,
          0.0193984136,
          -0.0325400718,
          0.0357697941,
          -0.0305233318,
          0.0487168804,
          0.0561159886,
          0.0469565876,
          -0.06898655,
          0.0459153578,
          0.0503184907,
          0.0417902693,
          0.00452678977,
          -0.0171046034,
          0.0464701,
          -0.00308007374,
          0.0563344173,
          0.0415377282,
          0.0454222858,
          -0.0393262208,
          0.0489546433,
          -0.061284747,
          -0.0332338847,
          0.057354793,
          0.040032696,
          0.0116379401,
          0.0201532431,
          -0.0588172451,
          0.0216286089,
          -0.0453984886,
          -0.0111361872,
          -0.0237037726,
          -0.0292902887,
          0.0826029554,
          0.030566141,
          0.0636654422,
          0.00963955745,
          0.0425403975,
          0.0088356249,
          0.0573563,
          0.0101870885,
          -0.0412759334,
          0.0344471,
          0.0236499365,
          -0.0298895,
          -0.03605856,
          0.0372025557,
          -0.0134380134,
          0.0328386724,
          0.0292973928,
          -0.0275560673,
          -0.0540957078,
          -0.0211234372,
          0.0489976294,
          -0.0135164876,
          0.0260429811,
          -0.0140747735,
          0.0201652944,
          -0.0639544353,
          -0.0659150779,
          0.0119251255,
          -0.0597569048,
          -0.025548609,
          0.0271249563,
          -0.00395410322,
          0.0739077479,
          -0.04055994,
          -0.032501597,
          0.0237828214,
          0.0560824797,
          0.0393396765,
          -0.0467896722,
          -0.0639354,
          0.0599736832,
          -0.00854816474,
          -0.0159245562,
          0.0255280547,
          -0.0398004279,
          0.0364802331,
          -0.027731156,
          0.0258971192,
          -0.00650577853,
          -0.0622730851,
          -0.0495856591,
          -0.00660637207,
          -0.0106730172,
          -0.0446279086,
          0.0714769363,
          0.0362175293,
          0.0445007458,
          0.0459191687,
          -0.0253308844,
          -0.0610454753,
          -0.0412882492,
          -0.0203239135,
          -0.00169323187,
          0.013024372,
          0.046414271,
          -0.0231742989,
          -0.0195769574,
          -0.0621216,
          0.0242237877,
          -0.0183771234,
          -0.00410870975,
          -0.0330339447,
          -0.0093132332,
          0.0753371865,
          0.0405664258,
          -0.022192996,
          0.0378677,
          0.0159325115,
          0.0680899099,
          -0.0504849702,
          0.0033798127,
          0.0297050904,
          0.0602295399,
          -0.0485043339,
          -0.0402776487,
          0.0624307133,
          -0.0180643015,
          -0.024864275,
          0.00865610503,
          0.026766317,
          0.0519257449,
          -0.0245391671,
          -0.0440730117,
          0.0123247383,
          -0.00457520923,
          0.0307077337,
          0.0296754818,
          -0.0181712843,
          0.048472859,
          -0.0651417151,
          -0.0280105229,
          0.046335306,
          0.0612878092,
          -0.022980867,
          -0.047271803,
          -0.0293141734,
          0.0314479321,
          -0.0254883915,
          0.0328758918,
          0.0623733,
          -0.0356789418,
          -0.0406927578,
          -0.0431246497,
          -0.0187452585,
          -0.0509246103,
          -0.0390746817,
          0.0612586327,
          -0.0692583,
          0.0275518335,
          -0.0218725204,
          0.0496322177,
          0.0384523831,
          0.0641991049,
          -0.0360236,
          -0.0108647319,
          0.00840086769,
          0.00408324879,
          -0.0108078513,
          -0.0624398477,
          -0.0307722446,
          0.0333930254,
          -0.0414630771,
          0.0548682883,
          -0.0170015451,
          -0.0239755455,
          0.0488936715,
          -0.0651364625,
          0.00192844716,
          -0.0332600884,
          0.0552323796,
          0.0346730947,
          0.0160323065,
          0.032748092,
          0.0561213344,
          -0.00140851282,
          -0.0202689357,
          0.052888684,
          0.0592282,
          -0.0019813166,
          0.0451461338,
          0.0489935279,
          -0.00650064275,
          0.00987602,
          -0.0662418529,
          -0.0185907315,
          -0.0614122376,
          -0.0205280855,
          -0.0632254481,
          0.0308061317,
          0.0174735952,
          -0.000546333671,
          0.047971569,
          -0.00307222479,
          -0.0717794597,
          -0.0251868609,
          0.0323531851,
          -0.0501762517,
          0.0536947921,
          -0.0154530071,
          0.0594913699,
          -0.0314704068,
          0.039119076,
          0.0452355146,
          -0.037967585,
          -0.0138331782,
          0.0167293344,
          0.0253588166,
          -0.0486182421,
          0.0448644683,
          -0.00144580274,
          -0.0758668333,
          -0.0635708049,
          -0.0387582146,
          -0.0410970636,
          0.00723731518,
          0.0511774272,
          -0.0429867916,
          0.00575230224,
          -0.00193619251,
          -0.00936945621,
          -0.0335999392,
          -0.0383182019,
          -0.00623626029,
          -0.012272154,
          0.0194842406,
          0.0482590497,
          0.0356801227,
          -0.0578145534,
          0.011334734,
          -0.0617630184,
          -0.0514307581,
          -0.0516633391,
          0.0185128842,
          0.0099699311,
          0.0164613854,
          0.0238638408,
          -0.0548572131,
          0.0170137454,
          -0.0393069945,
          0.0154044665,
          0.00652420567,
          -0.0302734748,
          0.0121060284,
          -0.0592684299,
          -0.0304587707,
          -0.0159759019,
          -0.00396192539,
          -0.0379993245,
          -0.0257218126,
          0.0403795131,
          0.05089771,
          0.00726193562,
          0.0154443933,
          -0.0644808784,
          -0.00678105047,
          -0.045393005,
          0.032467097,
          0.0549467169,
          -0.000432468863,
          0.0418119654,
          0.0560976155,
          -0.040325664,
          0.0320227817,
          0.00440904964,
          0.0700718388,
          -0.0496327914,
          0.0451410934,
          0.0549121536,
          -0.0483415313,
          0.0437322296,
          0.0106855016,
          0.014460017,
          0.0319442339,
          0.0200236421,
          0.0667195842,
          -0.0489281751,
          0.0466728434,
          0.00745767215,
          0.0622594394,
          0.0425772667,
          -0.00149822515,
          -0.0511512868,
          -0.0129296118,
          0.0370375067,
          0.0537402928,
          0.0303650852,
          -0.0672792643,
          -0.00379219046,
          -0.0622286946,
          -0.00109637063,
          0.00423666509,
          0.0454407111,
          -0.0439787842,
          -0.00430238433,
          0.00296141021,
          -0.0331925936,
          0.0240145866,
          0.0235994309,
          -0.0430991501,
          0.0387083292,
          -0.0248765666,
          0.0644885525,
          -0.00528525701,
          -0.0641326383,
          0.0332670845,
          -0.00430708053,
          -0.0179106779,
          -0.00187094777,
          0.0142540596,
          0.0434093066,
          -0.0371587276,
          -0.0637439266,
          0.030742459,
          0.00478762388,
          -0.00184948195,
          -0.0362511426,
          0.0066089984,
          -0.0197635591,
          0.0639140606,
          0.0397647694,
          0.068099685,
          0.0609065071,
          0.0296075568,
          -0.0386132114,
          -0.0659719706,
          -0.0446613207,
          0.0372172669,
          -0.0226032268,
          0.0250842553,
          -0.0250043832,
          -0.00651284074,
          -0.0718082,
          -0.0322113521,
          -0.0236154627,
          -0.0330756605,
          0.0479746312,
          0.0216696616,
          -0.0274802782,
          0.058274921,
          0.0120264096,
          0.004017008,
          -0.0317362957,
          0.0150860893,
          0.0481863208,
          -0.0176805314,
          0.0241814107,
          -0.0525851697,
          -0.0287926029,
          0.0530678704,
          -0.00267930538,
          0.0436495915,
          -0.0674983338,
          -0.0280263722,
          -0.00320421229,
          -0.0338123105,
          0.0243981928,
          -0.0846694484,
          0.0696830451,
          0.0134007353,
          0.0220996384,
          0.0254066549,
          -0.00753207225,
          0.0624279305,
          0.00565141253,
          0.0133890491,
          -0.0118761268,
          0.0444949754,
          -0.0112492582,
          0.0404956751,
          0.0369235314,
          0.0348950773,
          0.0661475584,
          -0.0755681917,
          0.031097088,
          -0.0631506816,
          0.0287028849,
          -0.0238313675,
          0.033735361,
          -0.00299134059,
          -0.0634037107,
          0.0432055891,
          0.0362519771,
          -0.0724287778,
          0.0458059758,
          0.0726778,
          -0.0838345364,
          0.045587264,
          0.00558650959,
          -0.0128574213,
          0.00501480559,
          -0.0300955083,
          0.00700531341,
          -0.0265928768,
          0.0163468979,
          0.0436626226,
          -0.0722337887,
          0.0540162325,
          -0.0357921794,
          0.0194859039,
          -0.0193882249,
          -0.0917242616,
          0.023676673,
          -0.0184265375,
          -0.0765213519,
          0.0544256605,
          0.0363131203,
          -0.00542098051,
          0.0379203223,
          -0.0270571746,
          -0.0429173335,
          -0.0366329364,
          -0.0577732027,
          0.043956928,
          0.0385608114,
          0.0397256166,
          -0.0468987562,
          0.00541234715,
          -0.0458637476,
          0.0683419704,
          7.57157759e-05,
          0.0593905114,
          -0.0539237522,
          -0.0277350731,
          0.0268495493,
          0.0389786474,
          -0.0581355207,
          -0.0524468273,
          -0.0335319601,
          0.0742424503,
          -0.0563449897,
          0.0185467321,
          -0.00623569405,
          0.0240281243,
          -0.0389516056,
          -0.0407467037,
          0.0421197787,
          -0.00341663812,
          0.0485776775,
          0.0576034933,
          0.0722452551,
          0.0339564122,
          0.0315349139,
          -0.0184971541,
          0.0483400039,
          -0.0540000051,
          -0.0128398854,
          -0.0262623746,
          -0.0637127608,
          0.0194709301,
          0.00346584572,
          -0.0363544375,
          -0.0340895019,
          -0.000793455052,
          0.0106666964,
          -0.0466976613,
          -0.0185020491,
          0.0510414802,
          -0.0123832831,
          -0.0251194257,
          -0.0236804076,
          -0.0257763416,
          0.0159179438,
          -0.0471750386,
          0.0504993051,
          -0.064151451,
          0.0480167195,
          0.0401522852,
          0.0127825523,
          -0.0161918122,
          -0.0510537401,
          -0.0578925535,
          0.0186848193,
          0.0106749805,
          -0.0100394031,
          -0.00344786607,
          0.0069831931,
          0.0219491553,
          0.0304585453,
          -0.00354709406,
          0.0290662181,
          -0.0222445969,
          -0.0209100898,
          0.0125294505,
          0.00264511,
          0.0364381187,
          0.0637072399,
          -0.0327384286,
          -0.0720778629,
          0.0586403236,
          -0.0670584738,
          0.0418891981,
          0.00377534493,
          0.00104124052,
          0.056091208,
          0.0590563342,
          -0.0621922575,
          0.00421411311,
          0.0714697465,
          0.0127367163,
          0.0600991771,
          0.0461781472,
          0.0248207375,
          -0.0130098518,
          -0.0577942058,
          -0.0619564466,
          0.0242832322,
          -0.043429032,
          0.0449720286,
          -0.0411006436,
          -0.0447406732,
          0.0755915195,
          0.0195162427,
          0.0293943901,
          -0.0591644756,
          0.0393282734,
          0.0173276421,
          -0.0257132147,
          0.0285622664,
          0.0354240723,
          -0.0698667318,
          0.0195711106,
          0.0385093167,
          -0.0509958342,
          -0.0642265081,
          -0.0253342446,
          0.00298893382,
          -0.064746052,
          -0.0304839313,
          0.0612570606,
          0.0149339745,
          -0.00649604527,
          -0.0571354888,
          0.0219461899,
          0.0260714367,
          -0.0260603968,
          0.0328387283,
          -0.010898795,
          0.0403299779,
          -0.0152352583,
          0.0265357625,
          0.0474037565,
          -0.0451956801,
          -0.0257181805,
          -0.032525,
          -0.0440294854,
          0.00771827064,
          0.0518165343,
          0.0412268564,
          -0.0185291823,
          0.0229219589,
          -0.045577459,
          0.0558460578,
          0.00734861707,
          0.0521524362,
          0.0454208739,
          0.00344447698,
          -0.00339738373,
          -0.0499431193,
          0.0309064742,
          -0.0284587592,
          0.0586387254,
          -0.0509704538,
          0.00286595779,
          -0.0260047559,
          -0.0347800031,
          -0.0324296206,
          -0.047142107,
          0.00582856638,
          -0.0414357409,
          -0.0313114263,
          -0.0306942333,
          -0.0636952519,
          0.0469350107,
          -0.0419736281,
          -0.0310994294,
          -0.0333553851,
          -5.38458371e-05,
          0.0394269228,
          0.0224702,
          -0.0127892,
          0.0731444657,
          -0.0373373292,
          -0.0339726545,
          0.0830892101,
          -0.0220254324,
          0.0261518918,
          -0.0415674113,
          0.0397115536,
          0.0888592303,
          0.0688006207,
          -0.0164110605,
          -0.00881641638,
          0.0197515693,
          -0.054701332,
          -0.0121256569,
          -0.0271976,
          0.0339403376,
          -0.0167739596,
          0.0512779504,
          0.0594001748,
          -0.0188360289,
          0.0510667786,
          -0.0121912844,
          0.0523198619,
          -0.0707827881,
          0.0432306044,
          -0.0334580541,
          0.0110851061,
          0.0585138947,
          -0.0605021752,
          -0.0410057157,
          0.0429380536,
          -0.0559276715,
          0.0206191,
          -0.0595154315,
          0.0642539933,
          0.0465246513,
          0.0585337132,
          0.0249735769,
          -0.0132961571,
          0.0274968408,
          0.0374774858,
          0.0213554539,
          0.00787887909,
          -0.00581629574,
          -0.0629342496,
          0.0183719564,
          0.0631831512,
          -0.00997107755,
          0.0104076983,
          -0.0547715761,
          -0.0517215393,
          -0.016493775,
          -0.0314215682,
          0.0633461624,
          -0.00537498854,
          -0.0246358141,
          0.0471062325,
          0.0322155021,
          -0.0388214327,
          0.0168076809,
          -0.0315980576,
          -0.0707349256,
          0.0561671294,
          -0.0383654833,
          -0.0444758609,
          -0.0436577946,
          0.0227214973,
          0.0624735318,
          -0.0431487709,
          -0.0137276789,
          -0.0597721748,
          0.0595737062,
          -0.071162343,
          0.0699263886,
          -0.0322022773,
          -0.06343133,
          0.0271011237,
          -0.013912349,
          0.0263252575,
          -0.00998470839,
          -0.0257978123,
          0.0244931411,
          -0.0452135503,
          -0.052451767,
          0.0245583598,
          -0.0423461534,
          0.0724551901,
          -0.0230920427,
          -0.0160061847,
          0.0444330163,
          0.0278888,
          0.0384508483,
          -0.0199917275,
          0.0161854085,
          0.00814253185,
          0.0777940899,
          0.046120014,
          0.047350686,
          0.0596540533,
          -0.00897968467,
          0.0092452867,
          -0.0616418049,
          -0.0575214624,
          0.0128132813,
          0.0693130866,
          -0.062398307,
          -0.0692301616,
          0.0801697224,
          0.0664281473,
          -0.0112286592,
          -0.0655193552,
          -0.0127390018,
          -0.0519201793,
          -0.0564464107,
          -0.0184287317,
          0.0205453262,
          0.0579186045,
          0.0065300595,
          -0.0629505888,
          0.000298509724,
          0.00728985,
          -0.0544877,
          -0.0435462631,
          -0.0114289355,
          0.0641335472,
          -0.0479518697,
          0.00611224771,
          -0.0479808114,
          0.032308232,
          0.050831,
          -0.059631478,
          -0.00579696894,
          -0.049434673,
          0.0656607226,
          -0.026808463,
          -0.0599633306,
          0.0532222129,
          -0.0254930314,
          -0.0214720685,
          0.0336707421,
          -0.00218878943,
          0.0342092812,
          0.0462636948,
          -0.00782245677,
          0.0314665772,
          -0.000894678291,
          0.0233172402,
          0.00010985788,
          0.058327511,
          -0.0187524166,
          0.0351793244,
          0.0328173377,
          -0.0361751914,
          -0.0836850107,
          0.0055115032,
          -0.0680054054,
          0.0341261066,
          -0.0404873267,
          0.0495783463,
          0.0473067425,
          0.00468829973,
          -0.0129652526,
          0.0251959693,
          -0.0126526598,
          -0.0669147074,
          0.00232553622,
          0.0643038079,
          0.0169169921,
          -0.0487838611,
          0.0376522914,
          -0.00489780866,
          0.0669582188,
          -0.026398344,
          0.00581643544,
          -0.00978759676,
          -0.0390260071,
          -0.0357910171,
          -0.000407611777,
          -0.0514564812,
          0.0274514593,
          0.0341332331,
          -0.04662944,
          -0.0277312528,
          -0.00172547204,
          0.0119321588,
          0.00168086973,
          0.0540852584,
          0.0666752681,
          -0.0645507425,
          -0.0484686717,
          0.0535792038,
          -0.0799782276,
          -0.00681844912,
          -0.0486093275,
          -0.0687068,
          0.00305491756,
          -0.0285174176,
          0.0260191988,
          -0.00737121655,
          0.0273858551,
          0.0593468696,
          0.0196758322,
          0.0573980361,
          0.00828895718,
          -0.00318673439,
          -0.0178423487,
          0.0670765042,
          -0.00540815061,
          0.0304389261,
          -0.0263162367,
          -0.0533391722,
          0.0396025218,
          -0.0602785647,
          0.0372752,
          -0.0457365103,
          -0.0350106545,
          -0.0353067964,
          0.0615416653,
          -0.00813364,
          -0.0379823856,
          -0.0364097394,
          0.063159056,
          0.0081813978,
          -0.0570976958,
          -0.0349008329,
          -0.00678427797,
          0.0254576318,
          -0.0392933413,
          0.0135501726,
          0.0335694663,
          0.0726459697,
          0.042563647,
          0.0237744879,
          -0.0458693951,
          0.057474751,
          0.0164521839,
          0.0360293128,
          0.0262590814,
          -0.0586194843,
          -0.0202384554,
          -0.00467486447,
          -0.0162970349,
          0.0207660738,
          0.0188808683,
          0.0378734395,
          0.0630922168,
          -0.0579999611,
          -0.0142219272,
          0.0322005339,
          -0.0010931358,
          -0.067520082,
          0.05315594,
          -0.0365979,
          -0.0632030293,
          -0.00592485489,
          -0.0675996,
          -0.0322204679,
          -0.0341628827,
          -0.0545302145,
          0.0410052501,
          0.0573031269,
          -0.0703286305,
          0.0649336129,
          0.0261503216,
          0.0264791399,
          0.00451814849,
          0.0455359146,
          0.073424615,
          0.0185195,
          -0.0639851689,
          -0.000136183196,
          0.00890141726,
          -0.0431358963,
          -0.0404989421,
          -0.00318632345,
          -0.0219662469,
          -0.0090186391,
          0.0248922557,
          0.0382570922,
          0.0122633325,
          0.00582230417,
          0.0106810471,
          -0.0147141488,
          -0.0517852455,
          0.0696542,
          -0.0589806885,
          -0.0286110807,
          -0.00937133748,
          0.0337556303,
          0.0414721519,
          0.0549242,
          0.0512514524,
          -0.0471104793,
          0.0282357093,
          -0.00908001512,
          -0.0418457165,
          0.0233877376,
          0.0560737103,
          0.0191624425,
          -0.0262098145,
          0.0443880521,
          0.0540313497,
          -0.0501321927,
          0.0387830064,
          -0.00184606388,
          0.0706428364,
          -0.0324916,
          0.00503138872,
          -0.0357115418,
          -1.67337075e-05,
          -0.0765489042,
          -0.0400821865,
          0.0479580574,
          -0.0224465672,
          -0.00250488264,
          0.00693094032,
          0.0253934041,
          -0.0445939824,
          0.0472849086,
          -0.0487575643,
          0.0237441305,
          -0.00345751317,
          -0.0497699268,
          -0.0207833461,
          0.0437190421,
          0.0625889748,
          0.0344835259,
          -0.0595050193,
          0.0670263469,
          -0.029359905,
          0.0581833795,
          -0.00911655091,
          -0.0577234328,
          -0.0525684357,
          -0.0185973253,
          -0.0411220752,
          0.023496706,
          0.0600762181,
          -0.00357097038,
          -0.0170212723,
          0.0269429591,
          -0.021353228,
          -0.0166938342,
          0.0105358614,
          0.0291647483,
          0.00917439722,
          -0.016458977,
          -0.046973031,
          -0.011509452,
          0.0248684436,
          -0.028451629,
          -0.0574409962,
          0.0407450125,
          0.00181143964,
          -0.067276746,
          0.0613646246,
          -0.0118457312,
          0.0421936847,
          -0.00854620524,
          -0.00242894725,
          0.0327684768,
          -0.0298749153,
          -0.0610047355,
          0.00192897441,
          0.0312451851,
          0.0186906978,
          0.0460654646,
          0.0332513489,
          -0.0373622738,
          0.0166148487,
          0.0486237407,
          -0.0205623209,
          -0.0487161241,
          -0.0478331484,
          -0.0678043813,
          0.0156566184,
          0.0225910023,
          -0.0458253324,
          0.049069237,
          -0.0382726453,
          0.0244731,
          -0.0329355374,
          -0.033132825,
          0.0417267904,
          -0.0054366719,
          -0.0345088728,
          1.98881498e-05,
          0.0201427396,
          -0.0591345,
          -0.00549767632,
          0.0112408241,
          0.0575410575,
          0.0451980494,
          0.0706167147,
          -0.0531345233,
          0.0373814516,
          -0.00549101317,
          -0.0599133596,
          0.0044269627,
          0.0423494317,
          -0.0554406494,
          0.0504974127,
          0.042711962,
          -0.0632455349,
          0.0395364389,
          0.0437067859,
          -0.0533974804,
          0.00615605898,
          -0.076676093,
          0.0149957156,
          0.0416237749,
          0.0356022902,
          0.0508918799,
          0.0074704,
          -0.0112732463,
          0.0332448967,
          -0.00970086921,
          0.0326243453,
          -0.00113549037,
          0.0411282927,
          -0.0238791499,
          0.0420091413,
          0.0428862,
          0.0372851938,
          -0.00295609352,
          0.0442406237,
          0.000238900684,
          0.047839243,
          0.0497071184,
          -0.0366242528,
          0.00797202252,
          -0.0151570719,
          -0.0497718044,
          0.0306299515,
          -0.0457704216,
          0.058554925,
          0.00781838782,
          0.000169714156,
          0.0626604259,
          -0.0160952043,
          -0.0356054157,
          -0.0100130616,
          0.0592208132,
          0.0128985178,
          -0.0237979833,
          0.0462401472,
          -0.0441071726,
          -0.0734257326,
          -0.0723509267,
          -0.0173399691,
          0.0548158474,
          -0.0621932112,
          0.0344823822,
          0.0512035526,
          -0.0746263564,
          -0.0820790231,
          0.0245073382,
          -0.0632780418,
          0.0123019163,
          -0.0710130855,
          0.00542652421,
          0.00837024581,
          -0.0338826254,
          -0.0201066,
          0.0329899453,
          -0.0445281155,
          0.0669012368,
          -0.0382354632,
          -0.0375230946,
          -0.0285669714,
          -0.0496533588,
          0.0496542268,
          -0.0640513673,
          -0.0483161435,
          -0.052039966,
          0.0108010648,
          0.00365802343,
          0.0563289113,
          0.0354518853,
          0.0798372552,
          0.0513515249,
          -0.0505204275,
          -0.0301540457,
          0.0389242433,
          -0.059625417,
          -0.0239786878,
          0.0461308062,
          -0.00888956711,
          0.0477731787,
          -0.0182824116,
          0.0593685731,
          -0.0163624678,
          -0.0620594,
          0.0384703,
          -0.0415724777,
          0.0567747131,
          -0.00726536615,
          0.0195280463,
          0.00290966174,
          0.0592158027,
          -0.025639914,
          0.0109991496,
          0.00818780903,
          0.0217472259,
          0.065518409,
          0.0148180081,
          0.0243399497,
          -0.0140003273,
          0.0426865593,
          0.0651751086,
          -0.0337860286,
          -0.00896924734,
          -0.0498191603,
          -0.0468542427,
          0.0234373342,
          -0.033077646,
          0.0203352664,
          -0.0652755946,
          -0.0468105078,
          -0.0312970169,
          0.0284664538,
          9.41512189e-05,
          0.047536891,
          -0.0587740093,
          0.00574186025,
          0.0528688803,
          -0.0548188686,
          -0.0187736768,
          0.0530766137,
          0.0427023619,
          -0.0670190454,
          -0.0383338854,
          -0.0234386493,
          0.0476988517,
          0.01805849,
          -0.0347873531,
          0.0154459113,
          0.0427619629,
          0.0323199891,
          -0.0726777092,
          0.013568176,
          -0.00696689682,
          -0.0557760075,
          0.00544620212,
          -0.00472362945,
          -0.0529657975,
          -0.0142817786,
          -0.0199258346,
          0.0576739125,
          -0.0647257343,
          0.0436346866,
          -0.027850559,
          0.0374258384,
          -0.0236912984,
          -0.0258033369,
          0.0575078614,
          -0.0481997654,
          0.0427882,
          0.0226871949,
          -0.0492782071,
          0.00168223667,
          0.00733732851,
          0.0243380927,
          0.0392819308,
          0.0401785299,
          0.046976205,
          0.0427445956,
          0.00055367616,
          0.0482462235,
          -0.06514249,
          0.0066402345,
          -0.0236576349,
          0.0195717085,
          0.025362473,
          -0.0130013051,
          -0.0562309064,
          -0.0211107954,
          -0.0208867453,
          0.0141424714,
          -0.0253689904,
          -0.017032383,
          0.0610505641,
          -0.0348388329,
          -0.0795806125,
          -0.032785736,
          0.0440053828,
          -0.00359950378,
          0.0265444331,
          -0.0483698584,
          0.00255839154,
          0.031821169,
          0.0662504807,
          -0.0364244878,
          0.0392117724,
          -0.0155509925,
          -0.0162758101,
          0.0470897742,
          -0.046301946,
          0.0128794294,
          0.018885944,
          -0.0618363582,
          0.0638509765,
          -0.0588219315,
          0.0309881605,
          0.00324322563,
          0.0130213276,
          -0.0643869117,
          0.0764804631,
          -0.0146652786,
          -0.0535000935,
          -0.016476756,
          -0.0693949237,
          -0.0567257367,
          0.0678056777,
          0.0724952519,
          0.0501614287,
          0.0112519721,
          0.0558591262,
          -0.0111544142,
          -0.0549930036,
          -0.0482324325,
          0.0272885673,
          -0.0637274161,
          0.0443919972,
          0.00629055034,
          -0.0247866269,
          -0.036580395,
          0.0717903823,
          -0.0232828818,
          -0.0293194074,
          0.0485323,
          0.0369520709,
          -0.0714782,
          -0.0364641957,
          -0.0344167612,
          0.0517846569,
          -0.0480708443,
          -0.0155370943,
          -0.00429022266,
          0.0590809062,
          -0.0324510559,
          -0.00290005933,
          0.0529869646,
          -0.066132091,
          -0.0368660428,
          -0.0253358874,
          -0.0355294161,
          0.0364518128,
          0.0387217365,
          -0.0197329558,
          -0.0651972,
          0.012179737,
          0.0132701248,
          0.049695354,
          0.0381303467,
          0.0730907395,
          -0.0218729,
          -0.0306605566,
          -0.0524425469,
          -0.0446001031,
          0.0296789873,
          0.0608857758,
          0.053458266,
          -0.0414299071,
          -0.0554590262,
          -0.048109021,
          -0.0639549866,
          -0.0338551588,
          -0.0843310133,
          0.030943634,
          0.0253964178,
          -0.0803188,
          0.0453743413,
          0.0184550844,
          -0.0711736232,
          0.0530280173,
          -0.0435490422,
          0.0593696348,
          -0.0175115019,
          0.0477887355,
          -0.0119116502,
          -0.0474962145,
          0.066144608,
          0.0287839789,
          0.0588181131,
          0.0627275631,
          0.0301333368,
          0.0590180084,
          0.0360535346,
          -0.0168055147,
          0.00960673671,
          -0.02581181,
          0.0061208182,
          -0.0227822699,
          0.0624169484,
          -0.0563864857,
          0.0584956482,
          0.0538341738,
          -0.0579269566,
          0.0472601429,
          0.0229802504,
          0.0325698443,
          0.0559909083,
          0.0077535864,
          -0.0351276286,
          -0.00952862855,
          0.0434086248,
          0.0149830123,
          0.00219841208,
          -0.0184205156,
          -0.0667543113,
          -0.0484562181,
          -0.0133556332,
          0.0496767908,
          0.0179259609,
          0.0370207317,
          -0.0349690318,
          -0.0369656198,
          0.0226096418,
          -0.0221600309,
          -0.0376749448,
          -0.0177574884,
          -0.00856459327,
          0.0642920062,
          0.0480056442,
          0.0656646416,
          0.0286404025,
          -0.0160107594,
          0.0198833086,
          -0.032898169,
          -0.000384297949,
          0.00402223319,
          -0.0301326979,
          0.0103227654,
          -0.0737282783,
          0.0675013959,
          -0.0472323895,
          -0.0073561375,
          0.0039102938,
          0.0555739105,
          0.0012242886,
          0.0314232744,
          -0.0253602285,
          0.0136979958,
          0.0451935232,
          -0.0246015191,
          0.00729789166,
          -0.0295720398,
          -0.0522704124,
          -0.0407903977,
          -0.0183146708,
          -0.0212722886,
          0.0234641973,
          0.0447958075,
          -0.0342654735,
          -0.0532667,
          0.039053686,
          -0.0409611166,
          0.0401877128,
          -0.0340136513,
          0.0544910505,
          -0.021530252,
          -0.00749030383,
          -0.0727216899,
          -0.0399958156,
          0.0217341129,
          -0.00544326473,
          -0.00961847696,
          0.0930640772,
          -0.0224119928,
          -0.0583351478,
          -0.00261901086,
          0.0506915711,
          0.0334071033,
          0.0329060592,
          -0.0202174112,
          0.00641278829,
          -0.0478625968,
          0.0623978153,
          0.0118181249,
          -0.0171079691,
          0.0591800623,
          -0.0312615,
          -0.052833207,
          0.0478251949,
          0.034762647,
          -0.0414093025,
          -0.0448232628,
          0.00863632374,
          0.0108103715,
          -0.0129902782,
          -0.0534719601,
          -0.0319557,
          0.0283028483,
          -0.0108426549,
          -0.0345613435,
          0.0471811034,
          -0.0271223355,
          0.0432263911,
          -0.0178953614,
          -0.0569784716,
          -0.0368846729,
          0.00365489814,
          0.0674639791,
          0.0536974259,
          -0.00169583876,
          -0.0444053411,
          -0.00301305065,
          0.0393337533,
          0.0238107257,
          -0.0507057421,
          0.0442952141,
          0.0319829583,
          -0.00614389358,
          0.0303333327,
          0.026620768,
          -0.0100338319,
          -0.018778177,
          0.000695051567,
          0.00359877874,
          0.0246407501,
          0.0225619,
          -0.0636497512,
          -0.0130474987,
          0.0126582161,
          -0.0127981482,
          -0.0355477929,
          -0.0128199244,
          0.0198321082,
          -0.00562242279,
          -0.0727257207,
          -0.0665110499,
          -0.0683475956,
          0.00455610733,
          -0.00234927377,
          -0.0139894187,
          -0.0226876661,
          0.0361321718,
          0.0210579187,
          0.0249217506,
          -0.00046846288,
          0.0180730149,
          -0.0541839488,
          0.0554079153,
