{
 "irVersion": "6",
 "opsetImport": [],
 "producerName": "tenncor",
 "producerVersion": "1.0.0",
 "domain": "com.tenncor.eteq",
 "modelVersion": "6",
 "docString": "",
 "graph": {
  "node": [
   {
    "input": [
     "_i0"
    ],
    "output": [
     "_r0"
    ],
    "name": "_r0",
    "opType": "_DENSE_LAYER",
    "domain": "",
    "attribute": [
     {
      "name": "layer",
      "refAttrName": "",
      "docString": "",
      "type": "GRAPH",
      "f": 0,
      "i": "0",
      "s": "",
      "g": {
       "node": [
        {
         "input": [
          "_i0",
          "1"
         ],
         "output": [
          "2"
         ],
         "name": "2",
         "opType": "MATMUL",
         "domain": "",
         "attribute": [
          {
           "name": "rank_pairs",
           "refAttrName": "",
           "docString": "",
           "type": "INTS",
           "f": 0,
           "i": "0",
           "s": "",
           "floats": [],
           "ints": [
            "0",
            "1"
           ],
           "strings": [],
           "tensors": [],
           "graphs": [],
           "sparseTensors": []
          }
         ],
         "docString": ""
        },
        {
         "input": [
          "3"
         ],
         "output": [
          "4"
         ],
         "name": "4",
         "opType": "EXTEND",
         "domain": "",
         "attribute": [
          {
           "name": "tensor",
           "refAttrName": "",
           "docString": "",
           "type": "TENSOR",
           "f": 0,
           "i": "0",
           "s": "",
           "t": {
            "dims": [],
            "dataType": 0,
            "floatData": [],
            "int32Data": [],
            "stringData": [],
            "int64Data": [],
            "name": "2",
            "docString": "",
            "rawData": "",
            "externalData": [],
            "dataLocation": "DEFAULT",
            "doubleData": [],
            "uint64Data": []
           },
           "floats": [],
           "ints": [],
           "strings": [],
           "tensors": [],
           "graphs": [],
           "sparseTensors": []
          }
         ],
         "docString": ""
        },
        {
         "input": [
          "2",
          "4"
         ],
         "output": [
          "_r0"
         ],
         "name": "_r0",
         "opType": "ADD",
         "domain": "",
         "attribute": [],
         "docString": ""
        }
       ],
       "name": "",
       "initializer": [
        {
         "dims": [
          "64",
          "784",
          "1",
          "1",
          "1",
          "1",
          "1",
          "1"
         ],
         "dataType": 1,
         "floatData": [
          -0.263774782,
          -0.24663642,
          -0.180141538,
          -0.0838450566,
          -0.0858203322,
          -0.233330563,
          -0.163957849,
          -0.180605575,
          -0.23332265,
          -0.14467521,
          -0.224134505,
          -0.18595539,
          -0.183820158,
          -0.0628089383,
          -0.0945097357,
          -0.181206927,
          -0.0779435858,
          -0.0704073831,
          -0.134063572,
          -0.0569143519,
          -0.196477562,
          -0.18204537,
          -0.117674515,
          -0.123413965,
          -0.0634625554,
          -0.0484758355,
          -0.216528669,
          -0.153464407,
          -0.104856335,
          -0.171585247,
          -0.105698,
          -0.190286249,
          -0.231140897,
          -0.156521738,
          -0.210884228,
          -0.101578668,
          -0.105960347,
          -0.181150436,
          -0.163030088,
          -0.235798046,
          -0.171744764,
          -0.201572761,
          -0.122750826,
          -0.089367196,
          -0.203550264,
          -0.10826014,
          -0.258714527,
          -0.242220178,
          -0.229320124,
          -0.136090696,
          -0.260549933,
          -0.201903164,
          -0.17568481,
          -0.177951947,
          -0.102139607,
          -0.192271069,
          -0.191953644,
          -0.205420241,
          -0.0724174827,
          -0.0922278538,
          -0.174300879,
          -0.203198045,
          -0.158540636,
          -0.168702826,
          -0.165248677,
          -0.222216025,
          -0.243326619,
          -0.186263621,
          -0.14944905,
          -0.237112164,
          -0.142608717,
          -0.15263997,
          -0.165792793,
          -0.131549329,
          -0.20781754,
          -0.255481333,
          -0.130583912,
          -0.118117079,
          -0.146882132,
          -0.215290427,
          -0.047061339,
          -0.0572176874,
          -0.208963856,
          -0.0605690256,
          -0.126857489,
          -0.122423276,
          -0.155197412,
          -0.111158244,
          -0.172373042,
          -0.148362681,
          -0.0973687,
          -0.185257897,
          -0.0920871347,
          -0.158599466,
          -0.209207669,
          -0.196416944,
          -0.199639842,
          -0.202286065,
          -0.155672222,
          -0.111494929,
          -0.180248097,
          -0.224870428,
          -0.224964634,
          -0.0864042118,
          -0.173608825,
          -0.255865335,
          -0.114163853,
          -0.0868542716,
          -0.183362693,
          -0.137166813,
          -0.25070855,
          -0.222330123,
          -0.212540776,
          -0.145092294,
          -0.239578158,
          -0.113211073,
          -0.231796205,
          -0.147592261,
          -0.165321946,
          -0.112212986,
          -0.236236185,
          -0.222526819,
          -0.144676149,
          -0.111614302,
          -0.189348415,
          -0.075528115,
          -0.16431132,
          -0.078261748,
          -0.148293674,
          -0.203862816,
          -0.163815871,
          -0.139025435,
          -0.114284828,
          -0.243779823,
          -0.145351559,
          -0.117825843,
          -0.135391384,
          -0.120082147,
          -0.115547404,
          -0.161661118,
          -0.206369191,
          -0.190526932,
          -0.160081193,
          -0.180598795,
          -0.0899861753,
          -0.185531273,
          -0.155462071,
          -0.124359556,
          -0.101375028,
          -0.170335427,
          -0.128932372,
          -0.1733495,
          -0.0764249042,
          -0.0379426889,
          -0.241480455,
          -0.162790209,
          -0.22280167,
          -0.141858414,
          -0.171077415,
          -0.214107737,
          -0.143654957,
          -0.226871625,
          -0.253441,
          -0.0939693749,
          -0.14124468,
          -0.113178223,
          -0.16996491,
          -0.253698438,
          -0.154085711,
          -0.246559799,
          -0.122574367,
          -0.213326842,
          -0.143234834,
          -0.143966779,
          -0.244289324,
          -0.193491548,
          -0.142795,
          -0.215229437,
          -0.218700454,
          -0.174610808,
          -0.172838509,
          -0.123298585,
          -0.183538243,
          -0.115592502,
          -0.221520036,
          -0.132154584,
          -0.21084097,
          -0.247514442,
          -0.126818359,
          -0.130198851,
          -0.134559035,
          -0.208512366,
          -0.237858176,
          -0.108560048,
          -0.250387549,
          -0.0648031831,
          -0.178327739,
          -0.216816336,
          -0.101867564,
          -0.173047796,
          -0.126866043,
          -0.152275547,
          -0.0712564811,
          -0.148424968,
          -0.233929396,
          -0.0413787439,
          -0.0773432,
          -0.247480378,
          -0.132022098,
          -0.0930635184,
          -0.119094416,
          -0.0640988946,
          -0.108811781,
          -0.205610797,
          -0.203606695,
          -0.125768304,
          -0.172907427,
          -0.149321452,
          -0.128450826,
          -0.217792183,
          -0.201673105,
          -0.139425173,
          -0.186453953,
          -0.223004371,
          -0.179590136,
          -0.184779555,
          -0.141418159,
          -0.127963752,
          -0.0781122,
          -0.220908672,
          -0.173411548,
          -0.224233434,
          -0.202637926,
          -0.15016821,
          -0.0651384667,
          -0.0880110487,
          -0.223991111,
          -0.203833818,
          -0.215964377,
          -0.184209034,
          -0.209242776,
          -0.209533513,
          -0.22224234,
          -0.0626231432,
          -0.210131645,
          -0.148454234,
          -0.0626747385,
          -0.0909426659,
          -0.174447551,
          -0.252638817,
          -0.197649211,
          -0.214995265,
          -0.143289298,
          -0.221331298,
          -0.225242287,
          -0.143050939,
          -0.175926849,
          -0.18397,
          -0.267480761,
          -0.201094851,
          -0.18890442,
          -0.219275028,
          -0.129956603,
          -0.164245799,
          -0.134223014,
          -0.141692027,
          -0.0760817751,
          -0.24071075,
          -0.243635967,
          -0.161744237,
          -0.0245113242,
          -0.188753545,
          -0.0912164077,
          -0.203220427,
          -0.114602357,
          -0.08932852,
          -0.20133324,
          -0.163343608,
          -0.0967704579,
          -0.160484731,
          -0.109265245,
          -0.200365186,
          -0.0792393908,
          -0.127002597,
          -0.132970572,
          -0.170453548,
          -0.193354085,
          -0.140765771,
          -0.147549868,
          -0.076887317,
          -0.196779624,
          -0.123794645,
          -0.0595483631,
          -0.112355992,
          -0.231347814,
          -0.187652841,
          -0.205262661,
          -0.21655561,
          -0.135231584,
          -0.115808718,
          -0.254536033,
          -0.154353589,
          -0.170197695,
          -0.194520429,
          -0.19750452,
          -0.158851638,
          -0.233967826,
          -0.0997256339,
          -0.264265329,
          -0.258478016,
          -0.149691194,
          -0.118865237,
          -0.100327797,
          -0.267666578,
          -0.139364749,
          -0.162216008,
          -0.212112308,
          -0.0669195503,
          -0.174316615,
          -0.151362479,
          -0.161827043,
          -0.164684251,
          -0.21922186,
          -0.108497344,
          -0.208791569,
          -0.131497324,
          -0.141065508,
          -0.0928301215,
          -0.128242925,
          -0.136442766,
          -0.108967014,
          -0.225930214,
          -0.144970432,
          -0.165420443,
          -0.0587586761,
          -0.214306936,
          -0.202896327,
          -0.191349193,
          -0.122970372,
          -0.170474574,
          -0.1446217,
          -0.147145763,
          -0.232281044,
          -0.0918430835,
          -0.176071659,
          -0.0651415437,
          -0.171803117,
          -0.275399387,
          -0.210348606,
          -0.144922525,
          -0.108078636,
          -0.186734244,
          -0.16999945,
          -0.181348458,
          -0.171117306,
          -0.114136033,
          -0.19567351,
          -0.129218221,
          -0.171169326,
          -0.11534372,
          -0.114842132,
          -0.187100813,
          -0.146733761,
          -0.193146616,
          -0.215571806,
          -0.119331226,
          -0.245697021,
          -0.159760669,
          -0.174027935,
          -0.13862507,
          -0.160059139,
          -0.108995639,
          -0.206623346,
          -0.205094874,
          -0.0882709473,
          -0.229139671,
          -0.257066667,
          -0.228732124,
          -0.189188153,
          -0.107051924,
          -0.201170892,
          -0.115461022,
          -0.238390028,
          -0.107541092,
          -0.193871975,
          -0.140750051,
          -0.218837306,
          -0.114056982,
          -0.0745520517,
          -0.0920577794,
          -0.198824495,
          -0.12854974,
          -0.263686121,
          -0.172698274,
          -0.165986374,
          -0.16509667,
          -0.26058647,
          -0.157172084,
          -0.151758924,
          -0.221428603,
          -0.134675846,
          -0.0722334757,
          -0.0864463449,
          -0.184722275,
          -0.114908144,
          -0.164019242,
          -0.180832177,
          -0.157173172,
          -0.17286092,
          -0.104219906,
          -0.125470191,
          -0.269893706,
          -0.16790849,
          -0.188806802,
          -0.127483636,
          -0.235565633,
          -0.170539021,
          -0.0632093474,
          -0.122162819,
          -0.0524290465,
          -0.143170506,
          -0.258805364,
          -0.193322077,
          -0.1736577,
          -0.108479783,
          -0.202147052,
          -0.136692539,
          -0.189206883,
          -0.262446463,
          -0.162481561,
          -0.126222819,
          -0.133736372,
          -0.212269098,
          -0.152795509,
          -0.12592119,
          -0.153761014,
          -0.179157734,
          -0.2439266,
          -0.180431843,
          -0.111259475,
          -0.23310034,
          -0.121396139,
          -0.158082709,
          -0.214213431,
          -0.242612481,
          -0.184663206,
          -0.128599569,
          -0.0977865756,
          -0.181100726,
          -0.174942195,
          -0.178948388,
          -0.157051921,
          -0.219454795,
          -0.133610472,
          -0.204274252,
          -0.238321856,
          -0.16288209,
          -0.252888292,
          -0.172425047,
          -0.183217406,
          -0.165830225,
          -0.0845390186,
          -0.0227309577,
          -0.118120715,
          -0.174347743,
          -0.18735683,
          -0.230764046,
          -0.110405177,
          -0.208066732,
          -0.233133,
          -0.241509438,
          -0.200139776,
          -0.162826151,
          -0.184177414,
          -0.221474528,
          -0.149555266,
          -0.13369599,
          -0.0618268102,
          -0.238260373,
          -0.107244611,
          -0.214888349,
          -0.213164076,
          -0.154796928,
          -0.108372189,
          -0.117704466,
          -0.141193584,
          -0.136535212,
          -0.17377311,
          -0.240478218,
          -0.162201628,
          -0.174883693,
          -0.102264263,
          -0.236709192,
          -0.0828610361,
          -0.116969645,
          -0.125994578,
          -0.266974866,
          -0.1256762,
          -0.137010023,
          -0.0838387311,
          -0.196227312,
          -0.206939727,
          -0.067854695,
          -0.155452192,
          -0.112710148,
          -0.147411749,
          -0.0759831592,
          -0.213592619,
          -0.118264943,
          -0.220250621,
          -0.233366534,
          -0.0673862919,
          -0.124945559,
          -0.152287409,
          -0.172772,
          -0.207274422,
          -0.124450795,
          -0.226293176,
          -0.16439122,
          -0.187156036,
          -0.222865269,
          -0.0929597244,
          -0.114590883,
          -0.115160279,
          -0.188395932,
          -0.0498333424,
          -0.0806601048,
          -0.113923877,
          -0.111530185,
          -0.192835942,
          -0.125315264,
          -0.100201674,
          -0.183588684,
          -0.203599602,
          -0.135605589,
          -0.154851139,
          -0.079431057,
          -0.0815160871,
          -0.188242123,
          -0.278260291,
          -0.185492098,
          -0.0657403,
          -0.193908796,
          -0.136040986,
          -0.206554368,
          -0.11985416,
          -0.265897274,
          -0.219701633,
          -0.118508287,
          -0.251643956,
          -0.201681569,
          -0.128951624,
          -0.190844,
          -0.105626963,
          -0.172261283,
          -0.172642261,
          -0.172995239,
          -0.0721446499,
          -0.133143008,
          -0.240727067,
          -0.254373163,
          -0.102957271,
          -0.200821266,
          -0.158066213,
          -0.160886541,
          -0.236244321,
          -0.0852144212,
          -0.188655794,
          -0.147288114,
          -0.200301766,
          -0.205197468,
          -0.219854295,
          -0.177955925,
          -0.153545126,
          -0.245541766,
          -0.0497145317,
          -0.138061345,
          -0.1139296,
          -0.137001917,
          -0.168244705,
          -0.227200955,
          -0.226696774,
          -0.181620032,
          -0.157874808,
          -0.173155278,
          -0.117154561,
          -0.179335505,
          -0.216820017,
          -0.262593508,
          -0.0782639533,
          -0.122178897,
          -0.181391984,
          -0.172805905,
          -0.161147892,
          -0.0812057555,
          -0.081165053,
          -0.182456613,
          -0.11391665,
          -0.158893228,
          -0.0621362776,
          -0.192594782,
          -0.11265938,
          -0.124662086,
          -0.13771145,
          -0.21917,
          -0.176976874,
          -0.105126224,
          -0.192570969,
          -0.218399271,
          -0.14210543,
          -0.149440303,
          -0.0728281066,
          -0.160703018,
          -0.230858609,
          -0.154978156,
          -0.167176649,
          -0.154964313,
          -0.143687695,
          -0.15006794,
          -0.0849939212,
          -0.270787388,
          -0.17764096,
          -0.126929417,
          -0.110430211,
          -0.211919129,
          -0.234449938,
          -0.222713277,
          -0.102159798,
          -0.219908118,
          -0.144906193,
          -0.0528294258,
          -0.195041269,
          -0.228713155,
          -0.237224787,
          -0.151699454,
          -0.230856508,
          -0.224646583,
          -0.073874183,
          -0.268747956,
          -0.102045581,
          -0.203441262,
          -0.102772221,
          -0.152315289,
          -0.0684507936,
          -0.193224773,
          -0.187991753,
          -0.143690601,
          -0.149288982,
          -0.209048465,
          -0.238248348,
          -0.180958,
          -0.160724521,
          -0.244793728,
          -0.0439098,
          -0.133098811,
          -0.196310684,
          -0.0724864826,
          -0.224624217,
          -0.15916343,
          -0.168435454,
          -0.0984972864,
          -0.117532097,
          -0.160184011,
          -0.0972508565,
          -0.0504598133,
          -0.124274321,
          -0.187886357,
          -0.156240791,
          -0.10009665,
          -0.145133033,
          -0.121393092,
          -0.10459777,
          -0.203720361,
          -0.139628708,
          -0.273147017,
          -0.174983084,
          -0.207977578,
          -0.206211656,
          -0.250160784,
          -0.133104131,
          -0.170137763,
          -0.187220588,
          -0.070852533,
          -0.151285112,
          -0.282801956,
          -0.177921399,
          -0.148688987,
          -0.247464463,
          -0.124173224,
          -0.190444246,
          -0.121807531,
          -0.178675741,
          -0.140066072,
          -0.138501018,
          -0.179880545,
          -0.164244696,
          -0.161988676,
          -0.155854419,
          -0.19248648,
          -0.11906343,
          -0.182808772,
          -0.225673825,
          -0.263266712,
          -0.182230517,
          -0.229450509,
          -0.156650737,
          -0.133935481,
          -0.191829488,
          -0.142913908,
          -0.1901436,
          -0.164155692,
          -0.197660968,
          -0.233937413,
          -0.178044185,
          -0.175698742,
          -0.170076892,
          -0.132922336,
          -0.0668060631,
          -0.171304762,
          -0.164415,
          -0.20500353,
          -0.209912598,
          -0.225623608,
          -0.102013133,
          -0.139834851,
          -0.139569134,
          -0.149109393,
          -0.204299867,
          -0.107394062,
          -0.170647502,
          -0.141473264,
          -0.200739309,
          -0.201320186,
          -0.117661439,
          -0.250838131,
          -0.208823413,
          -0.209515229,
          -0.160996303,
          -0.233503059,
          -0.171393305,
          -0.0927148089,
          -0.112186596,
          -0.153706536,
          -0.142828748,
          -0.264785558,
          -0.191662908,
          -0.191455096,
          -0.105676383,
          -0.133260339,
          -0.142344952,
          -0.132369712,
          -0.115982048,
          -0.235421702,
          -0.136498168,
          -0.192675933,
          -0.0581692234,
          -0.24973467,
          -0.134767443,
          -0.0655075833,
          -0.210312605,
          -0.124686778,
          -0.175414965,
          -0.114820205,
          -0.139657363,
          -0.156834736,
          -0.0698225573,
          -0.240249008,
          -0.0813278183,
          -0.161380917,
          -0.089579463,
          -0.144301057,
          -0.14451693,
          -0.216851443,
          -0.189490929,
          -0.10556405,
          -0.0961915255,
          -0.157287076,
          -0.254221469,
          -0.155237406,
          -0.268664092,
          -0.199835092,
          -0.102378517,
          -0.048270449,
          -0.225452334,
          -0.135373592,
          -0.141246319,
          -0.202144399,
          -0.103663251,
          -0.127658859,
          -0.213577688,
          -0.132221,
          -0.174441263,
          -0.0483919792,
          -0.11900501,
          -0.23329775,
          -0.174135849,
          -0.16468133,
          -0.152796805,
          -0.178037077,
          -0.151275948,
          -0.141650319,
          -0.188880429,
          -0.257946342,
          -0.104760513,
          -0.126326948,
          -0.179694757,
          -0.21631135,
          -0.152968869,
          -0.2106262,
          -0.112356938,
          -0.0822263733,
          -0.0663657859,
          -0.12964344,
          -0.110345207,
          -0.227027103,
          -0.264646202,
          -0.234442115,
          -0.132154047,
          -0.215802655,
          -0.109905168,
          -0.214053184,
          -0.192721546,
          -0.213040039,
          -0.192694724,
          -0.202820912,
          -0.225208923,
          -0.0745372623,
          -0.147442147,
          -0.209100142,
          -0.0710253268,
          -0.178603664,
          -0.127947673,
          -0.207287937,
          -0.149714917,
          -0.142895877,
          -0.168002233,
          -0.13085714,
          -0.233056441,
          -0.19205299,
          -0.0908733085,
          -0.192933023,
          -0.113924362,
          -0.231104225,
          -0.226872548,
          -0.198851988,
          -0.152644038,
          -0.0792986229,
          -0.259351343,
          -0.0577487461,
          -0.13116172,
          -0.130697638,
          -0.102985851,
          -0.170827329,
          -0.093243584,
          -0.170331389,
          -0.116558805,
          -0.142832577,
          -0.0650850534,
          -0.176155582,
          -0.16359216,
          -0.126984701,
          -0.0930015,
          -0.100399517,
          -0.251229316,
          -0.160525158,
          -0.223117977,
          -0.157906756,
          -0.166172296,
          -0.0877827778,
          -0.181106538,
          -0.247649208,
          -0.11558944,
          -0.152517363,
          -0.274380922,
          -0.0783683509,
          -0.0684515163,
          -0.286997944,
          -0.100906119,
          -0.174805105,
          -0.188863233,
          -0.172321871,
          -0.212123528,
          -0.177889407,
          -0.170237973,
          -0.170780778,
          -0.136199743,
          -0.216502592,
          -0.0826280266,
          -0.236270428,
          -0.154247507,
          -0.156484798,
          -0.25915572,
          -0.153399706,
          -0.157230526,
          -0.277453631,
          -0.0667739585,
          -0.13070178,
          -0.173788726,
          -0.148188084,
          -0.162508339,
          -0.210951582,
          -0.211614639,
          -0.22029525,
          -0.108762428,
          -0.145593151,
          -0.135113209,
          -0.195287049,
          -0.186335847,
          -0.254705161,
          -0.0252041072,
          -0.0947617,
          -0.103560463,
          -0.196783096,
          -0.181651458,
          -0.134463027,
          -0.082233,
          -0.223707616,
          -0.225664794,
          -0.226785764,
          -0.0526440516,
          -0.19481419,
          -0.0867564753,
          -0.158034652,
          -0.187751099,
          -0.21007809,
          -0.161422238,
          -0.124590166,
          -0.17577152,
          -0.133919194,
          -0.0780220926,
          -0.106518,
          -0.0910665393,
          -0.0839818716,
          -0.206526771,
          -0.111789651,
          -0.230794206,
          -0.20056425,
          -0.22099416,
          -0.204781666,
          -0.104343094,
          -0.192949474,
          -0.179241464,
          -0.220676914,
          -0.179246858,
          -0.167434737,
          -0.233521596,
          -0.21066615,
          -0.0786769837,
          -0.209609956,
          -0.216918617,
          -0.156109869,
          -0.175365642,
          -0.15500097,
          -0.244005814,
          -0.0706438124,
          -0.238745824,
          -0.121314272,
          -0.09190806,
          -0.183616072,
          -0.146349669,
          -0.224116832,
          -0.232695267,
          -0.174636498,
          -0.128991261,
          -0.165503025,
          -0.173243329,
          -0.149497494,
          -0.132888347,
          -0.155586198,
          -0.182373121,
          -0.106404409,
          -0.218115836,
          -0.224665254,
          -0.0920161754,
          -0.0966775045,
          -0.129030377,
          -0.0544745401,
          -0.1861251,
          -0.240557089,
          -0.0672784522,
          -0.236054152,
          -0.113345727,
          -0.175710723,
          -0.135981932,
          -0.0533796698,
          -0.0464901,
          -0.230731979,
          -0.207894742,
          -0.0805182606,
          -0.113668092,
          -0.101928644,
          -0.107161812,
          -0.164260879,
          -0.157252714,
          -0.259330451,
          -0.218792871,
          -0.0985204577,
          -0.233750731,
          -0.123697318,
          -0.211466,
          -0.2374672,
          -0.104428932,
          -0.104907215,
          -0.104461387,
          -0.2649602,
          -0.0977974162,
          -0.162198365,
          -0.218437552,
          -0.14343445,
          -0.136193067,
          -0.26551035,
          -0.115686476,
          -0.139931545,
          -0.250050545,
          -0.208383441,
          -0.177003846,
          -0.172181845,
          -0.259392083,
          -0.169499025,
          -0.0917983353,
          -0.158879742,
          -0.143321484,
          -0.258669406,
          -0.104413249,
          -0.151849464,
          -0.202592269,
          -0.146897808,
          -0.14170672,
          -0.0952763632,
          -0.210222438,
          -0.114294924,
          -0.107270867,
          -0.245496407,
          -0.217846334,
          -0.188115925,
          -0.244936168,
          -0.186971501,
          -0.0369274318,
          -0.0406932905,
          -0.213038325,
          -0.0923971087,
          -0.193278447,
          -0.109627865,
          -0.105438516,
          -0.083562918,
          -0.099317,
          -0.179670066,
          -0.152452439,
          -0.170069,
          -0.0858897269,
          -0.184459344,
          -0.147210926,
          -0.218057066,
          -0.118403934,
          -0.212783009,
          -0.210941106,
          -0.227006808,
          -0.206899,
          -0.175710618,
          -0.185726032,
          -0.17820923,
          -0.222985417,
          -0.227692023,
          -0.0965559781,
          -0.226143226,
          -0.216705129,
          -0.164196134,
          -0.136539087,
          -0.15723972,
          -0.103797697,
          -0.190591365,
          -0.117134482,
          -0.235229105,
          -0.220664725,
          -0.0957260951,
          -0.169941112,
          -0.163476422,
          -0.244084239,
          -0.0750596821,
          -0.0631352589,
          -0.0830232501,
          -0.220213398,
          -0.131865308,
          -0.154383391,
          -0.236227334,
          -0.162490085,
          -0.21523799,
          -0.0920247361,
          -0.204065382,
          -0.102841169,
          -0.119612269,
          -0.16002205,
          -0.0826576725,
          -0.199506789,
          -0.0889796168,
          -0.234877631,
          -0.143261775,
          -0.218257293,
          -0.138887376,
          -0.122860722,
          -0.262572914,
          -0.151249692,
          -0.0579157658,
          -0.238871962,
          -0.106227465,
          -0.220384508,
          -0.101734512,
          -0.0691973567,
          -0.0844825059,
          -0.127587199,
          -0.19365789,
          -0.111989036,
          -0.0744565055,
          -0.0951652676,
          -0.145944312,
          -0.221831456,
          -0.237973481,
          -0.117908247,
          -0.10554862,
          -0.183517307,
          -0.178125843,
          -0.219803452,
          -0.250246435,
          -0.165804103,
          -0.179253891,
          -0.110657349,
          -0.170990184,
          -0.190188289,
          -0.129221737,
          -0.151876539,
          -0.177024871,
          -0.120276302,
          -0.238923445,
          -0.224720985,
          -0.114698716,
          -0.232736707,
          -0.238577381,
          -0.222639188,
          -0.167865232,
          -0.0699179396,
          -0.242840216,
          -0.203998595,
          -0.20327203,
          -0.0887796432,
          -0.258334756,
          -0.106442876,
          -0.176629707,
          -0.246433586,
          -0.14389047,
          -0.162301973,
          -0.157426313,
          -0.144770637,
          -0.199454471,
          -0.140912801,
          -0.247386947,
          -0.203675568,
          -0.123863101,
          -0.225444809,
          -0.0705875531,
          -0.184189811,
          -0.211435825,
          -0.132156357,
          -0.115384,
          -0.147255406,
          -0.220204175,
          -0.084871456,
          -0.0916651264,
          -0.087489225,
          -0.0663615093,
          -0.0864730775,
          -0.101640835,
          -0.137637645,
          -0.14498885,
          -0.235305175,
          -0.244358435,
          -0.124234602,
          -0.0366894603,
          -0.188251838,
          -0.232004896,
          -0.12709102,
          -0.0820394456,
          -0.135856599,
          -0.257772028,
          -0.18146567,
          -0.256612808,
          -0.216276601,
          -0.218472332,
          -0.120838799,
          -0.0632413104,
          -0.174726129,
          -0.245189503,
          -0.158088312,
          -0.181902289,
          -0.25469768,
          -0.180099264,
          -0.14777419,
          -0.123499736,
          -0.196799546,
          -0.177536234,
          -0.243127346,
          -0.143883914,
          -0.116246223,
          -0.259868354,
          -0.144098774,
          -0.246895388,
          -0.109398529,
          -0.163576722,
          -0.216165289,
          -0.11698477,
          -0.218853652,
          -0.156309441,
          -0.131558836,
          -0.181982741,
          -0.100292452,
          -0.136065856,
          -0.143047139,
          -0.130129635,
          -0.166847318,
          -0.172658786,
          -0.143921897,
          -0.0927696,
          -0.181571081,
          -0.111030012,
          -0.114632837,
          -0.23278743,
          -0.26368323,
          -0.136239842,
          -0.275944889,
          -0.165150791,
          -0.160083145,
          -0.0501299873,
          -0.1100474,
          -0.135966554,
          -0.166509554,
          -0.124170519,
          -0.150110379,
          -0.240255728,
          -0.162608013,
          -0.108860552,
          -0.106417805,
          -0.189951345,
          -0.0633865446,
          -0.161860153,
          -0.134263128,
          -0.196721926,
          -0.121241949,
          -0.185932577,
          -0.212236658,
          -0.234006375,
          -0.143922493,
          -0.24927488,
          -0.103463165,
          -0.0754222944,
          -0.233962953,
          -0.209100083,
          -0.171341732,
          -0.185592085,
          -0.188727289,
          -0.0660647824,
          -0.0741275623,
          -0.260139465,
          -0.207286596,
          -0.120819218,
          -0.270629317,
          -0.172493339,
          -0.235742494,
          -0.257672906,
          -0.134511009,
          -0.223709494,
          -0.159202665,
          -0.145686045,
          -0.108894959,
          -0.109864056,
          -0.155670896,
          -0.0643351302,
          -0.147214264,
          -0.187160879,
          -0.151493803,
          -0.118353248,
          -0.131947815,
          -0.139073595,
          -0.199114516,
          -0.26038307,
          -0.0846225321,
          -0.235488847,
          -0.130005687,
          -0.207726747,
          -0.197034776,
          -0.229271442,
          -0.107902363,
          -0.153539672,
          -0.2378,
          -0.243126452,
          -0.0285569616,
          -0.0736554414,
          -0.234954163,
          -0.168431684,
          -0.146942556,
          -0.134150371,
          -0.175726026,
          -0.137981802,
          -0.119914,
          -0.0946131274,
          -0.0857061371,
          -0.095510684,
          -0.166017205,
          -0.0883322433,
          -0.200345054,
          -0.117398836,
          -0.0868931934,
          -0.250360399,
          -0.19181031,
          -0.196581766,
          -0.161917105,
          -0.165910512,
          -0.114756688,
          -0.0762479082,
          -0.111809589,
          -0.234211355,
          -0.175632313,
          -0.157083496,
          -0.188856229,
          -0.204981744,
          -0.0863586888,
          -0.233606517,
          -0.219626829,
          -0.191562176,
          -0.257616103,
          -0.217388943,
          -0.223153323,
          -0.25192374,
          -0.0901491046,
          -0.12050128,
          -0.267194897,
          -0.0492417477,
          -0.117773853,
          -0.144943193,
          -0.185975119,
          -0.0700281337,
          -0.0841286182,
          -0.153588831,
          -0.207976535,
          -0.1956117,
          -0.113562107,
          -0.227802455,
          -0.207110941,
          -0.193697885,
          -0.158875018,
          -0.165295362,
          -0.153817341,
          -0.0954244584,
          -0.141250625,
          -0.191306517,
          -0.17037338,
          -0.171775654,
          -0.252715707,
          -0.118737787,
          -0.168508619,
          -0.12447118,
          -0.191916272,
          -0.0818779469,
          -0.0867736265,
          -0.108550221,
          -0.0617090501,
          -0.197487593,
          -0.124270022,
          -0.19072473,
          -0.186431259,
          -0.0862045139,
          -0.0539920554,
          -0.134026617,
          -0.253173411,
          -0.103050545,
          -0.0591367632,
          -0.245166183,
          -0.11902713,
          -0.190461859,
          -0.0675086528,
          -0.222641915,
          -0.133832082,
          -0.177031249,
          -0.186231762,
          -0.250603557,
          -0.201889768,
          -0.134956196,
          -0.210710153,
          -0.124968275,
          -0.139842808,
          -0.176684946,
          -0.194685578,
          -0.12054906,
          -0.246140957,
          -0.164987326,
          -0.182964414,
          -0.249459714,
          -0.166586488,
          -0.14143455,
          -0.115860127,
          -0.0811381787,
          -0.223237738,
          -0.0934504867,
          -0.232742503,
          -0.0455657579,
          -0.187424853,
          -0.23993212,
          -0.20194526,
          -0.210058242,
          -0.18100737,
          -0.147422448,
          -0.0943722874,
          -0.191922069,
          -0.160989,
          -0.116512813,
          -0.205844373,
          -0.171697944,
          -0.145269334,
          -0.161180586,
          -0.166501492,
          -0.17134279,
          -0.248850644,
          -0.208995044,
          -0.0766196251,
          -0.137341872,
          -0.242639065,
          -0.0773345903,
          -0.143041253,
          -0.241192102,
          -0.0509182066,
          -0.169494793,
          -0.107357122,
          -0.189369559,
          -0.146190599,
          -0.0790531933,
          -0.159049,
          -0.236253291,
          -0.20723395,
          -0.122524127,
          -0.109436102,
          -0.125998795,
          -0.127515182,
          -0.23244673,
          -0.134751976,
          -0.130722284,
          -0.170143634,
          -0.198314056,
          -0.234092295,
          -0.246239528,
          -0.14262262,
          -0.160459,
          -0.235533312,
          -0.0692569,
          -0.186538741,
          -0.178216338,
          -0.182753175,
          -0.217284456,
          -0.139139503,
          -0.191400945,
          -0.211294129,
          -0.192084908,
          -0.119249851,
          -0.258196384,
          -0.194328845,
          -0.116417296,
          -0.0847084671,
          -0.126196191,
          -0.107798584,
          -0.192863464,
          -0.12738429,
          -0.180045441,
          -0.214342788,
          -0.181379497,
          -0.0867519826,
          -0.237047166,
          -0.110846311,
          -0.151563317,
          -0.220869705,
          -0.110793076,
          -0.118359685,
          -0.223207086,
          -0.144929275,
          -0.280446947,
          -0.142987669,
          -0.102084458,
          -0.155361041,
          -0.13173309,
          -0.110644348,
          -0.133628011,
          -0.127323315,
          -0.15356791,
          -0.110668197,
          -0.153177977,
          -0.0866766721,
          -0.189191923,
          -0.112240687,
          -0.12098746,
          -0.0826956332,
          -0.130465895,
          -0.0711681,
          -0.163182929,
          -0.148263946,
          -0.1185169,
          -0.188204303,
          -0.1604985,
          -0.18111977,
          -0.261111528,
          -0.113998584,
          -0.251834214,
          -0.0754709616,
          -0.119934604,
          -0.175076485,
          -0.104068734,
          -0.187417164,
          -0.2347271,
          -0.199313313,
          -0.0655863732,
          -0.139806658,
          -0.21304594,
          -0.100968242,
          -0.235420734,
          -0.256540298,
          -0.254858911,
          -0.194907799,
          -0.119035505,
          -0.212806702,
          -0.14179787,
          -0.122797556,
          -0.22263588,
          -0.23404339,
          -0.159526214,
          -0.251981854,
          -0.115980864,
          -0.238459542,
          -0.179821923,
          -0.124895751,
          -0.232196,
          -0.158914357,
          -0.134614259,
          -0.227225199,
          -0.117916055,
          -0.17960833,
          -0.200539216,
          -0.212352097,
          -0.207210183,
          -0.10348276,
          -0.264011502,
          -0.240071774,
          -0.204666823,
          -0.17955792,
          -0.196413517,
          -0.0355472229,
          -0.0473856963,
          -0.0941019952,
          -0.0609992854,
          -0.196979135,
          -0.200845271,
          -0.0752136558,
          -0.216071159,
          -0.188168123,
          -0.129735261,
          -0.156688273,
          -0.0675354376,
          -0.134913713,
          -0.0748219118,
          -0.238243937,
          -0.228653684,
          -0.0651728958,
          -0.225778371,
          -0.100708447,
          -0.205577105,
          -0.129970744,
          -0.183765873,
          -0.0646280423,
          -0.162979856,
          -0.173282802,
          -0.160137,
          -0.129851773,
          -0.107803129,
          -0.170152724,
          -0.0982774496,
          -0.155414686,
          -0.150358915,
          -0.0595023334,
          -0.216658533,
          -0.206790656,
          -0.24128978,
          -0.236474991,
          -0.15901874,
          -0.1759554,
          -0.166617632,
          -0.264895916,
          -0.184334233,
          -0.194508612,
          -0.137081757,
          -0.204058141,
          -0.0680976063,
          -0.237617373,
          -0.166543201,
          -0.0738477,
          -0.257096082,
          -0.151873246,
          -0.111156084,
          -0.122791298,
          -0.275499403,
          -0.186105072,
          -0.187840372,
          -0.115977749,
          -0.139695868,
          -0.191569209,
          -0.179045439,
          -0.121155374,
          -0.112308934,
          -0.282698691,
          -0.177505285,
          -0.124324672,
          -0.182659402,
          -0.153809845,
          -0.148513138,
          -0.214882061,
          -0.170770749,
          -0.154586136,
          -0.100167796,
          -0.24145259,
          -0.123805411,
          -0.161725521,
          -0.0832148716,
          -0.149300784,
          -0.193145186,
          -0.143191487,
          -0.232641608,
          -0.0920196474,
          -0.14173615,
          -0.227970883,
          -0.194027141,
          -0.143854797,
          -0.17465882,
          -0.0960851312,
          -0.0756308362,
          -0.121396095,
          -0.123329036,
          -0.170241341,
          -0.137499571,
          -0.27180627,
          -0.137013584,
          -0.174944058,
          -0.166487828,
          -0.119575717,
          -0.208338439,
          -0.236327633,
          -0.193658069,
          -0.192673847,
          -0.172279105,
          -0.170343488,
          -0.206219077,
          -0.117055319,
          -0.184381545,
          -0.226653293,
          -0.221504986,
          -0.12593849,
          -0.143362075,
          -0.129754901,
          -0.247710049,
          -0.127538577,
          -0.159221753,
          -0.0496261977,
          -0.21235244,
          -0.125179455,
          -0.212454975,
          -0.157691196,
          -0.0936964899,
          -0.228894517,
          -0.138287976,
          -0.133600608,
          -0.260334551,
          -0.103762858,
          -0.220126107,
          -0.152584195,
          -0.185340866,
          -0.092268534,
          -0.170821324,
          -0.0905692652,
          -0.148264065,
          -0.212635547,
          -0.180511102,
          -0.207070798,
          -0.222931504,
          -0.0791357905,
          -0.098315,
          -0.0779613405,
          -0.109148286,
          -0.0514051467,
          -0.166918561,
          -0.271394372,
          -0.218059778,
          -0.0944681093,
          -0.2463471,
          -0.122595593,
          -0.183901116,
          -0.173500672,
          -0.236657515,
          -0.0553723499,
          -0.149130583,
          -0.209114209,
          -0.108698048,
          -0.11892537,
          -0.264633954,
          -0.233509615,
          -0.173985466,
          -0.0783191845,
          -0.246252313,
          -0.159884661,
          -0.183377549,
          -0.117260657,
          -0.213028044,
          -0.182305872,
          -0.129322127,
          -0.215131268,
          -0.231748387,
          -0.214639887,
          -0.172086775,
          -0.105565466,
          -0.133331344,
          -0.205895141,
          -0.205975041,
          -0.150798157,
          -0.165092304,
          -0.0845562592,
          -0.146334827,
          -0.0470843911,
          -0.201515988,
          -0.201987356,
          -0.253098637,
          -0.203466281,
          -0.118927687,
          -0.112222895,
          -0.0936150551,
          -0.202608347,
          -0.259272307,
          -0.228627622,
          -0.228339225,
          -0.231823325,
          -0.291381478,
          -0.0829762667,
          -0.085485138,
          -0.256793559,
          -0.0820415244,
          -0.132607639,
          -0.243258595,
          -0.0648687258,
          -0.20774883,
          -0.0948750153,
          -0.198616549,
          -0.0839005,
          -0.142220706,
          -0.177960053,
          -0.0862928256,
          -0.179984093,
          -0.102928609,
          -0.0645287,
          -0.14617382,
          -0.0985816568,
          -0.156748489,
          -0.171795577,
          -0.177609339,
          -0.172715366,
          -0.12814568,
          -0.207576096,
          -0.10270147,
          -0.236651748,
          -0.12635608,
          -0.126952842,
          -0.204668686,
          -0.0920342878,
          -0.170243204,
          -0.110882893,
          -0.119488582,
          -0.17284362,
          -0.220114931,
          -0.185211465,
          -0.137137741,
          -0.127593368,
          -0.187460899,
          -0.208523527,
          -0.210400239,
          -0.198304892,
          -0.197473347,
          -0.130147874,
          -0.111765958,
          -0.1213874,
          -0.22085014,
          -0.18446523,
          -0.16806151,
          -0.157246783,
          -0.220512435,
          -0.182795629,
          -0.204868048,
          -0.0516242348,
          -0.0912418962,
          -0.104305521,
          -0.109287821,
          -0.177576214,
          -0.17152001,
          -0.225002408,
          -0.148557693,
          -0.186430916,
          -0.22926569,
          -0.0865857825,
          -0.17804563,
          -0.104848064,
          -0.182675704,
          -0.148665354,
          -0.162747547,
          -0.0602860972,
          -0.145047709,
          -0.119968429,
          -0.213429332,
          -0.12370766,
          -0.0532589555,
          -0.143956706,
          -0.145110905,
          -0.257676154,
          -0.219533086,
          -0.177629471,
          -0.197144851,
          -0.197389543,
          -0.157436341,
          -0.0921063274,
          -0.234449148,
          -0.210957021,
          -0.0899031609,
          -0.238425851,
          -0.109399348,
          -0.20289579,
          -0.11757043,
          -0.214955792,
          -0.131698251,
          -0.219571561,
          -0.244865298,
          -0.116625533,
          -0.188378,
          -0.204362497,
          -0.0855029,
          -0.20749779,
          -0.259213388,
          -0.154686823,
          -0.124344982,
          -0.157127097,
          -0.0920448452,
          -0.176894709,
          -0.155433029,
          -0.246821895,
          -0.0440540873,
          -0.162698641,
          -0.197252244,
          -0.0747524351,
          -0.226079702,
          -0.188056126,
          -0.114673376,
          -0.127820656,
          -0.246448025,
          -0.195965856,
          -0.144533068,
          -0.160816848,
          -0.173262596,
          -0.216263726,
          -0.231282726,
          -0.140683442,
          -0.169386476,
          -0.237794161,
          -0.142056718,
          -0.143493891,
          -0.0544460751,
          -0.188444585,
          -0.203920186,
          -0.190242246,
          -0.155885682,
          -0.0528292507,
          -0.0978256837,
          -0.165558413,
          -0.227682695,
          -0.139153868,
          -0.0729187205,
          -0.0911489874,
          -0.224259377,
          -0.161648199,
          -0.12887992,
          -0.144175813,
          -0.136729687,
          -0.132963657,
          -0.201147616,
          -0.168168366,
          -0.193046,
          -0.135974094,
          -0.091933459,
          -0.150189951,
          -0.245322764,
          -0.178123385,
          -0.178223833,
          -0.205094829,
          -0.17249462,
          -0.161323592,
          -0.167612717,
          -0.154143304,
          -0.269590735,
          -0.252774119,
          -0.250660747,
          -0.171028391,
          -0.185880885,
          -0.157110214,
          -0.209709913,
          -0.145022824,
          -0.105990298,
          -0.114631832,
          -0.185244933,
          -0.159670472,
          -0.199911639,
          -0.0967316777,
          -0.160958201,
          -0.0642041117,
          -0.135881454,
          -0.0840246156,
          -0.232751846,
          -0.204469964,
          -0.270703018,
          -0.122726753,
          -0.184543908,
          -0.171925917,
          -0.0806843787,
          -0.119954668,
          -0.22176376,
          -0.209247947,
          -0.122774497,
          -0.25350067,
          -0.121434852,
          -0.132360712,
          -0.142143711,
          -0.098932676,
          -0.0901548713,
          -0.179366603,
          -0.197524026,
          -0.0941448,
          -0.222284824,
          -0.130222633,
          -0.143849283,
          -0.181763574,
          -0.169143051,
          -0.103136368,
          -0.202510908,
          -0.166031957,
          -0.100259259,
          -0.12977609,
          -0.165038705,
          -0.125132516,
          -0.270702213,
          -0.170818418,
          -0.115386918,
          -0.133993939,
          -0.196192041,
          -0.12436831,
          -0.0923760757,
          -0.182565421,
          -0.161454558,
          -0.114101715,
          -0.115479976,
          -0.188219011,
          -0.187256262,
          -0.0976992473,
          -0.258208066,
          -0.265246511,
          -0.104750305,
          -0.228029892,
          -0.265974909,
          -0.126587301,
