{
 "irVersion": "6",
 "opsetImport": [],
 "producerName": "tenncor",
 "producerVersion": "1.0.0",
 "domain": "com.mingkaic.tenncor",
 "modelVersion": "6",
 "docString": "",
 "graph": {
  "node": [
   {
    "input": [
     "0"
    ],
    "output": [
     "71"
    ],
    "name": "71",
    "opType": "_LINK",
    "domain": "",
    "attribute": [
     {
      "name": "layer",
      "refAttrName": "",
      "docString": "",
      "type": "GRAPH",
      "f": 0,
      "i": "0",
      "s": "",
      "g": {
       "node": [
        {
         "input": [
          "0"
         ],
         "output": [
          "6"
         ],
         "name": "6",
         "opType": "_DENSE_LAYER",
         "domain": "",
         "attribute": [
          {
           "name": "layer",
           "refAttrName": "",
           "docString": "",
           "type": "GRAPH",
           "f": 0,
           "i": "0",
           "s": "",
           "g": {
            "node": [
             {
              "input": [
               "0",
               "1"
              ],
              "output": [
               "2"
              ],
              "name": "2",
              "opType": "MATMUL",
              "domain": "",
              "attribute": [
               {
                "name": "rank_pairs",
                "refAttrName": "",
                "docString": "",
                "type": "INTS",
                "f": 0,
                "i": "0",
                "s": "",
                "floats": [],
                "ints": [
                 "0",
                 "1"
                ],
                "strings": [],
                "tensors": [],
                "graphs": [],
                "sparseTensors": []
               }
              ],
              "docString": ""
             },
             {
              "input": [
               "3"
              ],
              "output": [
               "4"
              ],
              "name": "4",
              "opType": "EXTEND",
              "domain": "",
              "attribute": [
               {
                "name": "tensor",
                "refAttrName": "",
                "docString": "",
                "type": "TENSOR",
                "f": 0,
                "i": "0",
                "s": "",
                "t": {
                 "dims": [],
                 "dataType": 0,
                 "floatData": [],
                 "int32Data": [],
                 "stringData": [],
                 "int64Data": [],
                 "name": "2",
                 "docString": "",
                 "rawData": "",
                 "externalData": [],
                 "dataLocation": "DEFAULT",
                 "doubleData": [],
                 "uint64Data": []
                },
                "floats": [],
                "ints": [],
                "strings": [],
                "tensors": [],
                "graphs": [],
                "sparseTensors": []
               }
              ],
              "docString": ""
             },
             {
              "input": [
               "2",
               "4"
              ],
              "output": [
               "5"
              ],
              "name": "5",
              "opType": "ADD",
              "domain": "",
              "attribute": [],
              "docString": ""
             },
             {
              "input": [
               "5"
              ],
              "output": [
               "6"
              ],
              "name": "6",
              "opType": "IDENTITY",
              "domain": "",
              "attribute": [],
              "docString": ""
             }
            ],
            "name": "",
            "initializer": [
             {
              "dims": [
               "3",
               "2",
               "1",
               "1",
               "1",
               "1",
               "1",
               "1"
              ],
              "dataType": 1,
              "floatData": [
               -2.621243,
               1.1818558,
               -3.47821,
               -1.61780715,
               -2.47714758,
               -1.97573686
              ],
              "int32Data": [],
              "stringData": [],
              "int64Data": [],
              "name": "1",
              "docString": "",
              "rawData": "",
              "externalData": [],
              "dataLocation": "DEFAULT",
              "doubleData": [],
              "uint64Data": []
             },
             {
              "dims": [
               "3",
               "1",
               "1",
               "1",
               "1",
               "1",
               "1",
               "1"
              ],
              "dataType": 1,
              "floatData": [
               1.47735381,
               2.08556819,
               0.505485713
              ],
              "int32Data": [],
              "stringData": [],
              "int64Data": [],
              "name": "3",
              "docString": "",
              "rawData": "",
              "externalData": [],
              "dataLocation": "DEFAULT",
              "doubleData": [],
              "uint64Data": []
             }
            ],
            "sparseInitializer": [],
            "docString": "",
            "input": [
             {
              "name": "0",
              "type": {
               "tensorType": {
                "elemType": 1,
                "shape": {
                 "dim": [
                  {
                   "denotation": "",
                   "dimValue": "2"
                  },
                  {
                   "denotation": "",
                   "dimValue": "1"
                  },
                  {
                   "denotation": "",
                   "dimValue": "1"
                  },
                  {
                   "denotation": "",
                   "dimValue": "1"
                  },
                  {
                   "denotation": "",
                   "dimValue": "1"
                  },
                  {
                   "denotation": "",
                   "dimValue": "1"
                  },
                  {
                   "denotation": "",
                   "dimValue": "1"
                  },
                  {
                   "denotation": "",
                   "dimValue": "1"
                  }
                 ]
                }
               },
               "denotation": ""
              },
              "docString": ""
             }
            ],
            "output": [
             {
              "name": "6",
              "type": {
               "tensorType": {
                "elemType": 0,
                "shape": {
                 "dim": [
                  {
                   "denotation": "",
                   "dimValue": "3"
                  },
                  {
                   "denotation": "",
                   "dimValue": "1"
                  },
                  {
                   "denotation": "",
                   "dimValue": "1"
                  },
                  {
                   "denotation": "",
                   "dimValue": "1"
                  },
                  {
                   "denotation": "",
                   "dimValue": "1"
                  },
                  {
                   "denotation": "",
                   "dimValue": "1"
                  },
                  {
                   "denotation": "",
                   "dimValue": "1"
                  },
                  {
                   "denotation": "",
                   "dimValue": "1"
                  }
                 ]
                }
               },
               "denotation": ""
              },
              "docString": ""
             }
            ],
            "valueInfo": [],
            "quantizationAnnotation": [
             {
              "tensorName": "1",
              "quantParameterTensorNames": [
               {
                "key": "TENSOR_NAME",
                "value": "weight"
               },
               {
                "key": "LEAF_USAGE",
                "value": "variable"
               }
              ]
             },
             {
              "tensorName": "3",
              "quantParameterTensorNames": [
               {
                "key": "TENSOR_NAME",
                "value": "bias"
               },
               {
                "key": "LEAF_USAGE",
                "value": "variable"
               }
              ]
             }
            ]
           },
           "floats": [],
           "ints": [],
           "strings": [],
           "tensors": [],
           "graphs": [],
           "sparseTensors": []
          }
         ],
         "docString": ""
        },
        {
         "input": [
          "6"
         ],
         "output": [
          "62"
         ],
         "name": "62",
         "opType": "_RNN_LAYER",
         "domain": "",
         "attribute": [
          {
           "name": "layer",
           "refAttrName": "",
           "docString": "",
           "type": "GRAPH",
           "f": 0,
           "i": "0",
           "s": "",
           "g": {
            "node": [
             {
              "input": [
               "6"
              ],
              "output": [
               "7"
              ],
              "name": "7",
              "opType": "SLICE",
              "domain": "",
              "attribute": [
               {
                "name": "dimension_pairs",
                "refAttrName": "",
                "docString": "",
                "type": "INTS",
                "f": 0,
                "i": "0",
                "s": "",
                "floats": [],
                "ints": [
                 "0",
                 "65535",
                 "0",
                 "65535",
                 "0",
                 "1",
                 "0",
                 "65535",
                 "0",
                 "65535",
                 "0",
                 "65535",
                 "0",
                 "65535",
                 "0",
                 "65535"
                ],
                "strings": [],
                "tensors": [],
                "graphs": [],
                "sparseTensors": []
               }
              ],
              "docString": ""
             },
             {
              "input": [
               "6"
              ],
              "output": [
               "9"
              ],
              "name": "9",
              "opType": "SLICE",
              "domain": "",
              "attribute": [
               {
                "name": "dimension_pairs",
                "refAttrName": "",
                "docString": "",
                "type": "INTS",
                "f": 0,
                "i": "0",
                "s": "",
                "floats": [],
                "ints": [
                 "0",
                 "65535",
                 "0",
                 "65535",
                 "0",
                 "1",
                 "0",
                 "65535",
                 "0",
                 "65535",
                 "0",
                 "65535",
                 "0",
                 "65535",
                 "0",
                 "65535"
                ],
                "strings": [],
                "tensors": [],
                "graphs": [],
                "sparseTensors": []
               }
              ],
              "docString": ""
             },
             {
              "input": [
               "8"
              ],
              "output": [
               "10"
              ],
              "name": "10",
              "opType": "EXTEND",
              "domain": "",
              "attribute": [
               {
                "name": "tensor",
                "refAttrName": "",
                "docString": "",
                "type": "TENSOR",
                "f": 0,
                "i": "0",
                "s": "",
                "t": {
                 "dims": [],
                 "dataType": 0,
                 "floatData": [],
                 "int32Data": [],
                 "stringData": [],
                 "int64Data": [],
                 "name": "9",
                 "docString": "",
                 "rawData": "",
                 "externalData": [],
                 "dataLocation": "DEFAULT",
                 "doubleData": [],
                 "uint64Data": []
                },
                "floats": [],
                "ints": [],
                "strings": [],
                "tensors": [],
                "graphs": [],
                "sparseTensors": []
               }
              ],
              "docString": ""
             },
             {
              "input": [
               "7",
               "10"
              ],
              "output": [
               "11"
              ],
              "name": "11",
              "opType": "CONCAT",
              "domain": "",
              "attribute": [
               {
                "name": "rank",
                "refAttrName": "",
                "docString": "",
                "type": "INT",
                "f": 0,
                "i": "0",
                "s": "",
                "floats": [],
                "ints": [],
                "strings": [],
                "tensors": [],
                "graphs": [],
                "sparseTensors": []
               }
              ],
              "docString": ""
             },
             {
              "input": [
               "11"
              ],
              "output": [
               "17"
              ],
              "name": "17",
              "opType": "_DENSE_LAYER",
              "domain": "",
              "attribute": [
               {
                "name": "layer",
                "refAttrName": "",
                "docString": "",
                "type": "GRAPH",
                "f": 0,
                "i": "0",
                "s": "",
                "g": {
                 "node": [
                  {
                   "input": [
                    "11",
                    "12"
                   ],
                   "output": [
                    "13"
                   ],
                   "name": "13",
                   "opType": "MATMUL",
                   "domain": "",
                   "attribute": [
                    {
                     "name": "rank_pairs",
                     "refAttrName": "",
                     "docString": "",
                     "type": "INTS",
                     "f": 0,
                     "i": "0",
                     "s": "",
                     "floats": [],
                     "ints": [
                      "0",
                      "1"
                     ],
                     "strings": [],
                     "tensors": [],
                     "graphs": [],
                     "sparseTensors": []
                    }
                   ],
                   "docString": ""
                  },
                  {
                   "input": [
                    "14"
                   ],
                   "output": [
                    "15"
                   ],
                   "name": "15",
                   "opType": "EXTEND",
                   "domain": "",
                   "attribute": [
                    {
                     "name": "tensor",
                     "refAttrName": "",
                     "docString": "",
                     "type": "TENSOR",
                     "f": 0,
                     "i": "0",
                     "s": "",
                     "t": {
                      "dims": [],
                      "dataType": 0,
                      "floatData": [],
                      "int32Data": [],
                      "stringData": [],
                      "int64Data": [],
                      "name": "13",
                      "docString": "",
                      "rawData": "",
                      "externalData": [],
                      "dataLocation": "DEFAULT",
                      "doubleData": [],
                      "uint64Data": []
                     },
                     "floats": [],
                     "ints": [],
                     "strings": [],
                     "tensors": [],
                     "graphs": [],
                     "sparseTensors": []
                    }
                   ],
                   "docString": ""
                  },
                  {
                   "input": [
                    "13",
                    "15"
                   ],
                   "output": [
                    "16"
                   ],
                   "name": "16",
                   "opType": "ADD",
                   "domain": "",
                   "attribute": [],
                   "docString": ""
                  },
                  {
                   "input": [
                    "16"
                   ],
                   "output": [
                    "17"
                   ],
                   "name": "17",
                   "opType": "IDENTITY",
                   "domain": "",
                   "attribute": [],
                   "docString": ""
                  }
                 ],
                 "name": "",
                 "initializer": [
                  {
                   "dims": [
                    "3",
                    "6",
                    "1",
                    "1",
                    "1",
                    "1",
                    "1",
                    "1"
                   ],
                   "dataType": 1,
                   "floatData": [
                    -1.27512944,
                    3.38464379,
                    -0.197737738,
                    -0.36273545,
                    2.31579304,
                    5.30505562,
                    -5.07022619,
                    2.14407802,
                    -1.5577606,
                    1.96781909,
                    -0.254770756,
                    0.527252495,
                    -5.846982,
                    6.28487349,
                    -4.85609865,
                    1.96606374,
                    -0.288033128,
                    0.723221421
                   ],
                   "int32Data": [],
                   "stringData": [],
                   "int64Data": [],
                   "name": "12",
                   "docString": "",
                   "rawData": "",
                   "externalData": [],
                   "dataLocation": "DEFAULT",
                   "doubleData": [],
                   "uint64Data": []
                  },
                  {
                   "dims": [
                    "3",
                    "1",
                    "1",
                    "1",
                    "1",
                    "1",
                    "1",
                    "1"
                   ],
                   "dataType": 1,
                   "floatData": [
                    1.3709743,
                    2.03277946,
                    1.41904891
                   ],
                   "int32Data": [],
                   "stringData": [],
                   "int64Data": [],
                   "name": "14",
                   "docString": "",
                   "rawData": "",
                   "externalData": [],
                   "dataLocation": "DEFAULT",
                   "doubleData": [],
                   "uint64Data": []
                  }
                 ],
                 "sparseInitializer": [],
                 "docString": "",
                 "input": [
                  {
                   "name": "11",
                   "type": {
                    "tensorType": {
                     "elemType": 1,
                     "shape": {
                      "dim": [
                       {
                        "denotation": "",
                        "dimValue": "6"
                       },
                       {
                        "denotation": "",
                        "dimValue": "1"
                       },
                       {
                        "denotation": "",
                        "dimValue": "1"
                       },
                       {
                        "denotation": "",
                        "dimValue": "1"
                       },
                       {
                        "denotation": "",
                        "dimValue": "1"
                       },
                       {
                        "denotation": "",
                        "dimValue": "1"
                       },
                       {
                        "denotation": "",
                        "dimValue": "1"
                       },
                       {
                        "denotation": "",
                        "dimValue": "1"
                       }
                      ]
                     }
                    },
                    "denotation": ""
                   },
                   "docString": ""
                  }
                 ],
                 "output": [
                  {
                   "name": "17",
                   "type": {
                    "tensorType": {
                     "elemType": 0,
                     "shape": {
                      "dim": [
                       {
                        "denotation": "",
                        "dimValue": "3"
                       },
                       {
                        "denotation": "",
                        "dimValue": "1"
                       },
                       {
                        "denotation": "",
                        "dimValue": "1"
                       },
                       {
                        "denotation": "",
                        "dimValue": "1"
                       },
                       {
                        "denotation": "",
                        "dimValue": "1"
                       },
                       {
                        "denotation": "",
                        "dimValue": "1"
                       },
                       {
                        "denotation": "",
                        "dimValue": "1"
                       },
                       {
                        "denotation": "",
                        "dimValue": "1"
                       }
                      ]
                     }
                    },
                    "denotation": ""
                   },
                   "docString": ""
                  }
                 ],
                 "valueInfo": [],
                 "quantizationAnnotation": [
                  {
                   "tensorName": "12",
                   "quantParameterTensorNames": [
                    {
                     "key": "TENSOR_NAME",
                     "value": "weight"
                    },
                    {
                     "key": "LEAF_USAGE",
                     "value": "variable"
                    }
                   ]
                  },
                  {
                   "tensorName": "14",
                   "quantParameterTensorNames": [
                    {
                     "key": "TENSOR_NAME",
                     "value": "bias"
                    },
                    {
                     "key": "LEAF_USAGE",
                     "value": "variable"
                    }
                   ]
                  }
                 ]
                },
                "floats": [],
                "ints": [],
                "strings": [],
                "tensors": [],
                "graphs": [],
                "sparseTensors": []
               }
              ],
              "docString": ""
             },
             {
              "input": [
               "17"
              ],
              "output": [
               "18"
              ],
              "name": "18",
              "opType": "TANH",
              "domain": "",
              "attribute": [],
              "docString": ""
             },
             {
              "input": [
               "6"
              ],
              "output": [
               "19"
              ],
              "name": "19",
              "opType": "SLICE",
              "domain": "",
              "attribute": [
               {
                "name": "dimension_pairs",
                "refAttrName": "",
                "docString": "",
                "type": "INTS",
                "f": 0,
                "i": "0",
                "s": "",
                "floats": [],
                "ints": [
                 "0",
                 "65535",
                 "0",
                 "65535",
                 "1",
                 "1",
                 "0",
                 "65535",
                 "0",
                 "65535",
                 "0",
                 "65535",
                 "0",
                 "65535",
                 "0",
                 "65535"
                ],
                "strings": [],
                "tensors": [],
                "graphs": [],
                "sparseTensors": []
               }
              ],
              "docString": ""
             },
             {
              "input": [
               "19",
               "18"
              ],
              "output": [
               "20"
              ],
              "name": "20",
              "opType": "CONCAT",
              "domain": "",
              "attribute": [
               {
                "name": "rank",
                "refAttrName": "",
                "docString": "",
                "type": "INT",
                "f": 0,
                "i": "0",
                "s": "",
                "floats": [],
                "ints": [],
                "strings": [],
                "tensors": [],
                "graphs": [],
                "sparseTensors": []
               }
              ],
              "docString": ""
             },
             {
              "input": [
               "20"
              ],
              "output": [
               "24"
              ],
              "name": "24",
              "opType": "_DENSE_LAYER",
              "domain": "",
              "attribute": [
               {
                "name": "layer",
                "refAttrName": "",
                "docString": "",
                "type": "GRAPH",
                "f": 0,
                "i": "0",
                "s": "",
                "g": {
                 "node": [
                  {
                   "input": [
                    "20",
                    "12"
                   ],
                   "output": [
                    "21"
                   ],
                   "name": "21",
                   "opType": "MATMUL",
                   "domain": "",
                   "attribute": [
                    {
                     "name": "rank_pairs",
                     "refAttrName": "",
                     "docString": "",
                     "type": "INTS",
                     "f": 0,
                     "i": "0",
                     "s": "",
                     "floats": [],
                     "ints": [
                      "0",
                      "1"
                     ],
                     "strings": [],
                     "tensors": [],
                     "graphs": [],
                     "sparseTensors": []
                    }
                   ],
                   "docString": ""
                  },
                  {
                   "input": [
                    "14"
                   ],
                   "output": [
                    "22"
                   ],
                   "name": "22",
                   "opType": "EXTEND",
                   "domain": "",
                   "attribute": [
                    {
                     "name": "tensor",
                     "refAttrName": "",
                     "docString": "",
                     "type": "TENSOR",
                     "f": 0,
                     "i": "0",
                     "s": "",
                     "t": {
                      "dims": [],
                      "dataType": 0,
                      "floatData": [],
                      "int32Data": [],
                      "stringData": [],
                      "int64Data": [],
                      "name": "21",
                      "docString": "",
                      "rawData": "",
                      "externalData": [],
                      "dataLocation": "DEFAULT",
                      "doubleData": [],
                      "uint64Data": []
                     },
                     "floats": [],
                     "ints": [],
                     "strings": [],
                     "tensors": [],
                     "graphs": [],
                     "sparseTensors": []
                    }
                   ],
                   "docString": ""
                  },
                  {
                   "input": [
                    "21",
                    "22"
                   ],
                   "output": [
                    "23"
                   ],
                   "name": "23",
                   "opType": "ADD",
                   "domain": "",
                   "attribute": [],
                   "docString": ""
                  },
                  {
                   "input": [
                    "23"
                   ],
                   "output": [
                    "24"
                   ],
                   "name": "24",
                   "opType": "IDENTITY",
                   "domain": "",
                   "attribute": [],
                   "docString": ""
                  }
                 ],
                 "name": "",
                 "initializer": [],
                 "sparseInitializer": [],
                 "docString": "",
                 "input": [
                  {
                   "name": "20",
                   "type": {
                    "tensorType": {
                     "elemType": 1,
                     "shape": {
                      "dim": [
                       {
                        "denotation": "",
                        "dimValue": "6"
                       },
                       {
                        "denotation": "",
                        "dimValue": "1"
                       },
                       {
                        "denotation": "",
                        "dimValue": "1"
                       },
                       {
                        "denotation": "",
                        "dimValue": "1"
                       },
                       {
                        "denotation": "",
                        "dimValue": "1"
                       },
                       {
                        "denotation": "",
                        "dimValue": "1"
                       },
                       {
                        "denotation": "",
                        "dimValue": "1"
                       },
                       {
                        "denotation": "",
                        "dimValue": "1"
                       }
                      ]
                     }
                    },
                    "denotation": ""
                   },
                   "docString": ""
                  }
                 ],
                 "output": [
                  {
                   "name": "24",
                   "type": {
                    "tensorType": {
                     "elemType": 0,
                     "shape": {
                      "dim": [
                       {
                        "denotation": "",
                        "dimValue": "3"
                       },
                       {
                        "denotation": "",
                        "dimValue": "1"
                       },
                       {
                        "denotation": "",
                        "dimValue": "1"
                       },
                       {
                        "denotation": "",
                        "dimValue": "1"
                       },
                       {
                        "denotation": "",
                        "dimValue": "1"
                       },
                       {
                        "denotation": "",
                        "dimValue": "1"
                       },
                       {
                        "denotation": "",
                        "dimValue": "1"
                       },
                       {
                        "denotation": "",
                        "dimValue": "1"
                       }
                      ]
                     }
                    },
                    "denotation": ""
                   },
                   "docString": ""
                  }
                 ],
                 "valueInfo": [],
                 "quantizationAnnotation": []
                },
                "floats": [],
                "ints": [],
                "strings": [],
                "tensors": [],
                "graphs": [],
                "sparseTensors": []
               }
              ],
              "docString": ""
             },
             {
              "input": [
               "24"
              ],
              "output": [
               "25"
              ],
              "name": "25",
              "opType": "TANH",
              "domain": "",
              "attribute": [],
              "docString": ""
             },
             {
              "input": [
               "6"
              ],
              "output": [
               "26"
              ],
              "name": "26",
              "opType": "SLICE",
              "domain": "",
              "attribute": [
               {
                "name": "dimension_pairs",
                "refAttrName": "",
                "docString": "",
                "type": "INTS",
                "f": 0,
                "i": "0",
                "s": "",
                "floats": [],
                "ints": [
                 "0",
                 "65535",
                 "0",
                 "65535",
                 "2",
                 "1",
                 "0",
                 "65535",
                 "0",
                 "65535",
                 "0",
                 "65535",
                 "0",
                 "65535",
                 "0",
                 "65535"
                ],
                "strings": [],
                "tensors": [],
                "graphs": [],
                "sparseTensors": []
               }
              ],
              "docString": ""
             },
             {
              "input": [
               "26",
               "25"
              ],
              "output": [
               "27"
              ],
              "name": "27",
              "opType": "CONCAT",
              "domain": "",
              "attribute": [
               {
                "name": "rank",
                "refAttrName": "",
                "docString": "",
                "type": "INT",
                "f": 0,
                "i": "0",
                "s": "",
                "floats": [],
                "ints": [],
                "strings": [],
                "tensors": [],
                "graphs": [],
                "sparseTensors": []
               }
              ],
              "docString": ""
             },
             {
              "input": [
               "27"
              ],
              "output": [
               "31"
              ],
              "name": "31",
              "opType": "_DENSE_LAYER",
              "domain": "",
              "attribute": [
               {
                "name": "layer",
                "refAttrName": "",
                "docString": "",
                "type": "GRAPH",
                "f": 0,
                "i": "0",
                "s": "",
                "g": {
                 "node": [
                  {
                   "input": [
                    "27",
                    "12"
                   ],
                   "output": [
                    "28"
                   ],
                   "name": "28",
                   "opType": "MATMUL",
                   "domain": "",
                   "attribute": [
                    {
                     "name": "rank_pairs",
                     "refAttrName": "",
                     "docString": "",
                     "type": "INTS",
                     "f": 0,
                     "i": "0",
                     "s": "",
                     "floats": [],
                     "ints": [
                      "0",
                      "1"
                     ],
                     "strings": [],
                     "tensors": [],
                     "graphs": [],
                     "sparseTensors": []
                    }
                   ],
                   "docString": ""
                  },
                  {
                   "input": [
                    "14"
                   ],
                   "output": [
                    "29"
                   ],
                   "name": "29",
                   "opType": "EXTEND",
                   "domain": "",
                   "attribute": [
                    {
                     "name": "tensor",
                     "refAttrName": "",
                     "docString": "",
                     "type": "TENSOR",
                     "f": 0,
                     "i": "0",
                     "s": "",
                     "t": {
                      "dims": [],
                      "dataType": 0,
                      "floatData": [],
                      "int32Data": [],
                      "stringData": [],
                      "int64Data": [],
                      "name": "28",
                      "docString": "",
                      "rawData": "",
                      "externalData": [],
                      "dataLocation": "DEFAULT",
                      "doubleData": [],
                      "uint64Data": []
                     },
                     "floats": [],
                     "ints": [],
                     "strings": [],
                     "tensors": [],
                     "graphs": [],
                     "sparseTensors": []
                    }
                   ],
                   "docString": ""
                  },
                  {
                   "input": [
                    "28",
                    "29"
                   ],
                   "output": [
                    "30"
                   ],
                   "name": "30",
                   "opType": "ADD",
                   "domain": "",
                   "attribute": [],
                   "docString": ""
                  },
                  {
                   "input": [
                    "30"
                   ],
                   "output": [
                    "31"
                   ],
                   "name": "31",
                   "opType": "IDENTITY",
                   "domain": "",
                   "attribute": [],
                   "docString": ""
                  }
                 ],
                 "name": "",
                 "initializer": [],
                 "sparseInitializer": [],
                 "docString": "",
                 "input": [
                  {
                   "name": "27",
                   "type": {
                    "tensorType": {
                     "elemType": 1,
                     "shape": {
                      "dim": [
                       {
                        "denotation": "",
                        "dimValue": "6"
                       },
                       {
                        "denotation": "",
                        "dimValue": "1"
                       },
                       {
                        "denotation": "",
                        "dimValue": "1"
                       },
                       {
                        "denotation": "",
                        "dimValue": "1"
                       },
                       {
                        "denotation": "",
                        "dimValue": "1"
                       },
                       {
                        "denotation": "",
                        "dimValue": "1"
                       },
                       {
                        "denotation": "",
                        "dimValue": "1"
                       },
                       {
                        "denotation": "",
                        "dimValue": "1"
                       }
                      ]
                     }
                    },
                    "denotation": ""
                   },
                   "docString": ""
                  }
                 ],
                 "output": [
                  {
                   "name": "31",
                   "type": {
                    "tensorType": {
                     "elemType": 0,
                     "shape": {
                      "dim": [
                       {
                        "denotation": "",
                        "dimValue": "3"
                       },
                       {
                        "denotation": "",
                        "dimValue": "1"
                       },
                       {
                        "denotation": "",
                        "dimValue": "1"
                       },
                       {
                        "denotation": "",
                        "dimValue": "1"
                       },
                       {
                        "denotation": "",
                        "dimValue": "1"
                       },
                       {
                        "denotation": "",
                        "dimValue": "1"
                       },
                       {
                        "denotation": "",
                        "dimValue": "1"
                       },
                       {
                        "denotation": "",
                        "dimValue": "1"
                       }
                      ]
                     }
                    },
                    "denotation": ""
                   },
                   "docString": ""
                  }
                 ],
                 "valueInfo": [],
                 "quantizationAnnotation": []
                },
                "floats": [],
                "ints": [],
                "strings": [],
                "tensors": [],
                "graphs": [],
                "sparseTensors": []
               }
              ],
              "docString": ""
             },
             {
              "input": [
               "31"
              ],
              "output": [
               "32"
              ],
              "name": "32",
              "opType": "TANH",
              "domain": "",
              "attribute": [],
              "docString": ""
             },
             {
              "input": [
               "6"
              ],
              "output": [
               "33"
              ],
              "name": "33",
              "opType": "SLICE",
              "domain": "",
              "attribute": [
               {
                "name": "dimension_pairs",
                "refAttrName": "",
                "docString": "",
                "type": "INTS",
                "f": 0,
                "i": "0",
                "s": "",
                "floats": [],
                "ints": [
                 "0",
                 "65535",
                 "0",
                 "65535",
                 "3",
                 "1",
                 "0",
                 "65535",
                 "0",
                 "65535",
                 "0",
                 "65535",
                 "0",
                 "65535",
                 "0",
                 "65535"
                ],
                "strings": [],
                "tensors": [],
                "graphs": [],
                "sparseTensors": []
               }
              ],
              "docString": ""
             },
             {
              "input": [
               "33",
               "32"
              ],
              "output": [
               "34"
              ],
              "name": "34",
              "opType": "CONCAT",
              "domain": "",
              "attribute": [
               {
                "name": "rank",
                "refAttrName": "",
                "docString": "",
                "type": "INT",
                "f": 0,
                "i": "0",
                "s": "",
                "floats": [],
                "ints": [],
                "strings": [],
                "tensors": [],
                "graphs": [],
                "sparseTensors": []
               }
              ],
              "docString": ""
             },
             {
              "input": [
               "34"
              ],
              "output": [
               "38"
              ],
              "name": "38",
              "opType": "_DENSE_LAYER",
              "domain": "",
              "attribute": [
               {
                "name": "layer",
                "refAttrName": "",
                "docString": "",
                "type": "GRAPH",
                "f": 0,
                "i": "0",
                "s": "",
                "g": {
                 "node": [
                  {
                   "input": [
                    "34",
                    "12"
                   ],
                   "output": [
                    "35"
                   ],
                   "name": "35",
                   "opType": "MATMUL",
                   "domain": "",
                   "attribute": [
                    {
                     "name": "rank_pairs",
                     "refAttrName": "",
                     "docString": "",
                     "type": "INTS",
                     "f": 0,
                     "i": "0",
                     "s": "",
                     "floats": [],
                     "ints": [
                      "0",
                      "1"
                     ],
                     "strings": [],
                     "tensors": [],
                     "graphs": [],
                     "sparseTensors": []
                    }
                   ],
                   "docString": ""
                  },
                  {
                   "input": [
                    "14"
                   ],
                   "output": [
                    "36"
                   ],
                   "name": "36",
                   "opType": "EXTEND",
                   "domain": "",
                   "attribute": [
                    {
                     "name": "tensor",
                     "refAttrName": "",
                     "docString": "",
                     "type": "TENSOR",
                     "f": 0,
                     "i": "0",
                     "s": "",
                     "t": {
                      "dims": [],
                      "dataType": 0,
                      "floatData": [],
                      "int32Data": [],
                      "stringData": [],
                      "int64Data": [],
                      "name": "35",
                      "docString": "",
                      "rawData": "",
                      "externalData": [],
                      "dataLocation": "DEFAULT",
                      "doubleData": [],
                      "uint64Data": []
                     },
                     "floats": [],
                     "ints": [],
                     "strings": [],
                     "tensors": [],
                     "graphs": [],
                     "sparseTensors": []
                    }
                   ],
                   "docString": ""
                  },
                  {
                   "input": [
                    "35",
                    "36"
                   ],
                   "output": [
                    "37"
                   ],
                   "name": "37",
                   "opType": "ADD",
                   "domain": "",
                   "attribute": [],
                   "docString": ""
                  },
                  {
                   "input": [
                    "37"
                   ],
                   "output": [
                    "38"
                   ],
                   "name": "38",
                   "opType": "IDENTITY",
                   "domain": "",
                   "attribute": [],
                   "docString": ""
                  }
                 ],
                 "name": "",
                 "initializer": [],
                 "sparseInitializer": [],
                 "docString": "",
                 "input": [
                  {
                   "name": "34",
                   "type": {
                    "tensorType": {
                     "elemType": 1,
                     "shape": {
                      "dim": [
                       {
                        "denotation": "",
                        "dimValue": "6"
                       },
                       {
                        "denotation": "",
                        "dimValue": "1"
                       },
                       {
                        "denotation": "",
                        "dimValue": "1"
                       },
                       {
                        "denotation": "",
                        "dimValue": "1"
                       },
                       {
